wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define CORCON CORCON
extern volatile uint16_t  CORCON __attribute__((__sfr__));
__extension__ typedef struct tagCORCONBITS {
  union {
    struct {
      uint16_t IF:1;
      uint16_t RND:1;
      uint16_t SFA:1;
      uint16_t IPL3:1;
      uint16_t ACCSAT:1;
      uint16_t SATDW:1;
      uint16_t SATB:1;
      uint16_t SATA:1;
      uint16_t DL:3;
      uint16_t EDT:1;
      uint16_t US:2;
      uint16_t :1;
      uint16_t VAR:1;
    };
    struct {
      uint16_t :8;
      uint16_t DL0:1;
      uint16_t DL1:1;
      uint16_t DL2:1;
      uint16_t :1;
      uint16_t US0:1;
      uint16_t US1:1;
    };
  };
} CORCONBITS;
extern volatile CORCONBITS CORCONbits __attribute__((__sfr__));

#define MODCON MODCON
extern volatile uint16_t  MODCON __attribute__((__sfr__));
__extension__ typedef struct tagMODCONBITS {
  union {
    struct {
      uint16_t XWM:4;
      uint16_t YWM:4;
      uint16_t BWM:4;
      uint16_t :2;
      uint16_t YMODEN:1;
      uint16_t XMODEN:1;
    };
    struct {
      uint16_t XWM0:1;
      uint16_t XWM1:1;
      uint16_t XWM2:1;
      uint16_t XWM3:1;
      uint16_t YWM0:1;
      uint16_t YWM1:1;
      uint16_t YWM2:1;
      uint16_t YWM3:1;
      uint16_t BWM0:1;
      uint16_t BWM1:1;
      uint16_t BWM2:1;
      uint16_t BWM3:1;
    };
  };
} MODCONBITS;
extern volatile MODCONBITS MODCONbits __attribute__((__sfr__));

#define XMODSRT XMODSRT
extern volatile uint16_t  XMODSRT __attribute__((__sfr__));
#define XMODEND XMODEND
extern volatile uint16_t  XMODEND __attribute__((__sfr__));
#define YMODSRT YMODSRT
extern volatile uint16_t  YMODSRT __attribute__((__sfr__));
#define YMODEND YMODEND
extern volatile uint16_t  YMODEND __attribute__((__sfr__));
#define XBREV XBREV
extern volatile uint16_t  XBREV __attribute__((__sfr__));
__extension__ typedef struct tagXBREVBITS {
  union {
    struct {
      uint16_t XB:15;
      uint16_t BREN:1;
    };
    struct {
      uint16_t XB0:1;
      uint16_t XB1:1;
      uint16_t XB2:1;
      uint16_t XB3:1;
      uint16_t XB4:1;
      uint16_t XB5:1;
      uint16_t XB6:1;
      uint16_t XB7:1;
      uint16_t XB8:1;
      uint16_t XB9:1;
      uint16_t XB10:1;
      uint16_t XB11:1;
      uint16_t XB12:1;
      uint16_t XB13:1;
      uint16_t XB14:1;
    };
  };
} XBREVBITS;
extern volatile XBREVBITS XBREVbits __attribute__((__sfr__));

#define DISICNT DISICNT
extern volatile uint16_t  DISICNT __attribute__((__sfr__));
#define TBLPAG TBLPAG
extern volatile uint16_t  TBLPAG __attribute__((__sfr__));
typedef struct tagTBLPAGBITS {
  uint16_t TBLPAG:8;
} TBLPAGBITS;
extern volatile TBLPAGBITS TBLPAGbits __attribute__((__sfr__));

#define YPAG YPAG
extern volatile uint16_t  YPAG __attribute__((__sfr__));
typedef struct tagYPAGBITS {
  uint16_t YPAG:8;
} YPAGBITS;
extern volatile YPAGBITS YPAGbits __attribute__((__sfr__));

#define MSTRPR MSTRPR
extern volatile uint16_t  MSTRPR __attribute__((__sfr__));
typedef struct tagMSTRPRBITS {
  uint16_t NVMPR:1;
  uint16_t :3;
  uint16_t CANPR:1;
  uint16_t DMAPR:1;
} MSTRPRBITS;
extern volatile MSTRPRBITS MSTRPRbits __attribute__((__sfr__));

#define CTXTSTAT CTXTSTAT
extern volatile uint16_t  CTXTSTAT __attribute__((__sfr__));
typedef struct tagCTXTSTATBITS {
  uint16_t MCTXI:3;
  uint16_t :5;
  uint16_t CCTXI:3;
} CTXTSTATBITS;
extern volatile CTXTSTATBITS CTXTSTATbits __attribute__((__sfr__));

#define DMTCON DMTCON
extern volatile uint16_t  DMTCON __attribute__((__sfr__));
typedef struct tagDMTCONBITS {
  uint16_t :15;
  uint16_t ON:1;
} DMTCONBITS;
extern volatile DMTCONBITS DMTCONbits __attribute__((__sfr__));

#define DMTPRECLR DMTPRECLR
extern volatile uint16_t  DMTPRECLR __attribute__((__sfr__));
typedef struct tagDMTPRECLRBITS {
  uint16_t :8;
  uint16_t STEP1:8;
} DMTPRECLRBITS;
extern volatile DMTPRECLRBITS DMTPRECLRbits __attribute__((__sfr__));

#define DMTCLR DMTCLR
extern volatile uint16_t  DMTCLR __attribute__((__sfr__));
typedef struct tagDMTCLRBITS {
  uint16_t STEP2:8;
} DMTCLRBITS;
extern volatile DMTCLRBITS DMTCLRbits __attribute__((__sfr__));

#define DMTSTAT DMTSTAT
extern volatile uint16_t  DMTSTAT __attribute__((__sfr__));
typedef struct tagDMTSTATBITS {
  uint16_t WINOPN:1;
  uint16_t :4;
  uint16_t DMTEVENT:1;
  uint16_t BAD2:1;
  uint16_t BAD1:1;
} DMTSTATBITS;
extern volatile DMTSTATBITS DMTSTATbits __attribute__((__sfr__));

#define DMTCNTL DMTCNTL
extern volatile uint16_t  DMTCNTL __attribute__((__sfr__));
#define DMTCNTH DMTCNTH
extern volatile uint16_t  DMTCNTH __attribute__((__sfr__));
#define DMTHOLDREG DMTHOLDREG
extern volatile uint16_t  DMTHOLDREG __attribute__((__sfr__));
#define DMTPSCNTL DMTPSCNTL
extern volatile uint16_t  DMTPSCNTL __attribute__((__sfr__));
#define DMTPSCNTH DMTPSCNTH
extern volatile uint16_t  DMTPSCNTH __attribute__((__sfr__));
#define DMTPSINTVL DMTPSINTVL
extern volatile uint16_t  DMTPSINTVL __attribute__((__sfr__));
#define DMTPSINTVH DMTPSINTVH
extern volatile uint16_t  DMTPSINTVH __attribute__((__sfr__));
#define SENT1CON1 SENT1CON1
extern volatile uint16_t  SENT1CON1 __attribute__((__sfr__));
typedef struct tagSENT1CON1BITS {
  uint16_t NIBCNT:3;
  uint16_t :1;
  uint16_t PS:1;
  uint16_t :1;
  uint16_t SPCEN:1;
  uint16_t PPP:1;
  uint16_t CRCEN:1;
  uint16_t TXPOL:1;
  uint16_t TXM:1;
  uint16_t RCVEN:1;
  uint16_t :1;
  uint16_t SNTSIDL:1;
  uint16_t :1;
  uint16_t SNTEN:1;
} SENT1CON1BITS;
extern volatile SENT1CON1BITS SENT1CON1bits __attribute__((__sfr__));

#define SENT1CON2 SENT1CON2
extern volatile uint16_t  SENT1CON2 __attribute__((__sfr__));
#define SENT1CON3 SENT1CON3
extern volatile uint16_t  SENT1CON3 __attribute__((__sfr__));
#define SENT1STAT SENT1STAT
extern volatile uint16_t  SENT1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSENT1STATBITS {
  union {
    struct {
      uint16_t SYNCTXEN:1;
      uint16_t RXIDLE:1;
      uint16_t FRMERR:1;
      uint16_t CRCERR:1;
      uint16_t NIB:3;
      uint16_t PAUSE:1;
    };
    struct {
      uint16_t SYNC:1;
      uint16_t :3;
      uint16_t NIB0:1;
      uint16_t NIB1:1;
      uint16_t NIB2:1;
    };
    struct {
      uint16_t TXEN:1;
    };
  };
} SENT1STATBITS;
extern volatile SENT1STATBITS SENT1STATbits __attribute__((__sfr__));

