wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define U1TXCHK U1TXCHK
extern volatile uint16_t  U1TXCHK __attribute__((__sfr__));
__extension__ typedef struct tagU1TXCHKBITS {
  union {
    struct {
      uint16_t TXCHK:8;
    };
    struct {
      uint16_t TXCHK0:1;
      uint16_t TXCHK1:1;
      uint16_t TXCHK2:1;
      uint16_t TXCHK3:1;
      uint16_t TXCHK4:1;
      uint16_t TXCHK5:1;
      uint16_t TXCHK6:1;
      uint16_t TXCHK7:1;
    };
  };
} U1TXCHKBITS;
extern volatile U1TXCHKBITS U1TXCHKbits __attribute__((__sfr__));

#define U1RXCHK U1RXCHK
extern volatile uint16_t  U1RXCHK __attribute__((__sfr__));
typedef struct tagU1RXCHKBITS {
  uint16_t RXCHK:8;
} U1RXCHKBITS;
extern volatile U1RXCHKBITS U1RXCHKbits __attribute__((__sfr__));

#define U1SCCON U1SCCON
extern volatile uint16_t  U1SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU1SCCONBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t PTRCL:1;
      uint16_t T0PD:1;
      uint16_t CONV:1;
      uint16_t TXRPT:2;
    };
    struct {
      uint16_t :4;
      uint16_t TXRPT0:1;
      uint16_t TXRPT1:1;
    };
  };
} U1SCCONBITS;
extern volatile U1SCCONBITS U1SCCONbits __attribute__((__sfr__));

#define U1SCINT U1SCINT
extern volatile uint16_t  U1SCINT __attribute__((__sfr__));
typedef struct tagU1SCINTBITS {
  uint16_t GTCIE:1;
  uint16_t WTCIE:1;
  uint16_t BTCIE:1;
  uint16_t :1;
  uint16_t TXRPTIE:1;
  uint16_t RXRPTIE:1;
  uint16_t :2;
  uint16_t GTCIF:1;
  uint16_t WTCIF:1;
  uint16_t BTCIF:1;
  uint16_t :1;
  uint16_t TXRPTIF:1;
  uint16_t RXRPTIF:1;
} U1SCINTBITS;
extern volatile U1SCINTBITS U1SCINTbits __attribute__((__sfr__));

#define U1INT U1INT
extern volatile uint16_t  U1INT __attribute__((__sfr__));
typedef struct tagU1INTBITS {
  uint16_t :2;
  uint16_t ABDIE:1;
  uint16_t :3;
  uint16_t ABDIF:1;
  uint16_t WUIF:1;
} U1INTBITS;
extern volatile U1INTBITS U1INTbits __attribute__((__sfr__));

#define U2MODE U2MODE
extern volatile uint16_t  U2MODE __attribute__((__sfr__));
__extension__ typedef struct tagU2MODEBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t URXEN:1;
      uint16_t UTXEN:1;
      uint16_t ABAUD:1;
      uint16_t BRGH:1;
      uint16_t UTXBRK:1;
      uint16_t BRKOVR:1;
      uint16_t :1;
      uint16_t RXBIMD:1;
      uint16_t WAKE:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
    };
  };
} U2MODEBITS;
extern volatile U2MODEBITS U2MODEbits __attribute__((__sfr__));

#define U2MODEH U2MODEH
extern volatile uint16_t  U2MODEH __attribute__((__sfr__));
__extension__ typedef struct tagU2MODEHBITS {
  union {
    struct {
      uint16_t FLO:2;
      uint16_t UTXINV:1;
      uint16_t C0EN:1;
      uint16_t STSEL:2;
      uint16_t URXINV:1;
      uint16_t RUNOVF:1;
      uint16_t HALFDPLX:1;
      uint16_t BCLKSEL:2;
      uint16_t BCLKMOD:1;
      uint16_t :2;
      uint16_t ACTIVE:1;
      uint16_t SLPEN:1;
    };
    struct {
      uint16_t FLO0:1;
      uint16_t FLO1:1;
      uint16_t :2;
      uint16_t STSEL0:1;
      uint16_t STSEL1:1;
      uint16_t :3;
      uint16_t BCLKSEL0:1;
      uint16_t BCLKSEL1:1;
    };
  };
} U2MODEHBITS;
extern volatile U2MODEHBITS U2MODEHbits __attribute__((__sfr__));

#define U2STA U2STA
extern volatile uint16_t  U2STA __attribute__((__sfr__));
typedef struct tagU2STABITS {
  uint16_t TXCIF:1;
  uint16_t OERR:1;
  uint16_t RXBKIF:1;
  uint16_t FERR:1;
  uint16_t CERIF:1;
  uint16_t ABDOVF:1;
  uint16_t PERR:1;
  uint16_t TRMT:1;
  uint16_t TXCIE:1;
  uint16_t OERIE:1;
  uint16_t RXBKIE:1;
  uint16_t FERIE:1;
  uint16_t CERIE:1;
  uint16_t ABDOVE:1;
  uint16_t PERIE:1;
  uint16_t TXMTIE:1;
} U2STABITS;
extern volatile U2STABITS U2STAbits __attribute__((__sfr__));

#define U2STAH U2STAH
extern volatile uint16_t  U2STAH __attribute__((__sfr__));
__extension__ typedef struct tagU2STAHBITS {
  union {
    struct {
      uint16_t URXBF:1;
      uint16_t URXBE:1;
      uint16_t XON:1;
      uint16_t RIDLE:1;
      uint16_t UTXBF:1;
      uint16_t UTXBE:1;
      uint16_t STPMD:1;
      uint16_t TXWRE:1;
      uint16_t URXISEL:3;
      uint16_t :1;
      uint16_t UTXISEL:3;
    };
    struct {
      uint16_t :8;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t URXISEL2:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXISEL1:1;
      uint16_t UTXISEL2:1;
    };
  };
} U2STAHBITS;
extern volatile U2STAHBITS U2STAHbits __attribute__((__sfr__));

#define U2BRG U2BRG
extern volatile uint16_t  U2BRG __attribute__((__sfr__));
__extension__ typedef struct tagU2BRGBITS {
  union {
    struct {
      uint16_t BRG:16;
    };
    struct {
      uint16_t BRG0:1;
      uint16_t BRG1:1;
      uint16_t BRG2:1;
      uint16_t BRG3:1;
      uint16_t BRG4:1;
      uint16_t BRG5:1;
      uint16_t BRG6:1;
      uint16_t BRG7:1;
      uint16_t BRG8:1;
      uint16_t BRG9:1;
      uint16_t BRG10:1;
      uint16_t BRG11:1;
      uint16_t BRG12:1;
      uint16_t BRG13:1;
      uint16_t BRG14:1;
      uint16_t BRG15:1;
    };
  };
} U2BRGBITS;
extern volatile U2BRGBITS U2BRGbits __attribute__((__sfr__));

#define U2BRGH U2BRGH
extern volatile uint16_t  U2BRGH __attribute__((__sfr__));
__extension__ typedef struct tagU2BRGHBITS {
  union {
    struct {
      uint16_t BRG:4;
    };
    struct {
      uint16_t BRG16:1;
      uint16_t BRG1:1;
      uint16_t BRG18:1;
      uint16_t BRG19:1;
    };
  };
} U2BRGHBITS;
extern volatile U2BRGHBITS U2BRGHbits __attribute__((__sfr__));

#define U2RXREG U2RXREG
extern volatile uint16_t  U2RXREG __attribute__((__sfr__));
__extension__ typedef struct tagU2RXREGBITS {
  union {
    struct {
      uint16_t RXREG:8;
    };
    struct {
      uint16_t RXREG0:1;
      uint16_t RXREG1:1;
      uint16_t RXREG2:1;
      uint16_t RXREG3:1;
      uint16_t RXREG4:1;
      uint16_t RXREG5:1;
      uint16_t RXREG6:1;
      uint16_t RXREG7:1;
    };
  };
} U2RXREGBITS;
extern volatile U2RXREGBITS U2RXREGbits __attribute__((__sfr__));

#define U2TXREG U2TXREG
extern volatile uint16_t  U2TXREG __attribute__((__sfr__));
__extension__ typedef struct tagU2TXREGBITS {
  union {
    struct {
      uint16_t TXREG:8;
      uint16_t :7;
      uint16_t LAST:1;
    };
    struct {
      uint16_t TXREG0:1;
      uint16_t TXREG1:1;
      uint16_t TXREG2:1;
      uint16_t TXREG3:1;
      uint16_t TXREG4:1;
      uint16_t TXREG5:1;
      uint16_t TXREG6:1;
      uint16_t TXREG7:1;
    };
  };
} U2TXREGBITS;
extern volatile U2TXREGBITS U2TXREGbits __attribute__((__sfr__));

