wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define U2P1 U2P1
extern volatile uint16_t  U2P1 __attribute__((__sfr__));
__extension__ typedef struct tagU2P1BITS {
  union {
    struct {
      uint16_t P1:9;
    };
    struct {
      uint16_t P10:1;
      uint16_t P11:1;
      uint16_t P12:1;
      uint16_t P13:1;
      uint16_t P14:1;
      uint16_t P15:1;
      uint16_t P16:1;
      uint16_t P17:1;
      uint16_t P18:1;
    };
  };
} U2P1BITS;
extern volatile U2P1BITS U2P1bits __attribute__((__sfr__));

#define U2P2 U2P2
extern volatile uint16_t  U2P2 __attribute__((__sfr__));
__extension__ typedef struct tagU2P2BITS {
  union {
    struct {
      uint16_t P2:9;
    };
    struct {
      uint16_t P20:1;
      uint16_t P21:1;
      uint16_t P22:1;
      uint16_t P23:1;
      uint16_t P24:1;
      uint16_t P25:1;
      uint16_t P26:1;
      uint16_t P27:1;
      uint16_t P28:1;
    };
  };
} U2P2BITS;
extern volatile U2P2BITS U2P2bits __attribute__((__sfr__));

#define U2P3 U2P3
extern volatile uint16_t  U2P3 __attribute__((__sfr__));
__extension__ typedef struct tagU2P3BITS {
  union {
    struct {
      uint16_t P3:16;
    };
    struct {
      uint16_t P30:1;
      uint16_t P31:1;
      uint16_t P32:1;
      uint16_t P33:1;
      uint16_t P34:1;
      uint16_t P35:1;
      uint16_t P36:1;
      uint16_t P37:1;
      uint16_t P38:1;
      uint16_t P39:1;
      uint16_t P310:1;
      uint16_t P311:1;
      uint16_t P312:1;
      uint16_t P313:1;
      uint16_t P314:1;
      uint16_t P315:1;
    };
  };
} U2P3BITS;
extern volatile U2P3BITS U2P3bits __attribute__((__sfr__));

#define U2P3H U2P3H
extern volatile uint16_t  U2P3H __attribute__((__sfr__));
__extension__ typedef struct tagU2P3HBITS {
  union {
    struct {
      uint16_t P3H:8;
    };
    struct {
      uint16_t P316:1;
      uint16_t P317:1;
      uint16_t P318:1;
      uint16_t P319:1;
      uint16_t P320:1;
      uint16_t P321:1;
      uint16_t P322:1;
      uint16_t P323:1;
    };
  };
} U2P3HBITS;
extern volatile U2P3HBITS U2P3Hbits __attribute__((__sfr__));

#define U2TXCHK U2TXCHK
extern volatile uint16_t  U2TXCHK __attribute__((__sfr__));
__extension__ typedef struct tagU2TXCHKBITS {
  union {
    struct {
      uint16_t TXCHK:8;
    };
    struct {
      uint16_t TXCHK0:1;
      uint16_t TXCHK1:1;
      uint16_t TXCHK2:1;
      uint16_t TXCHK3:1;
      uint16_t TXCHK4:1;
      uint16_t TXCHK5:1;
      uint16_t TXCHK6:1;
      uint16_t TXCHK7:1;
    };
  };
} U2TXCHKBITS;
extern volatile U2TXCHKBITS U2TXCHKbits __attribute__((__sfr__));

#define U2RXCHK U2RXCHK
extern volatile uint16_t  U2RXCHK __attribute__((__sfr__));
typedef struct tagU2RXCHKBITS {
  uint16_t RXCHK:8;
} U2RXCHKBITS;
extern volatile U2RXCHKBITS U2RXCHKbits __attribute__((__sfr__));

#define U2SCCON U2SCCON
extern volatile uint16_t  U2SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU2SCCONBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t PTRCL:1;
      uint16_t T0PD:1;
      uint16_t CONV:1;
      uint16_t TXRPT:2;
    };
    struct {
      uint16_t :4;
      uint16_t TXRPT0:1;
      uint16_t TXRPT1:1;
    };
  };
} U2SCCONBITS;
extern volatile U2SCCONBITS U2SCCONbits __attribute__((__sfr__));

#define U2SCINT U2SCINT
extern volatile uint16_t  U2SCINT __attribute__((__sfr__));
typedef struct tagU2SCINTBITS {
  uint16_t GTCIE:1;
  uint16_t WTCIE:1;
  uint16_t BTCIE:1;
  uint16_t :1;
  uint16_t TXRPTIE:1;
  uint16_t RXRPTIE:1;
  uint16_t :2;
  uint16_t GTCIF:1;
  uint16_t WTCIF:1;
  uint16_t BTCIF:1;
  uint16_t :1;
  uint16_t TXRPTIF:1;
  uint16_t RXRPTIF:1;
} U2SCINTBITS;
extern volatile U2SCINTBITS U2SCINTbits __attribute__((__sfr__));

#define U2INT U2INT
extern volatile uint16_t  U2INT __attribute__((__sfr__));
typedef struct tagU2INTBITS {
  uint16_t :2;
  uint16_t ABDIE:1;
  uint16_t :3;
  uint16_t ABDIF:1;
  uint16_t WUIF:1;
} U2INTBITS;
extern volatile U2INTBITS U2INTbits __attribute__((__sfr__));

#define SPI1CON1 SPI1CON1
extern volatile uint16_t  SPI1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1BITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI1CON1BITS;
extern volatile SPI1CON1BITS SPI1CON1bits __attribute__((__sfr__));

#define SPI1CON1L SPI1CON1L
extern volatile uint16_t  SPI1CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1LBITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI1CON1LBITS;
extern volatile SPI1CON1LBITS SPI1CON1Lbits __attribute__((__sfr__));

#define SPI1CON1H SPI1CON1H
extern volatile uint16_t  SPI1CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON1HBITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI1CON1HBITS;
extern volatile SPI1CON1HBITS SPI1CON1Hbits __attribute__((__sfr__));

#define SPI1CON2 SPI1CON2
extern volatile uint16_t  SPI1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI1CON2BITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI1CON2BITS;
extern volatile SPI1CON2BITS SPI1CON2bits __attribute__((__sfr__));

#define SPI1CON2L SPI1CON2L
extern volatile uint16_t  SPI1CON2L __attribute__((__sfr__));
typedef struct tagSPI1CON2LBITS {
  uint16_t WLENGTH:5;
} SPI1CON2LBITS;
extern volatile SPI1CON2LBITS SPI1CON2Lbits __attribute__((__sfr__));

#define SPI1CON3 SPI1CON3
extern volatile uint16_t  SPI1CON3 __attribute__((__sfr__));
typedef struct tagSPI1CON3BITS {
  uint16_t WLENGTH:5;
} SPI1CON3BITS;
extern volatile SPI1CON3BITS SPI1CON3bits __attribute__((__sfr__));

#define SPI1CON2H SPI1CON2H
extern volatile uint16_t  SPI1CON2H __attribute__((__sfr__));
#define SPI1CON4 SPI1CON4
extern volatile uint16_t  SPI1CON4 __attribute__((__sfr__));
#define SPI1STATL SPI1STATL
extern volatile uint16_t  SPI1STATL __attribute__((__sfr__));
typedef struct tagSPI1STATLBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :1;
  uint16_t SPITBE:1;
  uint16_t :1;
  uint16_t SPIRBE:1;
  uint16_t SPIROV:1;
  uint16_t SRMT:1;
  uint16_t SPITUR:1;
  uint16_t :2;
  uint16_t SPIBUSY:1;
  uint16_t FRMERR:1;
} SPI1STATLBITS;
extern volatile SPI1STATLBITS SPI1STATLbits __attribute__((__sfr__));

#define SPI1STATH SPI1STATH
extern volatile uint16_t  SPI1STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI1STATHBITS {
  union {
    struct {
      uint16_t TXELM:6;
      uint16_t :2;
      uint16_t RXELM:6;
    };
    struct {
      uint16_t TXELM0:1;
      uint16_t TXELM1:1;
      uint16_t TXELM2:1;
      uint16_t TXELM3:1;
      uint16_t TXELM4:1;
      uint16_t TXELM5:1;
      uint16_t :2;
      uint16_t RXELM0:1;
      uint16_t RXELM1:1;
      uint16_t RXELM2:1;
      uint16_t RXELM3:1;
      uint16_t RXELM4:1;
      uint16_t RXELM5:1;
    };
  };
} SPI1STATHBITS;
extern volatile SPI1STATHBITS SPI1STATHbits __attribute__((__sfr__));

#define SPI1BUFL SPI1BUFL
extern volatile uint16_t  SPI1BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFLBITS {
  union {
    struct {
      uint16_t SPI1BUFL:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI1BUFLBITS;
extern volatile SPI1BUFLBITS SPI1BUFLbits __attribute__((__sfr__));

