wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define PG1CAP PG1CAP
extern volatile uint16_t  PG1CAP __attribute__((__sfr__));
#define PG2CONL PG2CONL
extern volatile uint16_t  PG2CONL __attribute__((__sfr__));
typedef struct tagPG2CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG2CONLBITS;
extern volatile PG2CONLBITS PG2CONLbits __attribute__((__sfr__));

#define PG2CONH PG2CONH
extern volatile uint16_t  PG2CONH __attribute__((__sfr__));
typedef struct tagPG2CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG2CONHBITS;
extern volatile PG2CONHBITS PG2CONHbits __attribute__((__sfr__));

#define PG2STAT PG2STAT
extern volatile uint16_t  PG2STAT __attribute__((__sfr__));
typedef struct tagPG2STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG2STATBITS;
extern volatile PG2STATBITS PG2STATbits __attribute__((__sfr__));

#define PG2IOCONL PG2IOCONL
extern volatile uint16_t  PG2IOCONL __attribute__((__sfr__));
typedef struct tagPG2IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG2IOCONLBITS;
extern volatile PG2IOCONLBITS PG2IOCONLbits __attribute__((__sfr__));

#define PG2IOCONH PG2IOCONH
extern volatile uint16_t  PG2IOCONH __attribute__((__sfr__));
typedef struct tagPG2IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG2IOCONHBITS;
extern volatile PG2IOCONHBITS PG2IOCONHbits __attribute__((__sfr__));

#define PG2EVTL PG2EVTL
extern volatile uint16_t  PG2EVTL __attribute__((__sfr__));
typedef struct tagPG2EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG2EVTLBITS;
extern volatile PG2EVTLBITS PG2EVTLbits __attribute__((__sfr__));

#define PG2EVTH PG2EVTH
extern volatile uint16_t  PG2EVTH __attribute__((__sfr__));
typedef struct tagPG2EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG2EVTHBITS;
extern volatile PG2EVTHBITS PG2EVTHbits __attribute__((__sfr__));

#define PG2FPCIL PG2FPCIL
extern volatile uint16_t  PG2FPCIL __attribute__((__sfr__));
typedef struct tagPG2FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG2FPCILBITS;
extern volatile PG2FPCILBITS PG2FPCILbits __attribute__((__sfr__));

#define PG2FPCIH PG2FPCIH
extern volatile uint16_t  PG2FPCIH __attribute__((__sfr__));
typedef struct tagPG2FPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG2FPCIHBITS;
extern volatile PG2FPCIHBITS PG2FPCIHbits __attribute__((__sfr__));

#define PG2CLPCIL PG2CLPCIL
extern volatile uint16_t  PG2CLPCIL __attribute__((__sfr__));
typedef struct tagPG2CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG2CLPCILBITS;
extern volatile PG2CLPCILBITS PG2CLPCILbits __attribute__((__sfr__));

#define PG2CLPCIH PG2CLPCIH
extern volatile uint16_t  PG2CLPCIH __attribute__((__sfr__));
typedef struct tagPG2CLPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG2CLPCIHBITS;
extern volatile PG2CLPCIHBITS PG2CLPCIHbits __attribute__((__sfr__));

#define PG2FFPCIL PG2FFPCIL
extern volatile uint16_t  PG2FFPCIL __attribute__((__sfr__));
typedef struct tagPG2FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG2FFPCILBITS;
extern volatile PG2FFPCILBITS PG2FFPCILbits __attribute__((__sfr__));

#define PG2FFPCIH PG2FFPCIH
extern volatile uint16_t  PG2FFPCIH __attribute__((__sfr__));
typedef struct tagPG2FFPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG2FFPCIHBITS;
extern volatile PG2FFPCIHBITS PG2FFPCIHbits __attribute__((__sfr__));

#define PG2SPCIL PG2SPCIL
extern volatile uint16_t  PG2SPCIL __attribute__((__sfr__));
typedef struct tagPG2SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG2SPCILBITS;
extern volatile PG2SPCILBITS PG2SPCILbits __attribute__((__sfr__));

#define PG2SPCIH PG2SPCIH
extern volatile uint16_t  PG2SPCIH __attribute__((__sfr__));
typedef struct tagPG2SPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG2SPCIHBITS;
extern volatile PG2SPCIHBITS PG2SPCIHbits __attribute__((__sfr__));

#define PG2LEBL PG2LEBL
extern volatile uint16_t  PG2LEBL __attribute__((__sfr__));
#define PG2LEBH PG2LEBH
extern volatile uint16_t  PG2LEBH __attribute__((__sfr__));
typedef struct tagPG2LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG2LEBHBITS;
extern volatile PG2LEBHBITS PG2LEBHbits __attribute__((__sfr__));

#define PG2PHASE PG2PHASE
extern volatile uint16_t  PG2PHASE __attribute__((__sfr__));
#define PG2DC PG2DC
extern volatile uint16_t  PG2DC __attribute__((__sfr__));
#define PG2DCA PG2DCA
extern volatile uint16_t  PG2DCA __attribute__((__sfr__));
typedef struct tagPG2DCABITS {
  uint16_t DCA:8;
} PG2DCABITS;
extern volatile PG2DCABITS PG2DCAbits __attribute__((__sfr__));

