wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile PG4SPCIHBITS PG4SPCIHbits __attribute__((__sfr__));

#define PG4LEBL PG4LEBL
extern volatile uint16_t  PG4LEBL __attribute__((__sfr__));
#define PG4LEBH PG4LEBH
extern volatile uint16_t  PG4LEBH __attribute__((__sfr__));
typedef struct tagPG4LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG4LEBHBITS;
extern volatile PG4LEBHBITS PG4LEBHbits __attribute__((__sfr__));

#define PG4PHASE PG4PHASE
extern volatile uint16_t  PG4PHASE __attribute__((__sfr__));
#define PG4DC PG4DC
extern volatile uint16_t  PG4DC __attribute__((__sfr__));
#define PG4DCA PG4DCA
extern volatile uint16_t  PG4DCA __attribute__((__sfr__));
typedef struct tagPG4DCABITS {
  uint16_t DCA:8;
} PG4DCABITS;
extern volatile PG4DCABITS PG4DCAbits __attribute__((__sfr__));

#define PG4PER PG4PER
extern volatile uint16_t  PG4PER __attribute__((__sfr__));
#define PG4TRIGA PG4TRIGA
extern volatile uint16_t  PG4TRIGA __attribute__((__sfr__));
#define PG4TRIGB PG4TRIGB
extern volatile uint16_t  PG4TRIGB __attribute__((__sfr__));
#define PG4TRIGC PG4TRIGC
extern volatile uint16_t  PG4TRIGC __attribute__((__sfr__));
#define PG4DTL PG4DTL
extern volatile uint16_t  PG4DTL __attribute__((__sfr__));
typedef struct tagPG4DTLBITS {
  uint16_t DTL:14;
} PG4DTLBITS;
extern volatile PG4DTLBITS PG4DTLbits __attribute__((__sfr__));

#define PG4DTH PG4DTH
extern volatile uint16_t  PG4DTH __attribute__((__sfr__));
typedef struct tagPG4DTHBITS {
  uint16_t DTH:14;
} PG4DTHBITS;
extern volatile PG4DTHBITS PG4DTHbits __attribute__((__sfr__));

#define PG4CAP PG4CAP
extern volatile uint16_t  PG4CAP __attribute__((__sfr__));
#define PG5CONL PG5CONL
extern volatile uint16_t  PG5CONL __attribute__((__sfr__));
typedef struct tagPG5CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG5CONLBITS;
extern volatile PG5CONLBITS PG5CONLbits __attribute__((__sfr__));

#define PG5CONH PG5CONH
extern volatile uint16_t  PG5CONH __attribute__((__sfr__));
typedef struct tagPG5CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG5CONHBITS;
extern volatile PG5CONHBITS PG5CONHbits __attribute__((__sfr__));

#define PG5STAT PG5STAT
extern volatile uint16_t  PG5STAT __attribute__((__sfr__));
typedef struct tagPG5STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG5STATBITS;
extern volatile PG5STATBITS PG5STATbits __attribute__((__sfr__));

#define PG5IOCONL PG5IOCONL
extern volatile uint16_t  PG5IOCONL __attribute__((__sfr__));
typedef struct tagPG5IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG5IOCONLBITS;
extern volatile PG5IOCONLBITS PG5IOCONLbits __attribute__((__sfr__));

#define PG5IOCONH PG5IOCONH
extern volatile uint16_t  PG5IOCONH __attribute__((__sfr__));
typedef struct tagPG5IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG5IOCONHBITS;
extern volatile PG5IOCONHBITS PG5IOCONHbits __attribute__((__sfr__));

#define PG5EVTL PG5EVTL
extern volatile uint16_t  PG5EVTL __attribute__((__sfr__));
typedef struct tagPG5EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG5EVTLBITS;
extern volatile PG5EVTLBITS PG5EVTLbits __attribute__((__sfr__));

#define PG5EVTH PG5EVTH
extern volatile uint16_t  PG5EVTH __attribute__((__sfr__));
typedef struct tagPG5EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG5EVTHBITS;
extern volatile PG5EVTHBITS PG5EVTHbits __attribute__((__sfr__));

#define PG5FPCIL PG5FPCIL
extern volatile uint16_t  PG5FPCIL __attribute__((__sfr__));
typedef struct tagPG5FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5FPCILBITS;
extern volatile PG5FPCILBITS PG5FPCILbits __attribute__((__sfr__));

#define PG5FPCIH PG5FPCIH
extern volatile uint16_t  PG5FPCIH __attribute__((__sfr__));
typedef struct tagPG5FPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG5FPCIHBITS;
extern volatile PG5FPCIHBITS PG5FPCIHbits __attribute__((__sfr__));

#define PG5CLPCIL PG5CLPCIL
extern volatile uint16_t  PG5CLPCIL __attribute__((__sfr__));
typedef struct tagPG5CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5CLPCILBITS;
extern volatile PG5CLPCILBITS PG5CLPCILbits __attribute__((__sfr__));

#define PG5CLPCIH PG5CLPCIH
extern volatile uint16_t  PG5CLPCIH __attribute__((__sfr__));
typedef struct tagPG5CLPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG5CLPCIHBITS;
extern volatile PG5CLPCIHBITS PG5CLPCIHbits __attribute__((__sfr__));

#define PG5FFPCIL PG5FFPCIL
extern volatile uint16_t  PG5FFPCIL __attribute__((__sfr__));
typedef struct tagPG5FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5FFPCILBITS;
