wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile PG6FFPCILBITS PG6FFPCILbits __attribute__((__sfr__));

#define PG6FFPCIH PG6FFPCIH
extern volatile uint16_t  PG6FFPCIH __attribute__((__sfr__));
typedef struct tagPG6FFPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG6FFPCIHBITS;
extern volatile PG6FFPCIHBITS PG6FFPCIHbits __attribute__((__sfr__));

#define PG6SPCIL PG6SPCIL
extern volatile uint16_t  PG6SPCIL __attribute__((__sfr__));
typedef struct tagPG6SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG6SPCILBITS;
extern volatile PG6SPCILBITS PG6SPCILbits __attribute__((__sfr__));

#define PG6SPCIH PG6SPCIH
extern volatile uint16_t  PG6SPCIH __attribute__((__sfr__));
typedef struct tagPG6SPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG6SPCIHBITS;
extern volatile PG6SPCIHBITS PG6SPCIHbits __attribute__((__sfr__));

#define PG6LEBL PG6LEBL
extern volatile uint16_t  PG6LEBL __attribute__((__sfr__));
#define PG6LEBH PG6LEBH
extern volatile uint16_t  PG6LEBH __attribute__((__sfr__));
typedef struct tagPG6LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG6LEBHBITS;
extern volatile PG6LEBHBITS PG6LEBHbits __attribute__((__sfr__));

#define PG6PHASE PG6PHASE
extern volatile uint16_t  PG6PHASE __attribute__((__sfr__));
#define PG6DC PG6DC
extern volatile uint16_t  PG6DC __attribute__((__sfr__));
#define PG6DCA PG6DCA
extern volatile uint16_t  PG6DCA __attribute__((__sfr__));
typedef struct tagPG6DCABITS {
  uint16_t DCA:8;
} PG6DCABITS;
extern volatile PG6DCABITS PG6DCAbits __attribute__((__sfr__));

#define PG6PER PG6PER
extern volatile uint16_t  PG6PER __attribute__((__sfr__));
#define PG6TRIGA PG6TRIGA
extern volatile uint16_t  PG6TRIGA __attribute__((__sfr__));
#define PG6TRIGB PG6TRIGB
extern volatile uint16_t  PG6TRIGB __attribute__((__sfr__));
#define PG6TRIGC PG6TRIGC
extern volatile uint16_t  PG6TRIGC __attribute__((__sfr__));
#define PG6DTL PG6DTL
extern volatile uint16_t  PG6DTL __attribute__((__sfr__));
typedef struct tagPG6DTLBITS {
  uint16_t DTL:14;
} PG6DTLBITS;
extern volatile PG6DTLBITS PG6DTLbits __attribute__((__sfr__));

#define PG6DTH PG6DTH
extern volatile uint16_t  PG6DTH __attribute__((__sfr__));
typedef struct tagPG6DTHBITS {
  uint16_t DTH:14;
} PG6DTHBITS;
extern volatile PG6DTHBITS PG6DTHbits __attribute__((__sfr__));

#define PG6CAP PG6CAP
extern volatile uint16_t  PG6CAP __attribute__((__sfr__));
#define PG7CONL PG7CONL
extern volatile uint16_t  PG7CONL __attribute__((__sfr__));
typedef struct tagPG7CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG7CONLBITS;
extern volatile PG7CONLBITS PG7CONLbits __attribute__((__sfr__));

#define PG7CONH PG7CONH
extern volatile uint16_t  PG7CONH __attribute__((__sfr__));
typedef struct tagPG7CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG7CONHBITS;
extern volatile PG7CONHBITS PG7CONHbits __attribute__((__sfr__));

#define PG7STAT PG7STAT
extern volatile uint16_t  PG7STAT __attribute__((__sfr__));
typedef struct tagPG7STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG7STATBITS;
extern volatile PG7STATBITS PG7STATbits __attribute__((__sfr__));

#define PG7IOCONL PG7IOCONL
extern volatile uint16_t  PG7IOCONL __attribute__((__sfr__));
typedef struct tagPG7IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG7IOCONLBITS;
extern volatile PG7IOCONLBITS PG7IOCONLbits __attribute__((__sfr__));

#define PG7IOCONH PG7IOCONH
extern volatile uint16_t  PG7IOCONH __attribute__((__sfr__));
typedef struct tagPG7IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG7IOCONHBITS;
extern volatile PG7IOCONHBITS PG7IOCONHbits __attribute__((__sfr__));

#define PG7EVTL PG7EVTL
extern volatile uint16_t  PG7EVTL __attribute__((__sfr__));
typedef struct tagPG7EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG7EVTLBITS;
extern volatile PG7EVTLBITS PG7EVTLbits __attribute__((__sfr__));

#define PG7EVTH PG7EVTH
extern volatile uint16_t  PG7EVTH __attribute__((__sfr__));
typedef struct tagPG7EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG7EVTHBITS;
extern volatile PG7EVTHBITS PG7EVTHbits __attribute__((__sfr__));

#define PG7FPCIL PG7FPCIL
extern volatile uint16_t  PG7FPCIL __attribute__((__sfr__));
typedef struct tagPG7FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG7FPCILBITS;
extern volatile PG7FPCILBITS PG7FPCILbits __attribute__((__sfr__));

#define PG7FPCIH PG7FPCIH
extern volatile uint16_t  PG7FPCIH __attribute__((__sfr__));
typedef struct tagPG7FPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG7FPCIHBITS;
extern volatile PG7FPCIHBITS PG7FPCIHbits __attribute__((__sfr__));

#define PG7CLPCIL PG7CLPCIL
extern volatile uint16_t  PG7CLPCIL __attribute__((__sfr__));
typedef struct tagPG7CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG7CLPCILBITS;
extern volatile PG7CLPCILBITS PG7CLPCILbits __attribute__((__sfr__));

#define PG7CLPCIH PG7CLPCIH
extern volatile uint16_t  PG7CLPCIH __attribute__((__sfr__));
typedef struct tagPG7CLPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG7CLPCIHBITS;
extern volatile PG7CLPCIHBITS PG7CLPCIHbits __attribute__((__sfr__));

