wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define PG7FFPCIL PG7FFPCIL
extern volatile uint16_t  PG7FFPCIL __attribute__((__sfr__));
typedef struct tagPG7FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG7FFPCILBITS;
extern volatile PG7FFPCILBITS PG7FFPCILbits __attribute__((__sfr__));

#define PG7FFPCIH PG7FFPCIH
extern volatile uint16_t  PG7FFPCIH __attribute__((__sfr__));
typedef struct tagPG7FFPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG7FFPCIHBITS;
extern volatile PG7FFPCIHBITS PG7FFPCIHbits __attribute__((__sfr__));

#define PG7SPCIL PG7SPCIL
extern volatile uint16_t  PG7SPCIL __attribute__((__sfr__));
typedef struct tagPG7SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG7SPCILBITS;
extern volatile PG7SPCILBITS PG7SPCILbits __attribute__((__sfr__));

#define PG7SPCIH PG7SPCIH
extern volatile uint16_t  PG7SPCIH __attribute__((__sfr__));
typedef struct tagPG7SPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG7SPCIHBITS;
extern volatile PG7SPCIHBITS PG7SPCIHbits __attribute__((__sfr__));

#define PG7LEBL PG7LEBL
extern volatile uint16_t  PG7LEBL __attribute__((__sfr__));
#define PG7LEBH PG7LEBH
extern volatile uint16_t  PG7LEBH __attribute__((__sfr__));
typedef struct tagPG7LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG7LEBHBITS;
extern volatile PG7LEBHBITS PG7LEBHbits __attribute__((__sfr__));

#define PG7PHASE PG7PHASE
extern volatile uint16_t  PG7PHASE __attribute__((__sfr__));
#define PG7DC PG7DC
extern volatile uint16_t  PG7DC __attribute__((__sfr__));
#define PG7DCA PG7DCA
extern volatile uint16_t  PG7DCA __attribute__((__sfr__));
typedef struct tagPG7DCABITS {
  uint16_t DCA:8;
} PG7DCABITS;
extern volatile PG7DCABITS PG7DCAbits __attribute__((__sfr__));

#define PG7PER PG7PER
extern volatile uint16_t  PG7PER __attribute__((__sfr__));
#define PG7TRIGA PG7TRIGA
extern volatile uint16_t  PG7TRIGA __attribute__((__sfr__));
#define PG7TRIGB PG7TRIGB
extern volatile uint16_t  PG7TRIGB __attribute__((__sfr__));
#define PG7TRIGC PG7TRIGC
extern volatile uint16_t  PG7TRIGC __attribute__((__sfr__));
#define PG7DTL PG7DTL
extern volatile uint16_t  PG7DTL __attribute__((__sfr__));
typedef struct tagPG7DTLBITS {
  uint16_t DTL:14;
} PG7DTLBITS;
extern volatile PG7DTLBITS PG7DTLbits __attribute__((__sfr__));

#define PG7DTH PG7DTH
extern volatile uint16_t  PG7DTH __attribute__((__sfr__));
typedef struct tagPG7DTHBITS {
  uint16_t DTH:14;
} PG7DTHBITS;
extern volatile PG7DTHBITS PG7DTHbits __attribute__((__sfr__));

#define PG7CAP PG7CAP
extern volatile uint16_t  PG7CAP __attribute__((__sfr__));
#define PG8CONL PG8CONL
extern volatile uint16_t  PG8CONL __attribute__((__sfr__));
typedef struct tagPG8CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG8CONLBITS;
extern volatile PG8CONLBITS PG8CONLbits __attribute__((__sfr__));

#define PG8CONH PG8CONH
extern volatile uint16_t  PG8CONH __attribute__((__sfr__));
typedef struct tagPG8CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG8CONHBITS;
extern volatile PG8CONHBITS PG8CONHbits __attribute__((__sfr__));

#define PG8STAT PG8STAT
extern volatile uint16_t  PG8STAT __attribute__((__sfr__));
typedef struct tagPG8STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG8STATBITS;
extern volatile PG8STATBITS PG8STATbits __attribute__((__sfr__));

#define PG8IOCONL PG8IOCONL
extern volatile uint16_t  PG8IOCONL __attribute__((__sfr__));
typedef struct tagPG8IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG8IOCONLBITS;
extern volatile PG8IOCONLBITS PG8IOCONLbits __attribute__((__sfr__));

#define PG8IOCONH PG8IOCONH
extern volatile uint16_t  PG8IOCONH __attribute__((__sfr__));
typedef struct tagPG8IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG8IOCONHBITS;
extern volatile PG8IOCONHBITS PG8IOCONHbits __attribute__((__sfr__));

#define PG8EVTL PG8EVTL
extern volatile uint16_t  PG8EVTL __attribute__((__sfr__));
typedef struct tagPG8EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG8EVTLBITS;
extern volatile PG8EVTLBITS PG8EVTLbits __attribute__((__sfr__));

#define PG8EVTH PG8EVTH
extern volatile uint16_t  PG8EVTH __attribute__((__sfr__));
typedef struct tagPG8EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG8EVTHBITS;
extern volatile PG8EVTHBITS PG8EVTHbits __attribute__((__sfr__));

#define PG8FPCIL PG8FPCIL
extern volatile uint16_t  PG8FPCIL __attribute__((__sfr__));
typedef struct tagPG8FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG8FPCILBITS;
extern volatile PG8FPCILBITS PG8FPCILbits __attribute__((__sfr__));

