wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define PG8FPCIH PG8FPCIH
extern volatile uint16_t  PG8FPCIH __attribute__((__sfr__));
typedef struct tagPG8FPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG8FPCIHBITS;
extern volatile PG8FPCIHBITS PG8FPCIHbits __attribute__((__sfr__));

#define PG8CLPCIL PG8CLPCIL
extern volatile uint16_t  PG8CLPCIL __attribute__((__sfr__));
typedef struct tagPG8CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG8CLPCILBITS;
extern volatile PG8CLPCILBITS PG8CLPCILbits __attribute__((__sfr__));

#define PG8CLPCIH PG8CLPCIH
extern volatile uint16_t  PG8CLPCIH __attribute__((__sfr__));
typedef struct tagPG8CLPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG8CLPCIHBITS;
extern volatile PG8CLPCIHBITS PG8CLPCIHbits __attribute__((__sfr__));

#define PG8FFPCIL PG8FFPCIL
extern volatile uint16_t  PG8FFPCIL __attribute__((__sfr__));
typedef struct tagPG8FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG8FFPCILBITS;
extern volatile PG8FFPCILBITS PG8FFPCILbits __attribute__((__sfr__));

#define PG8FFPCIH PG8FFPCIH
extern volatile uint16_t  PG8FFPCIH __attribute__((__sfr__));
typedef struct tagPG8FFPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG8FFPCIHBITS;
extern volatile PG8FFPCIHBITS PG8FFPCIHbits __attribute__((__sfr__));

#define PG8SPCIL PG8SPCIL
extern volatile uint16_t  PG8SPCIL __attribute__((__sfr__));
typedef struct tagPG8SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG8SPCILBITS;
extern volatile PG8SPCILBITS PG8SPCILbits __attribute__((__sfr__));

#define PG8SPCIH PG8SPCIH
extern volatile uint16_t  PG8SPCIH __attribute__((__sfr__));
typedef struct tagPG8SPCIHBITS {
  uint16_t TQSS:3;
  uint16_t TQPS:1;
  uint16_t PCIGT:1;
  uint16_t SWPCIM:2;
  uint16_t SWPCI:1;
  uint16_t ACP:3;
  uint16_t :1;
  uint16_t BPSEL:3;
  uint16_t BPEN:1;
} PG8SPCIHBITS;
extern volatile PG8SPCIHBITS PG8SPCIHbits __attribute__((__sfr__));

#define PG8LEBL PG8LEBL
extern volatile uint16_t  PG8LEBL __attribute__((__sfr__));
#define PG8LEBH PG8LEBH
extern volatile uint16_t  PG8LEBH __attribute__((__sfr__));
typedef struct tagPG8LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG8LEBHBITS;
extern volatile PG8LEBHBITS PG8LEBHbits __attribute__((__sfr__));

#define PG8PHASE PG8PHASE
extern volatile uint16_t  PG8PHASE __attribute__((__sfr__));
#define PG8DC PG8DC
extern volatile uint16_t  PG8DC __attribute__((__sfr__));
#define PG8DCA PG8DCA
extern volatile uint16_t  PG8DCA __attribute__((__sfr__));
typedef struct tagPG8DCABITS {
  uint16_t DCA:8;
} PG8DCABITS;
extern volatile PG8DCABITS PG8DCAbits __attribute__((__sfr__));

#define PG8PER PG8PER
extern volatile uint16_t  PG8PER __attribute__((__sfr__));
#define PG8TRIGA PG8TRIGA
extern volatile uint16_t  PG8TRIGA __attribute__((__sfr__));
#define PG8TRIGB PG8TRIGB
extern volatile uint16_t  PG8TRIGB __attribute__((__sfr__));
#define PG8TRIGC PG8TRIGC
extern volatile uint16_t  PG8TRIGC __attribute__((__sfr__));
#define PG8DTL PG8DTL
extern volatile uint16_t  PG8DTL __attribute__((__sfr__));
typedef struct tagPG8DTLBITS {
  uint16_t DTL:14;
} PG8DTLBITS;
extern volatile PG8DTLBITS PG8DTLbits __attribute__((__sfr__));

#define PG8DTH PG8DTH
extern volatile uint16_t  PG8DTH __attribute__((__sfr__));
typedef struct tagPG8DTHBITS {
  uint16_t DTH:14;
} PG8DTHBITS;
extern volatile PG8DTHBITS PG8DTHbits __attribute__((__sfr__));

#define PG8CAP PG8CAP
extern volatile uint16_t  PG8CAP __attribute__((__sfr__));
#define C1CONL C1CONL
extern volatile uint16_t  C1CONL __attribute__((__sfr__));
__extension__ typedef struct tagC1CONLBITS {
  union {
    struct {
      uint16_t DNCNT:5;
      uint16_t ISOCRCEN:1;
      uint16_t PXEDIS:1;
      uint16_t CLKSEL:1;
      uint16_t WAKFIL:1;
      uint16_t WFT:2;
      uint16_t BUSY:1;
      uint16_t BRSDIS:1;
      uint16_t SIDL:1;
      uint16_t :1;
      uint16_t CON:1;
    };
    struct {
      uint16_t DNCNT0:1;
      uint16_t DNCNT1:1;
      uint16_t DNCNT2:1;
      uint16_t DNCNT3:1;
      uint16_t DNCNT4:1;
      uint16_t :4;
      uint16_t WFT0:1;
      uint16_t WFT1:1;
    };
  };
} C1CONLBITS;
extern volatile C1CONLBITS C1CONLbits __attribute__((__sfr__));

#define C1CONH C1CONH
extern volatile uint16_t  C1CONH __attribute__((__sfr__));
__extension__ typedef struct tagC1CONHBITS {
  union {
    struct {
      uint16_t RTXAT:1;
      uint16_t ESIGM:1;
      uint16_t SERRLOM:1;
      uint16_t STEF:1;
      uint16_t TXQEN:1;
      uint16_t OPMOD:3;
      uint16_t REQOP:3;
      uint16_t ABAT:1;
      uint16_t TXBWS:4;
    };
    struct {
      uint16_t :5;
      uint16_t OPMOD0:1;
      uint16_t OPMOD1:1;
      uint16_t OPMOD2:1;
      uint16_t REQOP0:1;
      uint16_t REQOP1:1;
      uint16_t REQOP2:1;
      uint16_t :1;
      uint16_t TXBWS0:1;
      uint16_t TXBWS1:1;
      uint16_t TXBWS2:1;
      uint16_t TXBWS3:1;
    };
  };
} C1CONHBITS;
extern volatile C1CONHBITS C1CONHbits __attribute__((__sfr__));

#define C1NBTCFGL C1NBTCFGL
extern volatile uint16_t  C1NBTCFGL __attribute__((__sfr__));
__extension__ typedef struct tagC1NBTCFGLBITS {
  union {
    struct {
      uint16_t SJW:7;
      uint16_t :1;
      uint16_t TSEG2:7;
    };
    struct {
      uint16_t SJW0:1;
      uint16_t SJW1:1;
      uint16_t SJW2:1;
      uint16_t SJW3:1;
      uint16_t SJW4:1;
      uint16_t SJW5:1;
      uint16_t SJW6:1;
      uint16_t :1;
      uint16_t TSEG20:1;
      uint16_t TSEG21:1;
      uint16_t TSEG22:1;
      uint16_t TSEG23:1;
      uint16_t TSEG24:1;
      uint16_t TSEG25:1;
      uint16_t TSEG26:1;
    };
  };
} C1NBTCFGLBITS;
extern volatile C1NBTCFGLBITS C1NBTCFGLbits __attribute__((__sfr__));

#define C1NBTCFGH C1NBTCFGH
extern volatile uint16_t  C1NBTCFGH __attribute__((__sfr__));
__extension__ typedef struct tagC1NBTCFGHBITS {
  union {
    struct {
      uint16_t TSEG1:8;
      uint16_t BRP:8;
    };
    struct {
      uint16_t TSEG10:1;
      uint16_t TSEG11:1;
      uint16_t TSEG12:1;
      uint16_t TSEG13:1;
      uint16_t TSEG14:1;
      uint16_t TSEG15:1;
      uint16_t TSEG16:1;
      uint16_t TSEG17:1;
      uint16_t BRP0:1;
      uint16_t BRP1:1;
      uint16_t BRP2:1;
      uint16_t BRP3:1;
      uint16_t BRP4:1;
      uint16_t BRP5:1;
      uint16_t BRP6:1;
      uint16_t BRP7:1;
    };
  };
} C1NBTCFGHBITS;
