wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile C1NBTCFGHBITS C1NBTCFGHbits __attribute__((__sfr__));

#define C1DBTCFGL C1DBTCFGL
extern volatile uint16_t  C1DBTCFGL __attribute__((__sfr__));
__extension__ typedef struct tagC1DBTCFGLBITS {
  union {
    struct {
      uint16_t SJW:4;
      uint16_t :4;
      uint16_t TSEG2:4;
    };
    struct {
      uint16_t SJW0:1;
      uint16_t SJW1:1;
      uint16_t SJW2:1;
      uint16_t SJW3:1;
      uint16_t :4;
      uint16_t TSEG20:1;
      uint16_t TSEG21:1;
      uint16_t TSEG22:1;
      uint16_t TSEG23:1;
    };
  };
} C1DBTCFGLBITS;
extern volatile C1DBTCFGLBITS C1DBTCFGLbits __attribute__((__sfr__));

#define C1DBTCFGH C1DBTCFGH
extern volatile uint16_t  C1DBTCFGH __attribute__((__sfr__));
__extension__ typedef struct tagC1DBTCFGHBITS {
  union {
    struct {
      uint16_t TSEG1:5;
      uint16_t :3;
      uint16_t BRP:8;
    };
    struct {
      uint16_t TSEG10:1;
      uint16_t TSEG11:1;
      uint16_t TSEG12:1;
      uint16_t TSEG13:1;
      uint16_t TSEG14:1;
      uint16_t :3;
      uint16_t BRP0:1;
      uint16_t BRP1:1;
      uint16_t BRP2:1;
      uint16_t BRP3:1;
      uint16_t BRP4:1;
      uint16_t BRP5:1;
      uint16_t BRP6:1;
      uint16_t BRP7:1;
    };
  };
} C1DBTCFGHBITS;
extern volatile C1DBTCFGHBITS C1DBTCFGHbits __attribute__((__sfr__));

#define C1TDCL C1TDCL
extern volatile uint16_t  C1TDCL __attribute__((__sfr__));
__extension__ typedef struct tagC1TDCLBITS {
  union {
    struct {
      uint16_t TDCV:6;
      uint16_t :2;
      uint16_t TDCO:7;
    };
    struct {
      uint16_t TDCV0:1;
      uint16_t TDCV1:1;
      uint16_t TDCV2:1;
      uint16_t TDCV3:1;
      uint16_t TDCV4:1;
      uint16_t TDCV5:1;
      uint16_t :2;
      uint16_t TDCO0:1;
      uint16_t TDCO1:1;
      uint16_t TDCO2:1;
      uint16_t TDCO3:1;
      uint16_t TDCO4:1;
      uint16_t TDCO5:1;
      uint16_t TDCO6:1;
    };
  };
} C1TDCLBITS;
extern volatile C1TDCLBITS C1TDCLbits __attribute__((__sfr__));

#define C1TDCH C1TDCH
extern volatile uint16_t  C1TDCH __attribute__((__sfr__));
__extension__ typedef struct tagC1TDCHBITS {
  union {
    struct {
      uint16_t TDCMOD:2;
      uint16_t :6;
      uint16_t SID11EN:1;
      uint16_t EDGFLTEN:1;
    };
    struct {
      uint16_t TDCMOD0:1;
      uint16_t TDCMOD1:1;
    };
  };
} C1TDCHBITS;
extern volatile C1TDCHBITS C1TDCHbits __attribute__((__sfr__));

#define C1TBCL C1TBCL
extern volatile uint16_t  C1TBCL __attribute__((__sfr__));
typedef struct tagC1TBCLBITS {
  uint16_t TBC0:1;
  uint16_t TBC1:1;
  uint16_t TBC2:1;
  uint16_t TBC3:1;
  uint16_t TBC4:1;
  uint16_t TBC5:1;
  uint16_t TBC6:1;
  uint16_t TBC7:1;
  uint16_t TBC8:1;
  uint16_t TBC9:1;
  uint16_t TBC10:1;
  uint16_t TBC11:1;
  uint16_t TBC12:1;
  uint16_t TBC13:1;
  uint16_t TBC14:1;
  uint16_t TBC15:1;
} C1TBCLBITS;
extern volatile C1TBCLBITS C1TBCLbits __attribute__((__sfr__));

#define C1TBCH C1TBCH
extern volatile uint16_t  C1TBCH __attribute__((__sfr__));
typedef struct tagC1TBCHBITS {
  uint16_t TBC16:1;
  uint16_t TBC17:1;
  uint16_t TBC18:1;
  uint16_t TBC19:1;
  uint16_t TBC20:1;
  uint16_t TBC21:1;
  uint16_t TBC22:1;
  uint16_t TBC23:1;
  uint16_t TBC24:1;
  uint16_t TBC25:1;
  uint16_t TBC26:1;
  uint16_t TBC27:1;
  uint16_t TBC28:1;
  uint16_t TBC29:1;
  uint16_t TBC30:1;
  uint16_t TBC31:1;
} C1TBCHBITS;
extern volatile C1TBCHBITS C1TBCHbits __attribute__((__sfr__));

#define C1TSCONL C1TSCONL
extern volatile uint16_t  C1TSCONL __attribute__((__sfr__));
__extension__ typedef struct tagC1TSCONLBITS {
  union {
    struct {
      uint16_t TBCPRE:10;
    };
    struct {
      uint16_t TBCPRE0:1;
      uint16_t TBCPRE1:1;
      uint16_t TBCPRE2:1;
      uint16_t TBCPRE3:1;
      uint16_t TBCPRE4:1;
      uint16_t TBCPRE5:1;
      uint16_t TBCPRE6:1;
      uint16_t TBCPRE7:1;
      uint16_t TBCPRE8:1;
      uint16_t TBCPRE9:1;
    };
  };
} C1TSCONLBITS;
extern volatile C1TSCONLBITS C1TSCONLbits __attribute__((__sfr__));

#define C1TSCONH C1TSCONH
extern volatile uint16_t  C1TSCONH __attribute__((__sfr__));
typedef struct tagC1TSCONHBITS {
  uint16_t TBCEN:1;
  uint16_t TSEOF:1;
  uint16_t TSRES:1;
} C1TSCONHBITS;
extern volatile C1TSCONHBITS C1TSCONHbits __attribute__((__sfr__));

#define C1VECL C1VECL
extern volatile uint16_t  C1VECL __attribute__((__sfr__));
__extension__ typedef struct tagC1VECLBITS {
  union {
    struct {
      uint16_t ICODE:7;
      uint16_t :1;
      uint16_t FILHIT:5;
    };
    struct {
      uint16_t ICODE0:1;
      uint16_t ICODE1:1;
      uint16_t ICODE2:1;
      uint16_t ICODE3:1;
      uint16_t ICODE4:1;
      uint16_t ICODE5:1;
      uint16_t ICODE6:1;
      uint16_t :1;
      uint16_t FILHIT0:1;
      uint16_t FILHIT1:1;
      uint16_t FILHIT2:1;
      uint16_t FILHIT3:1;
      uint16_t FILHIT4:1;
    };
  };
} C1VECLBITS;
extern volatile C1VECLBITS C1VECLbits __attribute__((__sfr__));

#define C1VECH C1VECH
extern volatile uint16_t  C1VECH __attribute__((__sfr__));
__extension__ typedef struct tagC1VECHBITS {
  union {
    struct {
      uint16_t TXCODE:7;
      uint16_t :1;
      uint16_t RXCODE:7;
    };
    struct {
      uint16_t TXCODE0:1;
      uint16_t TXCODE1:1;
      uint16_t TXCODE2:1;
      uint16_t TXCODE3:1;
      uint16_t TXCODE4:1;
      uint16_t TXCODE5:1;
      uint16_t TXCODE6:1;
      uint16_t :1;
      uint16_t RXCODE0:1;
      uint16_t RXCODE1:1;
      uint16_t RXCODE2:1;
      uint16_t RXCODE3:1;
      uint16_t RXCODE4:1;
      uint16_t RXCODE5:1;
      uint16_t RXCODE6:1;
    };
  };
} C1VECHBITS;
extern volatile C1VECHBITS C1VECHbits __attribute__((__sfr__));

#define C1INTL C1INTL
extern volatile uint16_t  C1INTL __attribute__((__sfr__));
typedef struct tagC1INTLBITS {
  uint16_t TXIF:1;
  uint16_t RXIF:1;
  uint16_t TBCIF:1;
  uint16_t MODIF:1;
  uint16_t TEFIF:1;
  uint16_t :5;
  uint16_t TXATIF:1;
  uint16_t RXOVIF:1;
  uint16_t SERRIF:1;
  uint16_t CERRIF:1;
  uint16_t WAKIF:1;
  uint16_t IVMIF:1;
} C1INTLBITS;
extern volatile C1INTLBITS C1INTLbits __attribute__((__sfr__));

#define C1INTH C1INTH
extern volatile uint16_t  C1INTH __attribute__((__sfr__));
typedef struct tagC1INTHBITS {
  uint16_t TXIE:1;
  uint16_t RXIE:1;
  uint16_t TBCIE:1;
  uint16_t MODIE:1;
  uint16_t TEFIE:1;
  uint16_t :5;
  uint16_t TXATIE:1;
  uint16_t RXOVIE:1;
  uint16_t SERRIE:1;
  uint16_t CERRIE:1;
  uint16_t WAKIE:1;
  uint16_t IVMIE:1;
} C1INTHBITS;
extern volatile C1INTHBITS C1INTHbits __attribute__((__sfr__));

#define C1RXIFL C1RXIFL
extern volatile uint16_t  C1RXIFL __attribute__((__sfr__));
typedef struct tagC1RXIFLBITS {
  uint16_t :1;
  uint16_t RFIF1:1;
  uint16_t RFIF2:1;
  uint16_t RFIF3:1;
  uint16_t RFIF4:1;
  uint16_t RFIF5:1;
  uint16_t RFIF6:1;
  uint16_t RFIF7:1;
  uint16_t RFIF8:1;
  uint16_t RFIF9:1;
  uint16_t RFIF10:1;
  uint16_t RFIF11:1;
  uint16_t RFIF12:1;
  uint16_t RFIF13:1;
  uint16_t RFIF14:1;
  uint16_t RFIF15:1;
} C1RXIFLBITS;
extern volatile C1RXIFLBITS C1RXIFLbits __attribute__((__sfr__));

