wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile C1BDIAG0LBITS C1BDIAG0Lbits __attribute__((__sfr__));

#define C1BDIAG0H C1BDIAG0H
extern volatile uint16_t  C1BDIAG0H __attribute__((__sfr__));
__extension__ typedef struct tagC1BDIAG0HBITS {
  union {
    struct {
      uint16_t DRERRCNT:8;
      uint16_t DTERRCNT:8;
    };
    struct {
      uint16_t DRERRCNT0:1;
      uint16_t DRERRCNT1:1;
      uint16_t DRERRCNT2:1;
      uint16_t DRERRCNT3:1;
      uint16_t DRERRCNT4:1;
      uint16_t DRERRCNT5:1;
      uint16_t DRERRCNT6:1;
      uint16_t DRERRCNT7:1;
      uint16_t DTERRCNT0:1;
      uint16_t DTERRCNT1:1;
      uint16_t DTERRCNT2:1;
      uint16_t DTERRCNT3:1;
      uint16_t DTERRCNT4:1;
      uint16_t DTERRCNT5:1;
      uint16_t DTERRCNT6:1;
      uint16_t DTERRCNT7:1;
    };
  };
} C1BDIAG0HBITS;
extern volatile C1BDIAG0HBITS C1BDIAG0Hbits __attribute__((__sfr__));

#define C1BDIAG1L C1BDIAG1L
extern volatile uint16_t  C1BDIAG1L __attribute__((__sfr__));
__extension__ typedef struct tagC1BDIAG1LBITS {
  union {
    struct {
      uint16_t EFMSGCNT:16;
    };
    struct {
      uint16_t EFMSGCNT0:1;
      uint16_t EFMSGCNT1:1;
      uint16_t EFMSGCNT2:1;
      uint16_t EFMSGCNT3:1;
      uint16_t EFMSGCNT4:1;
      uint16_t EFMSGCNT5:1;
      uint16_t EFMSGCNT6:1;
      uint16_t EFMSGCNT7:1;
      uint16_t EFMSGCNT8:1;
      uint16_t EFMSGCNT9:1;
      uint16_t EFMSGCNT10:1;
      uint16_t EFMSGCNT11:1;
      uint16_t EFMSGCNT12:1;
      uint16_t EFMSGCNT13:1;
      uint16_t EFMSGCNT14:1;
      uint16_t EFMSGCNT15:1;
    };
  };
} C1BDIAG1LBITS;
extern volatile C1BDIAG1LBITS C1BDIAG1Lbits __attribute__((__sfr__));

#define C1BDIAG1H C1BDIAG1H
extern volatile uint16_t  C1BDIAG1H __attribute__((__sfr__));
typedef struct tagC1BDIAG1HBITS {
  uint16_t NBIT0ERR:1;
  uint16_t NBIT1ERR:1;
  uint16_t NACKERR:1;
  uint16_t NFORMERR:1;
  uint16_t NSTUFERR:1;
  uint16_t NCRCERR:1;
  uint16_t :1;
  uint16_t TXBOERR:1;
  uint16_t DBIT0ERR:1;
  uint16_t DBIT1ERR:1;
  uint16_t :1;
  uint16_t DFORMERR:1;
  uint16_t DSTUFERR:1;
  uint16_t DCRCERR:1;
  uint16_t ESI:1;
  uint16_t DLCMM:1;
} C1BDIAG1HBITS;
extern volatile C1BDIAG1HBITS C1BDIAG1Hbits __attribute__((__sfr__));

#define C1TEFCONL C1TEFCONL
extern volatile uint16_t  C1TEFCONL __attribute__((__sfr__));
typedef struct tagC1TEFCONLBITS {
  uint16_t TEFNEIE:1;
  uint16_t TEFHIE:1;
  uint16_t TEFFIE:1;
  uint16_t TEFOVIE:1;
  uint16_t :1;
  uint16_t TEFTSEN:1;
  uint16_t :2;
  uint16_t UINC:1;
  uint16_t :1;
  uint16_t FRESET:1;
} C1TEFCONLBITS;
extern volatile C1TEFCONLBITS C1TEFCONLbits __attribute__((__sfr__));

#define C1TEFCONH C1TEFCONH
extern volatile uint16_t  C1TEFCONH __attribute__((__sfr__));
__extension__ typedef struct tagC1TEFCONHBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t FSIZE:5;
    };
    struct {
      uint16_t :8;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
    };
  };
} C1TEFCONHBITS;
extern volatile C1TEFCONHBITS C1TEFCONHbits __attribute__((__sfr__));

#define C1TEFSTA C1TEFSTA
extern volatile uint16_t  C1TEFSTA __attribute__((__sfr__));
typedef struct tagC1TEFSTABITS {
  uint16_t TEFNEIF:1;
  uint16_t TEFHIF:1;
  uint16_t TEFFIF:1;
  uint16_t TEFOVIF:1;
} C1TEFSTABITS;
extern volatile C1TEFSTABITS C1TEFSTAbits __attribute__((__sfr__));

#define C1TEFUAL C1TEFUAL
extern volatile uint16_t  C1TEFUAL __attribute__((__sfr__));
typedef struct tagC1TEFUALBITS {
  uint16_t TEFUA0:1;
  uint16_t TEFUA1:1;
  uint16_t TEFUA2:1;
  uint16_t TEFUA3:1;
  uint16_t TEFUA4:1;
  uint16_t TEFUA5:1;
  uint16_t TEFUA6:1;
  uint16_t TEFUA7:1;
  uint16_t TEFUA8:1;
  uint16_t TEFUA9:1;
  uint16_t TEFUA10:1;
  uint16_t TEFUA11:1;
  uint16_t TEFUA12:1;
  uint16_t TEFUA13:1;
  uint16_t TEFUA14:1;
  uint16_t TEFUA15:1;
} C1TEFUALBITS;
extern volatile C1TEFUALBITS C1TEFUALbits __attribute__((__sfr__));

#define C1TEFUAH C1TEFUAH
extern volatile uint16_t  C1TEFUAH __attribute__((__sfr__));
typedef struct tagC1TEFUAHBITS {
  uint16_t TEFUA16:1;
  uint16_t TEFUA17:1;
  uint16_t TEFUA18:1;
  uint16_t TEFUA19:1;
  uint16_t TEFUA20:1;
  uint16_t TEFUA21:1;
  uint16_t TEFUA22:1;
  uint16_t TEFUA23:1;
  uint16_t TEFUA24:1;
  uint16_t TEFUA25:1;
  uint16_t TEFUA26:1;
  uint16_t TEFUA27:1;
  uint16_t TEFUA28:1;
  uint16_t TEFUA29:1;
  uint16_t TEFUA30:1;
  uint16_t TEFUA31:1;
} C1TEFUAHBITS;
extern volatile C1TEFUAHBITS C1TEFUAHbits __attribute__((__sfr__));

#define C1FIFOBAL C1FIFOBAL
extern volatile uint16_t  C1FIFOBAL __attribute__((__sfr__));
typedef struct tagC1FIFOBALBITS {
  uint16_t FIFOBA0:1;
  uint16_t FIFOBA1:1;
  uint16_t FIFOBA2:1;
  uint16_t FIFOBA3:1;
  uint16_t FIFOBA4:1;
  uint16_t FIFOBA5:1;
  uint16_t FIFOBA6:1;
  uint16_t FIFOBA7:1;
  uint16_t FIFOBA8:1;
  uint16_t FIFOBA9:1;
  uint16_t FIFOBA10:1;
  uint16_t FIFOBA11:1;
  uint16_t FIFOBA12:1;
  uint16_t FIFOBA13:1;
  uint16_t FIFOBA14:1;
  uint16_t FIFOBA15:1;
} C1FIFOBALBITS;
extern volatile C1FIFOBALBITS C1FIFOBALbits __attribute__((__sfr__));

#define C1FIFOBAH C1FIFOBAH
extern volatile uint16_t  C1FIFOBAH __attribute__((__sfr__));
typedef struct tagC1FIFOBAHBITS {
  uint16_t FIFOBA16:1;
  uint16_t FIFOBA17:1;
  uint16_t FIFOBA18:1;
  uint16_t FIFOBA19:1;
  uint16_t FIFOBA20:1;
  uint16_t FIFOBA21:1;
  uint16_t FIFOBA22:1;
  uint16_t FIFOBA23:1;
  uint16_t FIFOBA24:1;
  uint16_t FIFOBA25:1;
  uint16_t FIFOBA26:1;
  uint16_t FIFOBA27:1;
  uint16_t FIFOBA28:1;
  uint16_t FIFOBA29:1;
  uint16_t FIFOBA30:1;
  uint16_t FIFOBA31:1;
} C1FIFOBAHBITS;
extern volatile C1FIFOBAHBITS C1FIFOBAHbits __attribute__((__sfr__));

#define C1TXQCONL C1TXQCONL
extern volatile uint16_t  C1TXQCONL __attribute__((__sfr__));
typedef struct tagC1TXQCONLBITS {
  uint16_t TXQNIE:1;
  uint16_t :1;
  uint16_t TXQEIE:1;
  uint16_t :1;
  uint16_t TXATIE:1;
  uint16_t :2;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1TXQCONLBITS;
extern volatile C1TXQCONLBITS C1TXQCONLbits __attribute__((__sfr__));

#define C1TXQCONH C1TXQCONH
extern volatile uint16_t  C1TXQCONH __attribute__((__sfr__));
__extension__ typedef struct tagC1TXQCONHBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1TXQCONHBITS;
