wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define C1FIFOSTA2 C1FIFOSTA2
extern volatile uint16_t  C1FIFOSTA2 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA2BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA2BITS;
extern volatile C1FIFOSTA2BITS C1FIFOSTA2bits __attribute__((__sfr__));

#define C1FIFOUA2L C1FIFOUA2L
extern volatile uint16_t  C1FIFOUA2L __attribute__((__sfr__));
typedef struct tagC1FIFOUA2LBITS {
  uint16_t FIFOUA0:1;
  uint16_t FIFOUA1:1;
  uint16_t FIFOUA2:1;
  uint16_t FIFOUA3:1;
  uint16_t FIFOUA4:1;
  uint16_t FIFOUA5:1;
  uint16_t FIFOUA6:1;
  uint16_t FIFOUA7:1;
  uint16_t FIFOUA8:1;
  uint16_t FIFOUA9:1;
  uint16_t FIFOUA10:1;
  uint16_t FIFOUA11:1;
  uint16_t FIFOUA12:1;
  uint16_t FIFOUA13:1;
  uint16_t FIFOUA14:1;
  uint16_t FIFOUA15:1;
} C1FIFOUA2LBITS;
extern volatile C1FIFOUA2LBITS C1FIFOUA2Lbits __attribute__((__sfr__));

#define C1FIFOUA2H C1FIFOUA2H
extern volatile uint16_t  C1FIFOUA2H __attribute__((__sfr__));
typedef struct tagC1FIFOUA2HBITS {
  uint16_t FIFOUA16:1;
  uint16_t FIFOUA17:1;
  uint16_t FIFOUA18:1;
  uint16_t FIFOUA19:1;
  uint16_t FIFOUA20:1;
  uint16_t FIFOUA21:1;
  uint16_t FIFOUA22:1;
  uint16_t FIFOUA23:1;
  uint16_t FIFOUA24:1;
  uint16_t FIFOUA25:1;
  uint16_t FIFOUA26:1;
  uint16_t FIFOUA27:1;
  uint16_t FIFOUA28:1;
  uint16_t FIFOUA29:1;
  uint16_t FIFOUA30:1;
  uint16_t FIFOUA31:1;
} C1FIFOUA2HBITS;
extern volatile C1FIFOUA2HBITS C1FIFOUA2Hbits __attribute__((__sfr__));

#define C1FIFOCON3L C1FIFOCON3L
extern volatile uint16_t  C1FIFOCON3L __attribute__((__sfr__));
typedef struct tagC1FIFOCON3LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON3LBITS;
extern volatile C1FIFOCON3LBITS C1FIFOCON3Lbits __attribute__((__sfr__));

#define C1FIFOCON3H C1FIFOCON3H
extern volatile uint16_t  C1FIFOCON3H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON3HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON3HBITS;
extern volatile C1FIFOCON3HBITS C1FIFOCON3Hbits __attribute__((__sfr__));

#define C1FIFOSTA3 C1FIFOSTA3
extern volatile uint16_t  C1FIFOSTA3 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA3BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA3BITS;
extern volatile C1FIFOSTA3BITS C1FIFOSTA3bits __attribute__((__sfr__));

#define C1FIFOUA3L C1FIFOUA3L
extern volatile uint16_t  C1FIFOUA3L __attribute__((__sfr__));
typedef struct tagC1FIFOUA3LBITS {
  uint16_t FIFOUA0:1;
  uint16_t FIFOUA1:1;
  uint16_t FIFOUA2:1;
  uint16_t FIFOUA3:1;
  uint16_t FIFOUA4:1;
  uint16_t FIFOUA5:1;
  uint16_t FIFOUA6:1;
  uint16_t FIFOUA7:1;
  uint16_t FIFOUA8:1;
  uint16_t FIFOUA9:1;
  uint16_t FIFOUA10:1;
  uint16_t FIFOUA11:1;
  uint16_t FIFOUA12:1;
  uint16_t FIFOUA13:1;
  uint16_t FIFOUA14:1;
  uint16_t FIFOUA15:1;
} C1FIFOUA3LBITS;
extern volatile C1FIFOUA3LBITS C1FIFOUA3Lbits __attribute__((__sfr__));

#define C1FIFOUA3H C1FIFOUA3H
extern volatile uint16_t  C1FIFOUA3H __attribute__((__sfr__));
typedef struct tagC1FIFOUA3HBITS {
  uint16_t FIFOUA16:1;
  uint16_t FIFOUA17:1;
  uint16_t FIFOUA18:1;
  uint16_t FIFOUA19:1;
  uint16_t FIFOUA20:1;
  uint16_t FIFOUA21:1;
  uint16_t FIFOUA22:1;
  uint16_t FIFOUA23:1;
  uint16_t FIFOUA24:1;
  uint16_t FIFOUA25:1;
  uint16_t FIFOUA26:1;
  uint16_t FIFOUA27:1;
  uint16_t FIFOUA28:1;
  uint16_t FIFOUA29:1;
  uint16_t FIFOUA30:1;
  uint16_t FIFOUA31:1;
} C1FIFOUA3HBITS;
extern volatile C1FIFOUA3HBITS C1FIFOUA3Hbits __attribute__((__sfr__));

#define C1FIFOCON4L C1FIFOCON4L
extern volatile uint16_t  C1FIFOCON4L __attribute__((__sfr__));
typedef struct tagC1FIFOCON4LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON4LBITS;
extern volatile C1FIFOCON4LBITS C1FIFOCON4Lbits __attribute__((__sfr__));

#define C1FIFOCON4H C1FIFOCON4H
extern volatile uint16_t  C1FIFOCON4H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON4HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON4HBITS;
