wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile C1FIFOCON4HBITS C1FIFOCON4Hbits __attribute__((__sfr__));

#define C1FIFOSTA4 C1FIFOSTA4
extern volatile uint16_t  C1FIFOSTA4 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA4BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA4BITS;
extern volatile C1FIFOSTA4BITS C1FIFOSTA4bits __attribute__((__sfr__));

#define C1FIFOUA4L C1FIFOUA4L
extern volatile uint16_t  C1FIFOUA4L __attribute__((__sfr__));
typedef struct tagC1FIFOUA4LBITS {
  uint16_t FIFOUA0:1;
  uint16_t FIFOUA1:1;
  uint16_t FIFOUA2:1;
  uint16_t FIFOUA3:1;
  uint16_t FIFOUA4:1;
  uint16_t FIFOUA5:1;
  uint16_t FIFOUA6:1;
  uint16_t FIFOUA7:1;
  uint16_t FIFOUA8:1;
  uint16_t FIFOUA9:1;
  uint16_t FIFOUA10:1;
  uint16_t FIFOUA11:1;
  uint16_t FIFOUA12:1;
  uint16_t FIFOUA13:1;
  uint16_t FIFOUA14:1;
  uint16_t FIFOUA15:1;
} C1FIFOUA4LBITS;
extern volatile C1FIFOUA4LBITS C1FIFOUA4Lbits __attribute__((__sfr__));

#define C1FIFOUA4H C1FIFOUA4H
extern volatile uint16_t  C1FIFOUA4H __attribute__((__sfr__));
typedef struct tagC1FIFOUA4HBITS {
  uint16_t FIFOUA16:1;
  uint16_t FIFOUA17:1;
  uint16_t FIFOUA18:1;
  uint16_t FIFOUA19:1;
  uint16_t FIFOUA20:1;
  uint16_t FIFOUA21:1;
  uint16_t FIFOUA22:1;
  uint16_t FIFOUA23:1;
  uint16_t FIFOUA24:1;
  uint16_t FIFOUA25:1;
  uint16_t FIFOUA26:1;
  uint16_t FIFOUA27:1;
  uint16_t FIFOUA28:1;
  uint16_t FIFOUA29:1;
  uint16_t FIFOUA30:1;
  uint16_t FIFOUA31:1;
} C1FIFOUA4HBITS;
extern volatile C1FIFOUA4HBITS C1FIFOUA4Hbits __attribute__((__sfr__));

#define C1FIFOCON5L C1FIFOCON5L
extern volatile uint16_t  C1FIFOCON5L __attribute__((__sfr__));
typedef struct tagC1FIFOCON5LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON5LBITS;
extern volatile C1FIFOCON5LBITS C1FIFOCON5Lbits __attribute__((__sfr__));

#define C1FIFOCON5H C1FIFOCON5H
extern volatile uint16_t  C1FIFOCON5H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON5HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON5HBITS;
extern volatile C1FIFOCON5HBITS C1FIFOCON5Hbits __attribute__((__sfr__));

#define C1FIFOSTA5 C1FIFOSTA5
extern volatile uint16_t  C1FIFOSTA5 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA5BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA5BITS;
extern volatile C1FIFOSTA5BITS C1FIFOSTA5bits __attribute__((__sfr__));

#define C1FIFOUA5L C1FIFOUA5L
extern volatile uint16_t  C1FIFOUA5L __attribute__((__sfr__));
typedef struct tagC1FIFOUA5LBITS {
  uint16_t FIFOUA0:1;
  uint16_t FIFOUA1:1;
  uint16_t FIFOUA2:1;
  uint16_t FIFOUA3:1;
  uint16_t FIFOUA4:1;
  uint16_t FIFOUA5:1;
  uint16_t FIFOUA6:1;
  uint16_t FIFOUA7:1;
  uint16_t FIFOUA8:1;
  uint16_t FIFOUA9:1;
  uint16_t FIFOUA10:1;
  uint16_t FIFOUA11:1;
  uint16_t FIFOUA12:1;
  uint16_t FIFOUA13:1;
  uint16_t FIFOUA14:1;
  uint16_t FIFOUA15:1;
} C1FIFOUA5LBITS;
extern volatile C1FIFOUA5LBITS C1FIFOUA5Lbits __attribute__((__sfr__));

#define C1FIFOUA5H C1FIFOUA5H
extern volatile uint16_t  C1FIFOUA5H __attribute__((__sfr__));
typedef struct tagC1FIFOUA5HBITS {
  uint16_t FIFOUA16:1;
  uint16_t FIFOUA17:1;
  uint16_t FIFOUA18:1;
  uint16_t FIFOUA19:1;
  uint16_t FIFOUA20:1;
  uint16_t FIFOUA21:1;
  uint16_t FIFOUA22:1;
  uint16_t FIFOUA23:1;
  uint16_t FIFOUA24:1;
  uint16_t FIFOUA25:1;
  uint16_t FIFOUA26:1;
  uint16_t FIFOUA27:1;
  uint16_t FIFOUA28:1;
  uint16_t FIFOUA29:1;
  uint16_t FIFOUA30:1;
  uint16_t FIFOUA31:1;
} C1FIFOUA5HBITS;
extern volatile C1FIFOUA5HBITS C1FIFOUA5Hbits __attribute__((__sfr__));

#define C1FIFOCON6L C1FIFOCON6L
extern volatile uint16_t  C1FIFOCON6L __attribute__((__sfr__));
typedef struct tagC1FIFOCON6LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON6LBITS;
extern volatile C1FIFOCON6LBITS C1FIFOCON6Lbits __attribute__((__sfr__));

#define C1FIFOCON6H C1FIFOCON6H
extern volatile uint16_t  C1FIFOCON6H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON6HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON6HBITS;
extern volatile C1FIFOCON6HBITS C1FIFOCON6Hbits __attribute__((__sfr__));

#define C1FIFOSTA6 C1FIFOSTA6
extern volatile uint16_t  C1FIFOSTA6 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA6BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA6BITS;
