wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define C1FLTCON3L C1FLTCON3L
extern volatile uint16_t  C1FLTCON3L __attribute__((__sfr__));
typedef struct tagC1FLTCON3LBITS {
  uint16_t F12BP:5;
  uint16_t :2;
  uint16_t FLTEN12:1;
  uint16_t F13BP:5;
  uint16_t :2;
  uint16_t FLTEN13:1;
} C1FLTCON3LBITS;
extern volatile C1FLTCON3LBITS C1FLTCON3Lbits __attribute__((__sfr__));

#define C1FLTCON3H C1FLTCON3H
extern volatile uint16_t  C1FLTCON3H __attribute__((__sfr__));
typedef struct tagC1FLTCON3HBITS {
  uint16_t F14BP:5;
  uint16_t :2;
  uint16_t FLTEN14:1;
  uint16_t F15BP:5;
  uint16_t :2;
  uint16_t FLTEN15:1;
} C1FLTCON3HBITS;
extern volatile C1FLTCON3HBITS C1FLTCON3Hbits __attribute__((__sfr__));

#define C1FLTOBJ0L C1FLTOBJ0L
extern volatile uint16_t  C1FLTOBJ0L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ0LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ0LBITS;
extern volatile C1FLTOBJ0LBITS C1FLTOBJ0Lbits __attribute__((__sfr__));

#define C1FLTOBJ0H C1FLTOBJ0H
extern volatile uint16_t  C1FLTOBJ0H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ0HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ0HBITS;
extern volatile C1FLTOBJ0HBITS C1FLTOBJ0Hbits __attribute__((__sfr__));

#define C1MASK0L C1MASK0L
extern volatile uint16_t  C1MASK0L __attribute__((__sfr__));
typedef struct tagC1MASK0LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK0LBITS;
extern volatile C1MASK0LBITS C1MASK0Lbits __attribute__((__sfr__));

#define C1MASK0H C1MASK0H
extern volatile uint16_t  C1MASK0H __attribute__((__sfr__));
typedef struct tagC1MASK0HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK0HBITS;
extern volatile C1MASK0HBITS C1MASK0Hbits __attribute__((__sfr__));

#define C1FLTOBJ1L C1FLTOBJ1L
extern volatile uint16_t  C1FLTOBJ1L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ1LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ1LBITS;
extern volatile C1FLTOBJ1LBITS C1FLTOBJ1Lbits __attribute__((__sfr__));

#define C1FLTOBJ1H C1FLTOBJ1H
extern volatile uint16_t  C1FLTOBJ1H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ1HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ1HBITS;
extern volatile C1FLTOBJ1HBITS C1FLTOBJ1Hbits __attribute__((__sfr__));

#define C1MASK1L C1MASK1L
extern volatile uint16_t  C1MASK1L __attribute__((__sfr__));
typedef struct tagC1MASK1LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK1LBITS;
extern volatile C1MASK1LBITS C1MASK1Lbits __attribute__((__sfr__));

#define C1MASK1H C1MASK1H
extern volatile uint16_t  C1MASK1H __attribute__((__sfr__));
typedef struct tagC1MASK1HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK1HBITS;
extern volatile C1MASK1HBITS C1MASK1Hbits __attribute__((__sfr__));

#define C1FLTOBJ2L C1FLTOBJ2L
extern volatile uint16_t  C1FLTOBJ2L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ2LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ2LBITS;
extern volatile C1FLTOBJ2LBITS C1FLTOBJ2Lbits __attribute__((__sfr__));

#define C1FLTOBJ2H C1FLTOBJ2H
extern volatile uint16_t  C1FLTOBJ2H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ2HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ2HBITS;
extern volatile C1FLTOBJ2HBITS C1FLTOBJ2Hbits __attribute__((__sfr__));

#define C1MASK2L C1MASK2L
extern volatile uint16_t  C1MASK2L __attribute__((__sfr__));
typedef struct tagC1MASK2LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK2LBITS;
extern volatile C1MASK2LBITS C1MASK2Lbits __attribute__((__sfr__));

