wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define C1MASK2H C1MASK2H
extern volatile uint16_t  C1MASK2H __attribute__((__sfr__));
typedef struct tagC1MASK2HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK2HBITS;
extern volatile C1MASK2HBITS C1MASK2Hbits __attribute__((__sfr__));

#define C1FLTOBJ3L C1FLTOBJ3L
extern volatile uint16_t  C1FLTOBJ3L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ3LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ3LBITS;
extern volatile C1FLTOBJ3LBITS C1FLTOBJ3Lbits __attribute__((__sfr__));

#define C1FLTOBJ3H C1FLTOBJ3H
extern volatile uint16_t  C1FLTOBJ3H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ3HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ3HBITS;
extern volatile C1FLTOBJ3HBITS C1FLTOBJ3Hbits __attribute__((__sfr__));

#define C1MASK3L C1MASK3L
extern volatile uint16_t  C1MASK3L __attribute__((__sfr__));
typedef struct tagC1MASK3LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK3LBITS;
extern volatile C1MASK3LBITS C1MASK3Lbits __attribute__((__sfr__));

#define C1MASK3H C1MASK3H
extern volatile uint16_t  C1MASK3H __attribute__((__sfr__));
typedef struct tagC1MASK3HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK3HBITS;
extern volatile C1MASK3HBITS C1MASK3Hbits __attribute__((__sfr__));

#define C1FLTOBJ4L C1FLTOBJ4L
extern volatile uint16_t  C1FLTOBJ4L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ4LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ4LBITS;
extern volatile C1FLTOBJ4LBITS C1FLTOBJ4Lbits __attribute__((__sfr__));

#define C1FLTOBJ4H C1FLTOBJ4H
extern volatile uint16_t  C1FLTOBJ4H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ4HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ4HBITS;
extern volatile C1FLTOBJ4HBITS C1FLTOBJ4Hbits __attribute__((__sfr__));

#define C1MASK4L C1MASK4L
extern volatile uint16_t  C1MASK4L __attribute__((__sfr__));
typedef struct tagC1MASK4LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK4LBITS;
extern volatile C1MASK4LBITS C1MASK4Lbits __attribute__((__sfr__));

#define C1MASK4H C1MASK4H
extern volatile uint16_t  C1MASK4H __attribute__((__sfr__));
typedef struct tagC1MASK4HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK4HBITS;
extern volatile C1MASK4HBITS C1MASK4Hbits __attribute__((__sfr__));

#define C1FLTOBJ5L C1FLTOBJ5L
extern volatile uint16_t  C1FLTOBJ5L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ5LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ5LBITS;
extern volatile C1FLTOBJ5LBITS C1FLTOBJ5Lbits __attribute__((__sfr__));

#define C1FLTOBJ5H C1FLTOBJ5H
extern volatile uint16_t  C1FLTOBJ5H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ5HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ5HBITS;
extern volatile C1FLTOBJ5HBITS C1FLTOBJ5Hbits __attribute__((__sfr__));

#define C1MASK5L C1MASK5L
extern volatile uint16_t  C1MASK5L __attribute__((__sfr__));
typedef struct tagC1MASK5LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK5LBITS;
extern volatile C1MASK5LBITS C1MASK5Lbits __attribute__((__sfr__));

