wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define C1MASK5H C1MASK5H
extern volatile uint16_t  C1MASK5H __attribute__((__sfr__));
typedef struct tagC1MASK5HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK5HBITS;
extern volatile C1MASK5HBITS C1MASK5Hbits __attribute__((__sfr__));

#define C1FLTOBJ6L C1FLTOBJ6L
extern volatile uint16_t  C1FLTOBJ6L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ6LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ6LBITS;
extern volatile C1FLTOBJ6LBITS C1FLTOBJ6Lbits __attribute__((__sfr__));

#define C1FLTOBJ6H C1FLTOBJ6H
extern volatile uint16_t  C1FLTOBJ6H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ6HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ6HBITS;
extern volatile C1FLTOBJ6HBITS C1FLTOBJ6Hbits __attribute__((__sfr__));

#define C1MASK6L C1MASK6L
extern volatile uint16_t  C1MASK6L __attribute__((__sfr__));
typedef struct tagC1MASK6LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK6LBITS;
extern volatile C1MASK6LBITS C1MASK6Lbits __attribute__((__sfr__));

#define C1MASK6H C1MASK6H
extern volatile uint16_t  C1MASK6H __attribute__((__sfr__));
typedef struct tagC1MASK6HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK6HBITS;
extern volatile C1MASK6HBITS C1MASK6Hbits __attribute__((__sfr__));

#define C1FLTOBJ7L C1FLTOBJ7L
extern volatile uint16_t  C1FLTOBJ7L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ7LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ7LBITS;
extern volatile C1FLTOBJ7LBITS C1FLTOBJ7Lbits __attribute__((__sfr__));

#define C1FLTOBJ7H C1FLTOBJ7H
extern volatile uint16_t  C1FLTOBJ7H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ7HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ7HBITS;
extern volatile C1FLTOBJ7HBITS C1FLTOBJ7Hbits __attribute__((__sfr__));

#define C1MASK7L C1MASK7L
extern volatile uint16_t  C1MASK7L __attribute__((__sfr__));
typedef struct tagC1MASK7LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK7LBITS;
extern volatile C1MASK7LBITS C1MASK7Lbits __attribute__((__sfr__));

#define C1MASK7H C1MASK7H
extern volatile uint16_t  C1MASK7H __attribute__((__sfr__));
typedef struct tagC1MASK7HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK7HBITS;
extern volatile C1MASK7HBITS C1MASK7Hbits __attribute__((__sfr__));

#define C1FLTOBJ8L C1FLTOBJ8L
extern volatile uint16_t  C1FLTOBJ8L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ8LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ8LBITS;
extern volatile C1FLTOBJ8LBITS C1FLTOBJ8Lbits __attribute__((__sfr__));

#define C1FLTOBJ8H C1FLTOBJ8H
extern volatile uint16_t  C1FLTOBJ8H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ8HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ8HBITS;
extern volatile C1FLTOBJ8HBITS C1FLTOBJ8Hbits __attribute__((__sfr__));

#define C1MASK8L C1MASK8L
extern volatile uint16_t  C1MASK8L __attribute__((__sfr__));
typedef struct tagC1MASK8LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK8LBITS;
extern volatile C1MASK8LBITS C1MASK8Lbits __attribute__((__sfr__));

#define C1MASK8H C1MASK8H
extern volatile uint16_t  C1MASK8H __attribute__((__sfr__));
typedef struct tagC1MASK8HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK8HBITS;
extern volatile C1MASK8HBITS C1MASK8Hbits __attribute__((__sfr__));

#define C1FLTOBJ9L C1FLTOBJ9L
extern volatile uint16_t  C1FLTOBJ9L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ9LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ9LBITS;
extern volatile C1FLTOBJ9LBITS C1FLTOBJ9Lbits __attribute__((__sfr__));

#define C1FLTOBJ9H C1FLTOBJ9H
extern volatile uint16_t  C1FLTOBJ9H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ9HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ9HBITS;
extern volatile C1FLTOBJ9HBITS C1FLTOBJ9Hbits __attribute__((__sfr__));

