wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define C1MASK12L C1MASK12L
extern volatile uint16_t  C1MASK12L __attribute__((__sfr__));
typedef struct tagC1MASK12LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK12LBITS;
extern volatile C1MASK12LBITS C1MASK12Lbits __attribute__((__sfr__));

#define C1MASK12H C1MASK12H
extern volatile uint16_t  C1MASK12H __attribute__((__sfr__));
typedef struct tagC1MASK12HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK12HBITS;
extern volatile C1MASK12HBITS C1MASK12Hbits __attribute__((__sfr__));

#define C1FLTOBJ13L C1FLTOBJ13L
extern volatile uint16_t  C1FLTOBJ13L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ13LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ13LBITS;
extern volatile C1FLTOBJ13LBITS C1FLTOBJ13Lbits __attribute__((__sfr__));

#define C1FLTOBJ13H C1FLTOBJ13H
extern volatile uint16_t  C1FLTOBJ13H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ13HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ13HBITS;
extern volatile C1FLTOBJ13HBITS C1FLTOBJ13Hbits __attribute__((__sfr__));

#define C1MASK13L C1MASK13L
extern volatile uint16_t  C1MASK13L __attribute__((__sfr__));
typedef struct tagC1MASK13LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK13LBITS;
extern volatile C1MASK13LBITS C1MASK13Lbits __attribute__((__sfr__));

#define C1MASK13H C1MASK13H
extern volatile uint16_t  C1MASK13H __attribute__((__sfr__));
typedef struct tagC1MASK13HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK13HBITS;
extern volatile C1MASK13HBITS C1MASK13Hbits __attribute__((__sfr__));

#define C1FLTOBJ14L C1FLTOBJ14L
extern volatile uint16_t  C1FLTOBJ14L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ14LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ14LBITS;
extern volatile C1FLTOBJ14LBITS C1FLTOBJ14Lbits __attribute__((__sfr__));

#define C1FLTOBJ14H C1FLTOBJ14H
extern volatile uint16_t  C1FLTOBJ14H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ14HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ14HBITS;
extern volatile C1FLTOBJ14HBITS C1FLTOBJ14Hbits __attribute__((__sfr__));

#define C1MASK14L C1MASK14L
extern volatile uint16_t  C1MASK14L __attribute__((__sfr__));
typedef struct tagC1MASK14LBITS {
  uint16_t MSID0:1;
  uint16_t MSID1:1;
  uint16_t MSID2:1;
  uint16_t MSID3:1;
  uint16_t MSID4:1;
  uint16_t MSID5:1;
  uint16_t MSID6:1;
  uint16_t MSID7:1;
  uint16_t MSID8:1;
  uint16_t MSID9:1;
  uint16_t MSID10:1;
  uint16_t MEID0:1;
  uint16_t MEID1:1;
  uint16_t MEID2:1;
  uint16_t MEID3:1;
  uint16_t MEID4:1;
} C1MASK14LBITS;
extern volatile C1MASK14LBITS C1MASK14Lbits __attribute__((__sfr__));

#define C1MASK14H C1MASK14H
extern volatile uint16_t  C1MASK14H __attribute__((__sfr__));
typedef struct tagC1MASK14HBITS {
  uint16_t MEID5:1;
  uint16_t MEID6:1;
  uint16_t MEID7:1;
  uint16_t MEID8:1;
  uint16_t MEID9:1;
  uint16_t MEID10:1;
  uint16_t MEID11:1;
  uint16_t MEID12:1;
  uint16_t MEID13:1;
  uint16_t MEID14:1;
  uint16_t MEID15:1;
  uint16_t MEID16:1;
  uint16_t MEID17:1;
  uint16_t MSID11:1;
  uint16_t MIDE:1;
} C1MASK14HBITS;
extern volatile C1MASK14HBITS C1MASK14Hbits __attribute__((__sfr__));

#define C1FLTOBJ15L C1FLTOBJ15L
extern volatile uint16_t  C1FLTOBJ15L __attribute__((__sfr__));
typedef struct tagC1FLTOBJ15LBITS {
  uint16_t SID0:1;
  uint16_t SID1:1;
  uint16_t SID2:1;
  uint16_t SID3:1;
  uint16_t SID4:1;
  uint16_t SID5:1;
  uint16_t SID6:1;
  uint16_t SID7:1;
  uint16_t SID8:1;
  uint16_t SID9:1;
  uint16_t SID10:1;
  uint16_t EID0:1;
  uint16_t EID1:1;
  uint16_t EID2:1;
  uint16_t EID3:1;
  uint16_t EID4:1;
} C1FLTOBJ15LBITS;
extern volatile C1FLTOBJ15LBITS C1FLTOBJ15Lbits __attribute__((__sfr__));

#define C1FLTOBJ15H C1FLTOBJ15H
extern volatile uint16_t  C1FLTOBJ15H __attribute__((__sfr__));
typedef struct tagC1FLTOBJ15HBITS {
  uint16_t EID5:1;
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
  uint16_t SID11:1;
  uint16_t EXIDE:1;
} C1FLTOBJ15HBITS;
extern volatile C1FLTOBJ15HBITS C1FLTOBJ15Hbits __attribute__((__sfr__));

