wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define IPC23 IPC23
extern volatile uint16_t  IPC23 __attribute__((__sfr__));
typedef struct tagIPC23BITS {
  uint16_t ADCAN1IP:3;
  uint16_t :1;
  uint16_t ADCAN2IP:3;
  uint16_t :1;
  uint16_t ADCAN3IP:3;
  uint16_t :1;
  uint16_t ADCAN4IP:3;
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t  IPC24 __attribute__((__sfr__));
typedef struct tagIPC24BITS {
  uint16_t ADCAN5IP:3;
  uint16_t :1;
  uint16_t ADCAN6IP:3;
  uint16_t :1;
  uint16_t ADCAN7IP:3;
  uint16_t :1;
  uint16_t ADCAN8IP:3;
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t  IPC25 __attribute__((__sfr__));
typedef struct tagIPC25BITS {
  uint16_t ADCAN9IP:3;
  uint16_t :1;
  uint16_t ADCAN10IP:3;
  uint16_t :1;
  uint16_t ADCAN11IP:3;
  uint16_t :1;
  uint16_t ADCAN12IP:3;
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

#define IPC26 IPC26
extern volatile uint16_t  IPC26 __attribute__((__sfr__));
typedef struct tagIPC26BITS {
  uint16_t ADCAN13IP:3;
  uint16_t :1;
  uint16_t ADCAN14IP:3;
  uint16_t :1;
  uint16_t ADCAN15IP:3;
  uint16_t :1;
  uint16_t ADCAN16IP:3;
} IPC26BITS;
extern volatile IPC26BITS IPC26bits __attribute__((__sfr__));

#define IPC27 IPC27
extern volatile uint16_t  IPC27 __attribute__((__sfr__));
typedef struct tagIPC27BITS {
  uint16_t ADCAN17IP:3;
  uint16_t :1;
  uint16_t ADCAN18IP:3;
  uint16_t :1;
  uint16_t ADCAN19IP:3;
} IPC27BITS;
extern volatile IPC27BITS IPC27bits __attribute__((__sfr__));

#define IPC28 IPC28
extern volatile uint16_t  IPC28 __attribute__((__sfr__));
typedef struct tagIPC28BITS {
  uint16_t :12;
  uint16_t ADFLTIP:3;
} IPC28BITS;
extern volatile IPC28BITS IPC28bits __attribute__((__sfr__));

#define IPC29 IPC29
extern volatile uint16_t  IPC29 __attribute__((__sfr__));
typedef struct tagIPC29BITS {
  uint16_t ADCMP0IP:3;
  uint16_t :1;
  uint16_t ADCMP1IP:3;
  uint16_t :1;
  uint16_t ADCMP2IP:3;
  uint16_t :1;
  uint16_t ADCMP3IP:3;
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

#define IPC30 IPC30
extern volatile uint16_t  IPC30 __attribute__((__sfr__));
typedef struct tagIPC30BITS {
  uint16_t ADFLTR0IP:3;
  uint16_t :1;
  uint16_t ADFLTR1IP:3;
  uint16_t :1;
  uint16_t ADFLTR2IP:3;
  uint16_t :1;
  uint16_t ADFLTR3IP:3;
} IPC30BITS;
extern volatile IPC30BITS IPC30bits __attribute__((__sfr__));

#define IPC31 IPC31
extern volatile uint16_t  IPC31 __attribute__((__sfr__));
typedef struct tagIPC31BITS {
  uint16_t CLC1PEIP:3;
  uint16_t :1;
  uint16_t CLC2PEIP:3;
  uint16_t :1;
  uint16_t SPI1IP:3;
  uint16_t :1;
  uint16_t SPI2IP:3;
} IPC31BITS;
extern volatile IPC31BITS IPC31bits __attribute__((__sfr__));

#define IPC32 IPC32
extern volatile uint16_t  IPC32 __attribute__((__sfr__));
typedef struct tagIPC32BITS {
  uint16_t SPI3IP:3;
} IPC32BITS;
extern volatile IPC32BITS IPC32bits __attribute__((__sfr__));

#define IPC35 IPC35
extern volatile uint16_t  IPC35 __attribute__((__sfr__));
typedef struct tagIPC35BITS {
  uint16_t :8;
  uint16_t SI2C3IP:3;
  uint16_t :1;
  uint16_t MI2C3IP:3;
} IPC35BITS;
extern volatile IPC35BITS IPC35bits __attribute__((__sfr__));

#define IPC36 IPC36
extern volatile uint16_t  IPC36 __attribute__((__sfr__));
typedef struct tagIPC36BITS {
  uint16_t I2C3BCIP:3;
} IPC36BITS;
extern volatile IPC36BITS IPC36bits __attribute__((__sfr__));

#define IPC37 IPC37
extern volatile uint16_t  IPC37 __attribute__((__sfr__));
typedef struct tagIPC37BITS {
  uint16_t :4;
  uint16_t CCP7IP:3;
  uint16_t :1;
  uint16_t CCT7IP:3;
} IPC37BITS;
extern volatile IPC37BITS IPC37bits __attribute__((__sfr__));

#define IPC38 IPC38
extern volatile uint16_t  IPC38 __attribute__((__sfr__));
typedef struct tagIPC38BITS {
  uint16_t CCP8IP:3;
  uint16_t :1;
  uint16_t CCT8IP:3;
} IPC38BITS;
extern volatile IPC38BITS IPC38bits __attribute__((__sfr__));

#define IPC40 IPC40
extern volatile uint16_t  IPC40 __attribute__((__sfr__));
typedef struct tagIPC40BITS {
  uint16_t ADC0EIP:3;
  uint16_t :1;
  uint16_t ADC1EIP:3;
} IPC40BITS;
extern volatile IPC40BITS IPC40bits __attribute__((__sfr__));

#define IPC42 IPC42
extern volatile uint16_t  IPC42 __attribute__((__sfr__));
typedef struct tagIPC42BITS {
  uint16_t ADFIFOIP:3;
  uint16_t :1;
  uint16_t PEVTAIP:3;
  uint16_t :1;
  uint16_t PEVTBIP:3;
  uint16_t :1;
  uint16_t PEVTCIP:3;
} IPC42BITS;
extern volatile IPC42BITS IPC42bits __attribute__((__sfr__));

#define IPC43 IPC43
extern volatile uint16_t  IPC43 __attribute__((__sfr__));
typedef struct tagIPC43BITS {
  uint16_t PEVTDIP:3;
  uint16_t :1;
  uint16_t PEVTEIP:3;
  uint16_t :1;
  uint16_t PEVTFIP:3;
  uint16_t :1;
  uint16_t CLC3PEIP:3;
} IPC43BITS;
extern volatile IPC43BITS IPC43bits __attribute__((__sfr__));

#define IPC44 IPC44
extern volatile uint16_t  IPC44 __attribute__((__sfr__));
typedef struct tagIPC44BITS {
  uint16_t CLC4PEIP:3;
  uint16_t :1;
  uint16_t CLC1NEIP:3;
  uint16_t :1;
  uint16_t CLC2NEIP:3;
  uint16_t :1;
  uint16_t CLC3NEIP:3;
} IPC44BITS;
extern volatile IPC44BITS IPC44bits __attribute__((__sfr__));

#define IPC45 IPC45
extern volatile uint16_t  IPC45 __attribute__((__sfr__));
typedef struct tagIPC45BITS {
  uint16_t CLC4NEIP:3;
  uint16_t :1;
  uint16_t CCP9IP:3;
  uint16_t :1;
  uint16_t CCT9IP:3;
} IPC45BITS;
extern volatile IPC45BITS IPC45bits __attribute__((__sfr__));

#define IPC47 IPC47
extern volatile uint16_t  IPC47 __attribute__((__sfr__));
typedef struct tagIPC47BITS {
  uint16_t :4;
  uint16_t U1EVTIP:3;
  uint16_t :1;
  uint16_t U2EVTIP:3;
  uint16_t :1;
  uint16_t U3EVTIP:3;
} IPC47BITS;
extern volatile IPC47BITS IPC47bits __attribute__((__sfr__));

#define IPC48 IPC48
extern volatile uint16_t  IPC48 __attribute__((__sfr__));
typedef struct tagIPC48BITS {
  uint16_t ADCAN24IP:3;
  uint16_t :1;
  uint16_t ADCAN25IP:3;
  uint16_t :1;
  uint16_t PMPIP:3;
  uint16_t :1;
  uint16_t PMPEIP:3;
} IPC48BITS;
extern volatile IPC48BITS IPC48bits __attribute__((__sfr__));

#define INTCON1 INTCON1
extern volatile uint16_t  INTCON1 __attribute__((__sfr__));
typedef struct tagINTCON1BITS {
  uint16_t :1;
  uint16_t OSCFAIL:1;
  uint16_t STKERR:1;
  uint16_t ADDRERR:1;
  uint16_t MATHERR:1;
  uint16_t :1;
  uint16_t DIV0ERR:1;
  uint16_t SFTACERR:1;
  uint16_t COVTE:1;
  uint16_t OVBTE:1;
  uint16_t OVATE:1;
  uint16_t COVBERR:1;
  uint16_t COVAERR:1;
  uint16_t OVBERR:1;
  uint16_t OVAERR:1;
  uint16_t NSTDIS:1;
} INTCON1BITS;
