wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile CCP7CON2LBITS CCP7CON2Lbits __attribute__((__sfr__));

#define CCP7CON2H CCP7CON2H
extern volatile uint16_t  CCP7CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP7CON2HBITS;
extern volatile CCP7CON2HBITS CCP7CON2Hbits __attribute__((__sfr__));

#define CCP7CON3H CCP7CON3H
extern volatile uint16_t  CCP7CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP7CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :6;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :8;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP7CON3HBITS;
extern volatile CCP7CON3HBITS CCP7CON3Hbits __attribute__((__sfr__));

#define CCP7STAT CCP7STAT
extern volatile uint16_t  CCP7STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP7STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP7STATBITS;
extern volatile CCP7STATBITS CCP7STATbits __attribute__((__sfr__));

#define CCP7STATL CCP7STATL
extern volatile uint16_t  CCP7STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP7STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP7STATLBITS;
extern volatile CCP7STATLBITS CCP7STATLbits __attribute__((__sfr__));

#define CCP7STATH CCP7STATH
extern volatile uint16_t  CCP7STATH __attribute__((__sfr__));
typedef struct tagCCP7STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP7STATHBITS;
extern volatile CCP7STATHBITS CCP7STATHbits __attribute__((__sfr__));

#define CCP7TMRL CCP7TMRL
extern volatile uint16_t  CCP7TMRL __attribute__((__sfr__));
#define CCP7TMRH CCP7TMRH
extern volatile uint16_t  CCP7TMRH __attribute__((__sfr__));
#define CCP7PRL CCP7PRL
extern volatile uint16_t  CCP7PRL __attribute__((__sfr__));
#define CCP7PRH CCP7PRH
extern volatile uint16_t  CCP7PRH __attribute__((__sfr__));
#define CCP7RA CCP7RA
extern volatile uint16_t  CCP7RA __attribute__((__sfr__));
#define CCP7RAL CCP7RAL
extern volatile uint16_t  CCP7RAL __attribute__((__sfr__));
#define CCP7RB CCP7RB
extern volatile uint16_t  CCP7RB __attribute__((__sfr__));
#define CCP7RBL CCP7RBL
extern volatile uint16_t  CCP7RBL __attribute__((__sfr__));
#define CCP7BUFL CCP7BUFL
extern volatile uint16_t  CCP7BUFL __attribute__((__sfr__));
#define CCP7BUFH CCP7BUFH
extern volatile uint16_t  CCP7BUFH __attribute__((__sfr__));
#define CCP8CON1L CCP8CON1L
extern volatile uint16_t  CCP8CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP8CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP8CON1LBITS;
extern volatile CCP8CON1LBITS CCP8CON1Lbits __attribute__((__sfr__));

#define CCP8CON1H CCP8CON1H
extern volatile uint16_t  CCP8CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP8CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP8CON1HBITS;
extern volatile CCP8CON1HBITS CCP8CON1Hbits __attribute__((__sfr__));

#define CCP8CON2L CCP8CON2L
extern volatile uint16_t  CCP8CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP8CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP8CON2LBITS;
