wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile CCP8CON2LBITS CCP8CON2Lbits __attribute__((__sfr__));

#define CCP8CON2H CCP8CON2H
extern volatile uint16_t  CCP8CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP8CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP8CON2HBITS;
extern volatile CCP8CON2HBITS CCP8CON2Hbits __attribute__((__sfr__));

#define CCP8CON3H CCP8CON3H
extern volatile uint16_t  CCP8CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP8CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :6;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :8;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP8CON3HBITS;
extern volatile CCP8CON3HBITS CCP8CON3Hbits __attribute__((__sfr__));

#define CCP8STAT CCP8STAT
extern volatile uint16_t  CCP8STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP8STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP8STATBITS;
extern volatile CCP8STATBITS CCP8STATbits __attribute__((__sfr__));

#define CCP8STATL CCP8STATL
extern volatile uint16_t  CCP8STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP8STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP8STATLBITS;
extern volatile CCP8STATLBITS CCP8STATLbits __attribute__((__sfr__));

#define CCP8STATH CCP8STATH
extern volatile uint16_t  CCP8STATH __attribute__((__sfr__));
typedef struct tagCCP8STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP8STATHBITS;
extern volatile CCP8STATHBITS CCP8STATHbits __attribute__((__sfr__));

#define CCP8TMRL CCP8TMRL
extern volatile uint16_t  CCP8TMRL __attribute__((__sfr__));
#define CCP8TMRH CCP8TMRH
extern volatile uint16_t  CCP8TMRH __attribute__((__sfr__));
#define CCP8PRL CCP8PRL
extern volatile uint16_t  CCP8PRL __attribute__((__sfr__));
#define CCP8PRH CCP8PRH
extern volatile uint16_t  CCP8PRH __attribute__((__sfr__));
#define CCP8RA CCP8RA
extern volatile uint16_t  CCP8RA __attribute__((__sfr__));
#define CCP8RAL CCP8RAL
extern volatile uint16_t  CCP8RAL __attribute__((__sfr__));
#define CCP8RB CCP8RB
extern volatile uint16_t  CCP8RB __attribute__((__sfr__));
#define CCP8RBL CCP8RBL
extern volatile uint16_t  CCP8RBL __attribute__((__sfr__));
#define CCP8BUFL CCP8BUFL
extern volatile uint16_t  CCP8BUFL __attribute__((__sfr__));
#define CCP8BUFH CCP8BUFH
extern volatile uint16_t  CCP8BUFH __attribute__((__sfr__));
#define CCP9CON1L CCP9CON1L
extern volatile uint16_t  CCP9CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP9CON1LBITS;
extern volatile CCP9CON1LBITS CCP9CON1Lbits __attribute__((__sfr__));

#define CCP9CON1H CCP9CON1H
extern volatile uint16_t  CCP9CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP9CON1HBITS;
extern volatile CCP9CON1HBITS CCP9CON1Hbits __attribute__((__sfr__));

#define CCP9CON2L CCP9CON2L
extern volatile uint16_t  CCP9CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP9CON2LBITS;
