wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile CCP9CON2LBITS CCP9CON2Lbits __attribute__((__sfr__));

#define CCP9CON2H CCP9CON2H
extern volatile uint16_t  CCP9CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t OCBEN:1;
      uint16_t OCCEN:1;
      uint16_t OCDEN:1;
      uint16_t OCEEN:1;
      uint16_t OCFEN:1;
      uint16_t :1;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP9CON2HBITS;
extern volatile CCP9CON2HBITS CCP9CON2Hbits __attribute__((__sfr__));

#define CCP9CON3L CCP9CON3L
extern volatile uint16_t  CCP9CON3L __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON3LBITS {
  union {
    struct {
      uint16_t DT:6;
    };
    struct {
      uint16_t DT0:1;
      uint16_t DT1:1;
      uint16_t DT2:1;
      uint16_t DT3:1;
      uint16_t DT4:1;
      uint16_t DT5:1;
    };
  };
} CCP9CON3LBITS;
extern volatile CCP9CON3LBITS CCP9CON3Lbits __attribute__((__sfr__));

#define CCP9CON3H CCP9CON3H
extern volatile uint16_t  CCP9CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON3HBITS {
  union {
    struct {
      uint16_t PSSBDF:2;
      uint16_t PSSACE:2;
      uint16_t POLBDF:1;
      uint16_t POLACE:1;
      uint16_t :2;
      uint16_t OUTM:3;
      uint16_t :1;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t PSSBDF0:1;
      uint16_t PSSBDF1:1;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :4;
      uint16_t OUTM0:1;
      uint16_t OUTM1:1;
      uint16_t OUTM2:1;
      uint16_t :1;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP9CON3HBITS;
extern volatile CCP9CON3HBITS CCP9CON3Hbits __attribute__((__sfr__));

#define CCP9STAT CCP9STAT
extern volatile uint16_t  CCP9STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP9STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP9STATBITS;
extern volatile CCP9STATBITS CCP9STATbits __attribute__((__sfr__));

#define CCP9STATL CCP9STATL
extern volatile uint16_t  CCP9STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP9STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP9STATLBITS;
extern volatile CCP9STATLBITS CCP9STATLbits __attribute__((__sfr__));

#define CCP9STATH CCP9STATH
extern volatile uint16_t  CCP9STATH __attribute__((__sfr__));
typedef struct tagCCP9STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP9STATHBITS;
extern volatile CCP9STATHBITS CCP9STATHbits __attribute__((__sfr__));

#define CCP9TMRL CCP9TMRL
extern volatile uint16_t  CCP9TMRL __attribute__((__sfr__));
#define CCP9TMRH CCP9TMRH
extern volatile uint16_t  CCP9TMRH __attribute__((__sfr__));
#define CCP9PRL CCP9PRL
extern volatile uint16_t  CCP9PRL __attribute__((__sfr__));
#define CCP9PRH CCP9PRH
extern volatile uint16_t  CCP9PRH __attribute__((__sfr__));
#define CCP9RA CCP9RA
extern volatile uint16_t  CCP9RA __attribute__((__sfr__));
#define CCP9RAL CCP9RAL
extern volatile uint16_t  CCP9RAL __attribute__((__sfr__));
#define CCP9RB CCP9RB
extern volatile uint16_t  CCP9RB __attribute__((__sfr__));
#define CCP9RBL CCP9RBL
extern volatile uint16_t  CCP9RBL __attribute__((__sfr__));
#define CCP9BUFL CCP9BUFL
extern volatile uint16_t  CCP9BUFL __attribute__((__sfr__));
#define CCP9BUFH CCP9BUFH
extern volatile uint16_t  CCP9BUFH __attribute__((__sfr__));
#define DMACON DMACON
extern volatile uint16_t  DMACON __attribute__((__sfr__));
typedef struct tagDMACONBITS {
  uint16_t PRSSEL:1;
  uint16_t :12;
  uint16_t DMASIDL:1;
  uint16_t :1;
  uint16_t DMAEN:1;
} DMACONBITS;
extern volatile DMACONBITS DMACONbits __attribute__((__sfr__));

#define DMABUF DMABUF
extern volatile uint16_t  DMABUF __attribute__((__sfr__));
#define DMAL DMAL
extern volatile uint16_t  DMAL __attribute__((__sfr__));
#define DMAH DMAH
extern volatile uint16_t  DMAH __attribute__((__sfr__));
#define DMACH0 DMACH0
extern volatile uint16_t  DMACH0 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH0BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH0BITS;
extern volatile DMACH0BITS DMACH0bits __attribute__((__sfr__));

#define DMAINT0 DMAINT0
extern volatile uint16_t  DMAINT0 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT0BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT0BITS;
