wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile ADTRIG4HBITS ADTRIG4Hbits __attribute__((__sfr__));

#define ADTRIG6L ADTRIG6L
extern volatile uint16_t  ADTRIG6L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG6LBITS {
  union {
    struct {
      uint16_t TRGSRC24:5;
      uint16_t :3;
      uint16_t TRGSRC25:5;
    };
    struct {
      uint16_t TRIGSRC240:1;
      uint16_t TRIGSRC241:1;
      uint16_t TRIGSRC242:1;
      uint16_t TRIGSRC243:1;
      uint16_t TRIGSRC244:1;
      uint16_t :3;
      uint16_t TRGSRC250:1;
      uint16_t TRGSRC251:1;
      uint16_t TRGSRC252:1;
      uint16_t TRGSRC253:1;
      uint16_t TRGSRC254:1;
    };
    struct {
      uint16_t TRGSRC240:1;
      uint16_t TRGSRC241:1;
      uint16_t TRGSRC242:1;
      uint16_t TRGSRC243:1;
      uint16_t TRGSRC244:1;
    };
  };
} ADTRIG6LBITS;
extern volatile ADTRIG6LBITS ADTRIG6Lbits __attribute__((__sfr__));

#define ADCMP0CON ADCMP0CON
extern volatile uint16_t  ADCMP0CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP0CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP0CONBITS;
extern volatile ADCMP0CONBITS ADCMP0CONbits __attribute__((__sfr__));

#define ADCMP1CON ADCMP1CON
extern volatile uint16_t  ADCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP1CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP1CONBITS;
extern volatile ADCMP1CONBITS ADCMP1CONbits __attribute__((__sfr__));

#define ADCMP2CON ADCMP2CON
extern volatile uint16_t  ADCMP2CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP2CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP2CONBITS;
extern volatile ADCMP2CONBITS ADCMP2CONbits __attribute__((__sfr__));

#define ADCMP3CON ADCMP3CON
extern volatile uint16_t  ADCMP3CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP3CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP3CONBITS;
extern volatile ADCMP3CONBITS ADCMP3CONbits __attribute__((__sfr__));

#define ADLVLTRGL ADLVLTRGL
extern volatile uint16_t  ADLVLTRGL __attribute__((__sfr__));
typedef struct tagADLVLTRGLBITS {
  uint16_t LVLEN0:1;
  uint16_t LVLEN1:1;
  uint16_t LVLEN2:1;
  uint16_t LVLEN3:1;
  uint16_t LVLEN4:1;
  uint16_t LVLEN5:1;
  uint16_t LVLEN6:1;
  uint16_t LVLEN7:1;
  uint16_t LVLEN8:1;
  uint16_t LVLEN9:1;
  uint16_t LVLEN10:1;
  uint16_t LVLEN11:1;
  uint16_t LVLEN12:1;
  uint16_t LVLEN13:1;
  uint16_t LVLEN14:1;
  uint16_t LVLEN15:1;
} ADLVLTRGLBITS;
extern volatile ADLVLTRGLBITS ADLVLTRGLbits __attribute__((__sfr__));

#define ADLVLTRGH ADLVLTRGH
extern volatile uint16_t  ADLVLTRGH __attribute__((__sfr__));
typedef struct tagADLVLTRGHBITS {
  uint16_t LVLEN16:1;
  uint16_t LVLEN17:1;
  uint16_t LVLEN18:1;
  uint16_t LVLEN19:1;
  uint16_t :4;
  uint16_t LVLEN24:1;
  uint16_t LVLEN25:1;
} ADLVLTRGHBITS;
extern volatile ADLVLTRGHBITS ADLVLTRGHbits __attribute__((__sfr__));

#define ADCORE0L ADCORE0L
extern volatile uint16_t  ADCORE0L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE0LBITS;
extern volatile ADCORE0LBITS ADCORE0Lbits __attribute__((__sfr__));

#define ADCORE0H ADCORE0H
extern volatile uint16_t  ADCORE0H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE0HBITS;
extern volatile ADCORE0HBITS ADCORE0Hbits __attribute__((__sfr__));

#define ADCORE1L ADCORE1L
extern volatile uint16_t  ADCORE1L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE1LBITS;
extern volatile ADCORE1LBITS ADCORE1Lbits __attribute__((__sfr__));

#define ADCORE1H ADCORE1H
extern volatile uint16_t  ADCORE1H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE1HBITS;
extern volatile ADCORE1HBITS ADCORE1Hbits __attribute__((__sfr__));

#define ADEIEL ADEIEL
extern volatile uint16_t  ADEIEL __attribute__((__sfr__));
typedef struct tagADEIELBITS {
  uint16_t EIEN0:1;
  uint16_t EIEN1:1;
  uint16_t EIEN2:1;
  uint16_t EIEN3:1;
  uint16_t EIEN4:1;
  uint16_t EIEN5:1;
  uint16_t EIEN6:1;
  uint16_t EIEN7:1;
  uint16_t EIEN8:1;
  uint16_t EIEN9:1;
  uint16_t EIEN10:1;
  uint16_t EIEN11:1;
  uint16_t EIEN12:1;
  uint16_t EIEN13:1;
  uint16_t EIEN14:1;
  uint16_t EIEN15:1;
} ADEIELBITS;
extern volatile ADEIELBITS ADEIELbits __attribute__((__sfr__));

