wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile DAC1DATLBITS DAC1DATLbits __attribute__((__sfr__));

#define DAC1DATH DAC1DATH
extern volatile uint16_t  DAC1DATH __attribute__((__sfr__));
__extension__ typedef struct tagDAC1DATHBITS {
  union {
    struct {
      uint16_t DACDATH:16;
    };
    struct {
      uint16_t DACDATH0:1;
      uint16_t DACDATH1:1;
      uint16_t DACDATH2:1;
      uint16_t DACDATH3:1;
      uint16_t DACDATH4:1;
      uint16_t DACDATH5:1;
      uint16_t DACDATH6:1;
      uint16_t DACDATH7:1;
      uint16_t DACDATH8:1;
      uint16_t DACDATH9:1;
      uint16_t DACDATH10:1;
      uint16_t DACDATH11:1;
      uint16_t DACDATH12:1;
      uint16_t DACDATH13:1;
      uint16_t DACDATH14:1;
      uint16_t DACDATH15:1;
    };
  };
} DAC1DATHBITS;
extern volatile DAC1DATHBITS DAC1DATHbits __attribute__((__sfr__));

#define SLP1CONL SLP1CONL
extern volatile uint16_t  SLP1CONL __attribute__((__sfr__));
__extension__ typedef struct tagSLP1CONLBITS {
  union {
    struct {
      uint16_t SLPSTRT:4;
      uint16_t SLPSTOPB:4;
      uint16_t SLPSTOPA:4;
      uint16_t HCFSEL:4;
    };
    struct {
      uint16_t SLPSTRT0:1;
      uint16_t SLPSTRT1:1;
      uint16_t SLPSTRT2:1;
      uint16_t SLPSTRT3:1;
      uint16_t SLPSTOPB0:1;
      uint16_t SLPSTOPB1:1;
      uint16_t SLPSTOPB2:1;
      uint16_t SLPSTOPB3:1;
      uint16_t SLPSTOPA0:1;
      uint16_t SLPSTOPA1:1;
      uint16_t SLPSTOPA2:1;
      uint16_t SLPSTOPA3:1;
      uint16_t HCFSEL0:1;
      uint16_t HCFSEL1:1;
      uint16_t HCFSEL2:1;
      uint16_t HCFSEL3:1;
    };
  };
} SLP1CONLBITS;
extern volatile SLP1CONLBITS SLP1CONLbits __attribute__((__sfr__));

#define SLP1CONH SLP1CONH
extern volatile uint16_t  SLP1CONH __attribute__((__sfr__));
typedef struct tagSLP1CONHBITS {
  uint16_t :9;
  uint16_t PSE:1;
  uint16_t TWME:1;
  uint16_t HME:1;
  uint16_t :3;
  uint16_t SLOPEN:1;
} SLP1CONHBITS;
extern volatile SLP1CONHBITS SLP1CONHbits __attribute__((__sfr__));

#define SLP1DAT SLP1DAT
extern volatile uint16_t  SLP1DAT __attribute__((__sfr__));
__extension__ typedef struct tagSLP1DATBITS {
  union {
    struct {
      uint16_t SLPDAT:16;
    };
    struct {
      uint16_t SLPDAT0:1;
      uint16_t SLPDAT1:1;
      uint16_t SLPDAT2:1;
      uint16_t SLPDAT3:1;
      uint16_t SLPDAT4:1;
      uint16_t SLPDAT5:1;
      uint16_t SLPDAT6:1;
      uint16_t SLPDAT7:1;
      uint16_t SLPDAT8:1;
      uint16_t SLPDAT9:1;
      uint16_t SLPDAT10:1;
      uint16_t SLPDAT11:1;
      uint16_t SLPDAT12:1;
      uint16_t SLPDAT13:1;
      uint16_t SLPDAT14:1;
      uint16_t SLPDAT15:1;
    };
  };
} SLP1DATBITS;
extern volatile SLP1DATBITS SLP1DATbits __attribute__((__sfr__));

#define DAC2CONL DAC2CONL
extern volatile uint16_t  DAC2CONL __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONLBITS {
  union {
    struct {
      uint16_t HYSSEL:2;
      uint16_t HYSPOL:1;
      uint16_t INSEL:3;
      uint16_t CMPPOL:1;
      uint16_t CMPSTAT:1;
      uint16_t FLTREN:1;
      uint16_t DACOEN:1;
      uint16_t CBE:1;
      uint16_t :2;
      uint16_t IRQM:2;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
      uint16_t :11;
      uint16_t IRQM0:1;
      uint16_t IRQM1:1;
    };
  };
} DAC2CONLBITS;
extern volatile DAC2CONLBITS DAC2CONLbits __attribute__((__sfr__));

#define DAC2CONH DAC2CONH
extern volatile uint16_t  DAC2CONH __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONHBITS {
  union {
    struct {
      uint16_t TMCB:10;
    };
    struct {
      uint16_t TMCB0:1;
      uint16_t TMCB1:1;
      uint16_t TMCB2:1;
      uint16_t TMCB3:1;
      uint16_t TMCB4:1;
      uint16_t TMCB5:1;
      uint16_t TMCB6:1;
      uint16_t TMCB7:1;
      uint16_t TMCB8:1;
      uint16_t TMCB9:1;
    };
  };
} DAC2CONHBITS;
extern volatile DAC2CONHBITS DAC2CONHbits __attribute__((__sfr__));

#define DAC2DATL DAC2DATL
extern volatile uint16_t  DAC2DATL __attribute__((__sfr__));
__extension__ typedef struct tagDAC2DATLBITS {
  union {
    struct {
      uint16_t DACDATL:16;
    };
    struct {
      uint16_t DACDATL0:1;
      uint16_t DACDATL1:1;
      uint16_t DACDATL2:1;
      uint16_t DACDATL3:1;
      uint16_t DACDATL4:1;
      uint16_t DACDATL5:1;
      uint16_t DACDATL6:1;
      uint16_t DACDATL7:1;
      uint16_t DACDATL8:1;
      uint16_t DACDATL9:1;
      uint16_t DACDATL10:1;
      uint16_t DACDATL11:1;
      uint16_t DACDATL12:1;
      uint16_t DACDATL13:1;
      uint16_t DACDATL14:1;
      uint16_t DACDATL15:1;
    };
  };
} DAC2DATLBITS;
extern volatile DAC2DATLBITS DAC2DATLbits __attribute__((__sfr__));

#define DAC2DATH DAC2DATH
extern volatile uint16_t  DAC2DATH __attribute__((__sfr__));
__extension__ typedef struct tagDAC2DATHBITS {
  union {
    struct {
      uint16_t DACDATH:16;
    };
    struct {
      uint16_t DACDATH0:1;
      uint16_t DACDATH1:1;
      uint16_t DACDATH2:1;
      uint16_t DACDATH3:1;
      uint16_t DACDATH4:1;
      uint16_t DACDATH5:1;
      uint16_t DACDATH6:1;
      uint16_t DACDATH7:1;
      uint16_t DACDATH8:1;
      uint16_t DACDATH9:1;
      uint16_t DACDATH10:1;
      uint16_t DACDATH11:1;
      uint16_t DACDATH12:1;
      uint16_t DACDATH13:1;
      uint16_t DACDATH14:1;
      uint16_t DACDATH15:1;
    };
  };
} DAC2DATHBITS;
extern volatile DAC2DATHBITS DAC2DATHbits __attribute__((__sfr__));

#define SLP2CONL SLP2CONL
extern volatile uint16_t  SLP2CONL __attribute__((__sfr__));
__extension__ typedef struct tagSLP2CONLBITS {
  union {
    struct {
      uint16_t SLPSTRT:4;
      uint16_t SLPSTOPB:4;
      uint16_t SLPSTOPA:4;
      uint16_t HCFSEL:4;
    };
    struct {
      uint16_t SLPSTRT0:1;
      uint16_t SLPSTRT1:1;
      uint16_t SLPSTRT2:1;
      uint16_t SLPSTRT3:1;
      uint16_t SLPSTOPB0:1;
      uint16_t SLPSTOPB1:1;
      uint16_t SLPSTOPB2:1;
      uint16_t SLPSTOPB3:1;
      uint16_t SLPSTOPA0:1;
      uint16_t SLPSTOPA1:1;
      uint16_t SLPSTOPA2:1;
      uint16_t SLPSTOPA3:1;
      uint16_t HCFSEL0:1;
      uint16_t HCFSEL1:1;
      uint16_t HCFSEL2:1;
      uint16_t HCFSEL3:1;
    };
  };
} SLP2CONLBITS;
extern volatile SLP2CONLBITS SLP2CONLbits __attribute__((__sfr__));

#define SLP2CONH SLP2CONH
extern volatile uint16_t  SLP2CONH __attribute__((__sfr__));
typedef struct tagSLP2CONHBITS {
  uint16_t :9;
  uint16_t PSE:1;
  uint16_t TWME:1;
  uint16_t HME:1;
  uint16_t :3;
  uint16_t SLOPEN:1;
} SLP2CONHBITS;
extern volatile SLP2CONHBITS SLP2CONHbits __attribute__((__sfr__));

#define SLP2DAT SLP2DAT
extern volatile uint16_t  SLP2DAT __attribute__((__sfr__));
__extension__ typedef struct tagSLP2DATBITS {
  union {
    struct {
      uint16_t SLPDAT:16;
    };
    struct {
      uint16_t SLPDAT0:1;
      uint16_t SLPDAT1:1;
      uint16_t SLPDAT2:1;
      uint16_t SLPDAT3:1;
      uint16_t SLPDAT4:1;
      uint16_t SLPDAT5:1;
      uint16_t SLPDAT6:1;
      uint16_t SLPDAT7:1;
      uint16_t SLPDAT8:1;
      uint16_t SLPDAT9:1;
      uint16_t SLPDAT10:1;
      uint16_t SLPDAT11:1;
      uint16_t SLPDAT12:1;
      uint16_t SLPDAT13:1;
      uint16_t SLPDAT14:1;
      uint16_t SLPDAT15:1;
    };
  };
} SLP2DATBITS;
