wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile SLP2DATBITS SLP2DATbits __attribute__((__sfr__));

#define DAC3CONL DAC3CONL
extern volatile uint16_t  DAC3CONL __attribute__((__sfr__));
__extension__ typedef struct tagDAC3CONLBITS {
  union {
    struct {
      uint16_t HYSSEL:2;
      uint16_t HYSPOL:1;
      uint16_t INSEL:3;
      uint16_t CMPPOL:1;
      uint16_t CMPSTAT:1;
      uint16_t FLTREN:1;
      uint16_t DACOEN:1;
      uint16_t CBE:1;
      uint16_t :2;
      uint16_t IRQM:2;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
      uint16_t :11;
      uint16_t IRQM0:1;
      uint16_t IRQM1:1;
    };
  };
} DAC3CONLBITS;
extern volatile DAC3CONLBITS DAC3CONLbits __attribute__((__sfr__));

#define DAC3CONH DAC3CONH
extern volatile uint16_t  DAC3CONH __attribute__((__sfr__));
__extension__ typedef struct tagDAC3CONHBITS {
  union {
    struct {
      uint16_t TMCB:10;
    };
    struct {
      uint16_t TMCB0:1;
      uint16_t TMCB1:1;
      uint16_t TMCB2:1;
      uint16_t TMCB3:1;
      uint16_t TMCB4:1;
      uint16_t TMCB5:1;
      uint16_t TMCB6:1;
      uint16_t TMCB7:1;
      uint16_t TMCB8:1;
      uint16_t TMCB9:1;
    };
  };
} DAC3CONHBITS;
extern volatile DAC3CONHBITS DAC3CONHbits __attribute__((__sfr__));

#define DAC3DATL DAC3DATL
extern volatile uint16_t  DAC3DATL __attribute__((__sfr__));
__extension__ typedef struct tagDAC3DATLBITS {
  union {
    struct {
      uint16_t DACDATL:16;
    };
    struct {
      uint16_t DACDATL0:1;
      uint16_t DACDATL1:1;
      uint16_t DACDATL2:1;
      uint16_t DACDATL3:1;
      uint16_t DACDATL4:1;
      uint16_t DACDATL5:1;
      uint16_t DACDATL6:1;
      uint16_t DACDATL7:1;
      uint16_t DACDATL8:1;
      uint16_t DACDATL9:1;
      uint16_t DACDATL10:1;
      uint16_t DACDATL11:1;
      uint16_t DACDATL12:1;
      uint16_t DACDATL13:1;
      uint16_t DACDATL14:1;
      uint16_t DACDATL15:1;
    };
  };
} DAC3DATLBITS;
extern volatile DAC3DATLBITS DAC3DATLbits __attribute__((__sfr__));

#define DAC3DATH DAC3DATH
extern volatile uint16_t  DAC3DATH __attribute__((__sfr__));
__extension__ typedef struct tagDAC3DATHBITS {
  union {
    struct {
      uint16_t DACDATH:16;
    };
    struct {
      uint16_t DACDATH0:1;
      uint16_t DACDATH1:1;
      uint16_t DACDATH2:1;
      uint16_t DACDATH3:1;
      uint16_t DACDATH4:1;
      uint16_t DACDATH5:1;
      uint16_t DACDATH6:1;
      uint16_t DACDATH7:1;
      uint16_t DACDATH8:1;
      uint16_t DACDATH9:1;
      uint16_t DACDATH10:1;
      uint16_t DACDATH11:1;
      uint16_t DACDATH12:1;
      uint16_t DACDATH13:1;
      uint16_t DACDATH14:1;
      uint16_t DACDATH15:1;
    };
  };
} DAC3DATHBITS;
extern volatile DAC3DATHBITS DAC3DATHbits __attribute__((__sfr__));

#define SLP3CONL SLP3CONL
extern volatile uint16_t  SLP3CONL __attribute__((__sfr__));
__extension__ typedef struct tagSLP3CONLBITS {
  union {
    struct {
      uint16_t SLPSTRT:4;
      uint16_t SLPSTOPB:4;
      uint16_t SLPSTOPA:4;
      uint16_t HCFSEL:4;
    };
    struct {
      uint16_t SLPSTRT0:1;
      uint16_t SLPSTRT1:1;
      uint16_t SLPSTRT2:1;
      uint16_t SLPSTRT3:1;
      uint16_t SLPSTOPB0:1;
      uint16_t SLPSTOPB1:1;
      uint16_t SLPSTOPB2:1;
      uint16_t SLPSTOPB3:1;
      uint16_t SLPSTOPA0:1;
      uint16_t SLPSTOPA1:1;
      uint16_t SLPSTOPA2:1;
      uint16_t SLPSTOPA3:1;
      uint16_t HCFSEL0:1;
      uint16_t HCFSEL1:1;
      uint16_t HCFSEL2:1;
      uint16_t HCFSEL3:1;
    };
  };
} SLP3CONLBITS;
extern volatile SLP3CONLBITS SLP3CONLbits __attribute__((__sfr__));

#define SLP3CONH SLP3CONH
extern volatile uint16_t  SLP3CONH __attribute__((__sfr__));
typedef struct tagSLP3CONHBITS {
  uint16_t :9;
  uint16_t PSE:1;
  uint16_t TWME:1;
  uint16_t HME:1;
  uint16_t :3;
  uint16_t SLOPEN:1;
} SLP3CONHBITS;
extern volatile SLP3CONHBITS SLP3CONHbits __attribute__((__sfr__));

#define SLP3DAT SLP3DAT
extern volatile uint16_t  SLP3DAT __attribute__((__sfr__));
__extension__ typedef struct tagSLP3DATBITS {
  union {
    struct {
      uint16_t SLPDAT:16;
    };
    struct {
      uint16_t SLPDAT0:1;
      uint16_t SLPDAT1:1;
      uint16_t SLPDAT2:1;
      uint16_t SLPDAT3:1;
      uint16_t SLPDAT4:1;
      uint16_t SLPDAT5:1;
      uint16_t SLPDAT6:1;
      uint16_t SLPDAT7:1;
      uint16_t SLPDAT8:1;
      uint16_t SLPDAT9:1;
      uint16_t SLPDAT10:1;
      uint16_t SLPDAT11:1;
      uint16_t SLPDAT12:1;
      uint16_t SLPDAT13:1;
      uint16_t SLPDAT14:1;
      uint16_t SLPDAT15:1;
    };
  };
} SLP3DATBITS;
extern volatile SLP3DATBITS SLP3DATbits __attribute__((__sfr__));

#define VREGCON VREGCON
extern volatile uint16_t  VREGCON __attribute__((__sfr__));
typedef struct tagVREGCONBITS {
  uint16_t VREG1OV:2;
  uint16_t VREG2OV:2;
  uint16_t VREG3OV:2;
  uint16_t :9;
  uint16_t LPWREN:1;
} VREGCONBITS;
extern volatile VREGCONBITS VREGCONbits __attribute__((__sfr__));

#define RPCON RPCON
extern volatile uint16_t  RPCON __attribute__((__sfr__));
typedef struct tagRPCONBITS {
  uint16_t :11;
  uint16_t IOLOCK:1;
} RPCONBITS;
extern volatile RPCONBITS RPCONbits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t  RPINR0 __attribute__((__sfr__));
typedef struct tagRPINR0BITS {
  uint16_t :8;
  uint16_t INT1R:8;
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t  RPINR1 __attribute__((__sfr__));
typedef struct tagRPINR1BITS {
  uint16_t INT2R:8;
  uint16_t INT3R:8;
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t  RPINR2 __attribute__((__sfr__));
typedef struct tagRPINR2BITS {
  uint16_t :8;
  uint16_t T1CKR:8;
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t  RPINR3 __attribute__((__sfr__));
typedef struct tagRPINR3BITS {
  uint16_t TCKI1R:8;
  uint16_t ICM1R:8;
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR4 RPINR4
extern volatile uint16_t  RPINR4 __attribute__((__sfr__));
typedef struct tagRPINR4BITS {
  uint16_t TCKI2R:8;
  uint16_t ICM2R:8;
} RPINR4BITS;
extern volatile RPINR4BITS RPINR4bits __attribute__((__sfr__));

#define RPINR5 RPINR5
extern volatile uint16_t  RPINR5 __attribute__((__sfr__));
typedef struct tagRPINR5BITS {
  uint16_t TCKI3R:8;
  uint16_t ICM3R:8;
} RPINR5BITS;
extern volatile RPINR5BITS RPINR5bits __attribute__((__sfr__));

