wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

#define RPINR42 RPINR42
extern volatile uint16_t  RPINR42 __attribute__((__sfr__));
typedef struct tagRPINR42BITS {
  uint16_t PCI12R:8;
  uint16_t PCI13R:8;
} RPINR42BITS;
extern volatile RPINR42BITS RPINR42bits __attribute__((__sfr__));

#define RPINR43 RPINR43
extern volatile uint16_t  RPINR43 __attribute__((__sfr__));
typedef struct tagRPINR43BITS {
  uint16_t PCI14R:8;
  uint16_t PCI15R:8;
} RPINR43BITS;
extern volatile RPINR43BITS RPINR43bits __attribute__((__sfr__));

#define RPINR44 RPINR44
extern volatile uint16_t  RPINR44 __attribute__((__sfr__));
typedef struct tagRPINR44BITS {
  uint16_t PCI16R:8;
  uint16_t SENT1R:8;
} RPINR44BITS;
extern volatile RPINR44BITS RPINR44bits __attribute__((__sfr__));

#define RPINR45 RPINR45
extern volatile uint16_t  RPINR45 __attribute__((__sfr__));
typedef struct tagRPINR45BITS {
  uint16_t SENT2R:8;
  uint16_t CLCINAR:8;
} RPINR45BITS;
extern volatile RPINR45BITS RPINR45bits __attribute__((__sfr__));

#define RPINR46 RPINR46
extern volatile uint16_t  RPINR46 __attribute__((__sfr__));
typedef struct tagRPINR46BITS {
  uint16_t CLCINBR:8;
  uint16_t CLCINCR:8;
} RPINR46BITS;
extern volatile RPINR46BITS RPINR46bits __attribute__((__sfr__));

#define RPINR47 RPINR47
extern volatile uint16_t  RPINR47 __attribute__((__sfr__));
typedef struct tagRPINR47BITS {
  uint16_t CLCINDR:8;
  uint16_t ADCTRGR:8;
} RPINR47BITS;
extern volatile RPINR47BITS RPINR47bits __attribute__((__sfr__));

#define RPINR48 RPINR48
extern volatile uint16_t  RPINR48 __attribute__((__sfr__));
typedef struct tagRPINR48BITS {
  uint16_t OCFDR:8;
  uint16_t U1CTSR:8;
} RPINR48BITS;
extern volatile RPINR48BITS RPINR48bits __attribute__((__sfr__));

#define RPINR49 RPINR49
extern volatile uint16_t  RPINR49 __attribute__((__sfr__));
typedef struct tagRPINR49BITS {
  uint16_t U2CTSR:8;
  uint16_t U3CTSR:8;
} RPINR49BITS;
extern volatile RPINR49BITS RPINR49bits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile uint16_t  RPOR0 __attribute__((__sfr__));
typedef struct tagRPOR0BITS {
  uint16_t RP32R:6;
  uint16_t :2;
  uint16_t RP33R:6;
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile uint16_t  RPOR1 __attribute__((__sfr__));
typedef struct tagRPOR1BITS {
  uint16_t RP34R:6;
  uint16_t :2;
  uint16_t RP35R:6;
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile uint16_t  RPOR2 __attribute__((__sfr__));
typedef struct tagRPOR2BITS {
  uint16_t RP36R:6;
  uint16_t :2;
  uint16_t RP37R:6;
} RPOR2BITS;
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t  RPOR3 __attribute__((__sfr__));
typedef struct tagRPOR3BITS {
  uint16_t RP38R:6;
  uint16_t :2;
  uint16_t RP39R:6;
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t  RPOR4 __attribute__((__sfr__));
typedef struct tagRPOR4BITS {
  uint16_t RP40R:6;
  uint16_t :2;
  uint16_t RP41R:6;
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t  RPOR5 __attribute__((__sfr__));
typedef struct tagRPOR5BITS {
  uint16_t RP42R:6;
  uint16_t :2;
  uint16_t RP43R:6;
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t  RPOR6 __attribute__((__sfr__));
typedef struct tagRPOR6BITS {
  uint16_t RP44R:6;
  uint16_t :2;
  uint16_t RP45R:6;
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t  RPOR7 __attribute__((__sfr__));
typedef struct tagRPOR7BITS {
  uint16_t RP46R:6;
  uint16_t :2;
  uint16_t RP47R:6;
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t  RPOR8 __attribute__((__sfr__));
typedef struct tagRPOR8BITS {
  uint16_t RP48R:6;
  uint16_t :2;
  uint16_t RP49R:6;
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t  RPOR9 __attribute__((__sfr__));
typedef struct tagRPOR9BITS {
  uint16_t RP50R:6;
  uint16_t :2;
  uint16_t RP51R:6;
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR10 RPOR10
extern volatile uint16_t  RPOR10 __attribute__((__sfr__));
typedef struct tagRPOR10BITS {
  uint16_t RP52R:6;
  uint16_t :2;
  uint16_t RP53R:6;
} RPOR10BITS;
extern volatile RPOR10BITS RPOR10bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t  RPOR11 __attribute__((__sfr__));
typedef struct tagRPOR11BITS {
  uint16_t RP54R:6;
  uint16_t :2;
  uint16_t RP55R:6;
} RPOR11BITS;
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t  RPOR12 __attribute__((__sfr__));
typedef struct tagRPOR12BITS {
  uint16_t RP56R:6;
  uint16_t :2;
  uint16_t RP57R:6;
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t  RPOR13 __attribute__((__sfr__));
typedef struct tagRPOR13BITS {
  uint16_t RP58R:6;
  uint16_t :2;
  uint16_t RP59R:6;
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t  RPOR14 __attribute__((__sfr__));
typedef struct tagRPOR14BITS {
  uint16_t RP60R:6;
  uint16_t :2;
  uint16_t RP61R:6;
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPOR15 RPOR15
extern volatile uint16_t  RPOR15 __attribute__((__sfr__));
typedef struct tagRPOR15BITS {
  uint16_t RP62R:6;
  uint16_t :2;
  uint16_t RP63R:6;
} RPOR15BITS;
extern volatile RPOR15BITS RPOR15bits __attribute__((__sfr__));

#define RPOR16 RPOR16
extern volatile uint16_t  RPOR16 __attribute__((__sfr__));
typedef struct tagRPOR16BITS {
  uint16_t RP64R:6;
  uint16_t :2;
  uint16_t RP65R:6;
} RPOR16BITS;
extern volatile RPOR16BITS RPOR16bits __attribute__((__sfr__));

