wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define PORTB PORTB
extern volatile uint16_t  PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  uint16_t RB0:1;
  uint16_t RB1:1;
  uint16_t RB2:1;
  uint16_t RB3:1;
  uint16_t RB4:1;
  uint16_t RB5:1;
  uint16_t RB6:1;
  uint16_t RB7:1;
  uint16_t RB8:1;
  uint16_t RB9:1;
  uint16_t RB10:1;
  uint16_t RB11:1;
  uint16_t RB12:1;
  uint16_t RB13:1;
  uint16_t RB14:1;
  uint16_t RB15:1;
} PORTBBITS;
extern volatile PORTBBITS PORTBbits __attribute__((__sfr__));

#define LATB LATB
extern volatile uint16_t  LATB __attribute__((__sfr__));
typedef struct tagLATBBITS {
  uint16_t LATB0:1;
  uint16_t LATB1:1;
  uint16_t LATB2:1;
  uint16_t LATB3:1;
  uint16_t LATB4:1;
  uint16_t LATB5:1;
  uint16_t LATB6:1;
  uint16_t LATB7:1;
  uint16_t LATB8:1;
  uint16_t LATB9:1;
  uint16_t LATB10:1;
  uint16_t LATB11:1;
  uint16_t LATB12:1;
  uint16_t LATB13:1;
  uint16_t LATB14:1;
  uint16_t LATB15:1;
} LATBBITS;
extern volatile LATBBITS LATBbits __attribute__((__sfr__));

#define ODCB ODCB
extern volatile uint16_t  ODCB __attribute__((__sfr__));
typedef struct tagODCBBITS {
  uint16_t ODCB0:1;
  uint16_t ODCB1:1;
  uint16_t ODCB2:1;
  uint16_t ODCB3:1;
  uint16_t ODCB4:1;
  uint16_t ODCB5:1;
  uint16_t ODCB6:1;
  uint16_t ODCB7:1;
  uint16_t ODCB8:1;
  uint16_t ODCB9:1;
  uint16_t ODCB10:1;
  uint16_t ODCB11:1;
  uint16_t ODCB12:1;
  uint16_t ODCB13:1;
  uint16_t ODCB14:1;
  uint16_t ODCB15:1;
} ODCBBITS;
extern volatile ODCBBITS ODCBbits __attribute__((__sfr__));

#define CNPUB CNPUB
extern volatile uint16_t  CNPUB __attribute__((__sfr__));
typedef struct tagCNPUBBITS {
  uint16_t CNPUB0:1;
  uint16_t CNPUB1:1;
  uint16_t CNPUB2:1;
  uint16_t CNPUB3:1;
  uint16_t CNPUB4:1;
  uint16_t CNPUB5:1;
  uint16_t CNPUB6:1;
  uint16_t CNPUB7:1;
  uint16_t CNPUB8:1;
  uint16_t CNPUB9:1;
  uint16_t CNPUB10:1;
  uint16_t CNPUB11:1;
  uint16_t CNPUB12:1;
  uint16_t CNPUB13:1;
  uint16_t CNPUB14:1;
  uint16_t CNPUB15:1;
} CNPUBBITS;
extern volatile CNPUBBITS CNPUBbits __attribute__((__sfr__));

#define CNPDB CNPDB
extern volatile uint16_t  CNPDB __attribute__((__sfr__));
typedef struct tagCNPDBBITS {
  uint16_t CNPDB0:1;
  uint16_t CNPDB1:1;
  uint16_t CNPDB2:1;
  uint16_t CNPDB3:1;
  uint16_t CNPDB4:1;
  uint16_t CNPDB5:1;
  uint16_t CNPDB6:1;
  uint16_t CNPDB7:1;
  uint16_t CNPDB8:1;
  uint16_t CNPDB9:1;
  uint16_t CNPDB10:1;
  uint16_t CNPDB11:1;
  uint16_t CNPDB12:1;
  uint16_t CNPDB13:1;
  uint16_t CNPDB14:1;
  uint16_t CNPDB15:1;
} CNPDBBITS;
extern volatile CNPDBBITS CNPDBbits __attribute__((__sfr__));

#define CNCONB CNCONB
extern volatile uint16_t  CNCONB __attribute__((__sfr__));
typedef struct tagCNCONBBITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONBBITS;
extern volatile CNCONBBITS CNCONBbits __attribute__((__sfr__));

#define CNEN0B CNEN0B
extern volatile uint16_t  CNEN0B __attribute__((__sfr__));
typedef struct tagCNEN0BBITS {
  uint16_t CNEN0B0:1;
  uint16_t CNEN0B1:1;
  uint16_t CNEN0B2:1;
  uint16_t CNEN0B3:1;
  uint16_t CNEN0B4:1;
  uint16_t CNEN0B5:1;
  uint16_t CNEN0B6:1;
  uint16_t CNEN0B7:1;
  uint16_t CNEN0B8:1;
  uint16_t CNEN0B9:1;
  uint16_t CNEN0B10:1;
  uint16_t CNEN0B11:1;
  uint16_t CNEN0B12:1;
  uint16_t CNEN0B13:1;
  uint16_t CNEN0B14:1;
  uint16_t CNEN0B15:1;
} CNEN0BBITS;
extern volatile CNEN0BBITS CNEN0Bbits __attribute__((__sfr__));

#define CNSTATB CNSTATB
extern volatile uint16_t  CNSTATB __attribute__((__sfr__));
typedef struct tagCNSTATBBITS {
  uint16_t CNSTATB0:1;
  uint16_t CNSTATB1:1;
  uint16_t CNSTATB2:1;
  uint16_t CNSTATB3:1;
  uint16_t CNSTATB4:1;
  uint16_t CNSTATB5:1;
  uint16_t CNSTATB6:1;
  uint16_t CNSTATB7:1;
  uint16_t CNSTATB8:1;
  uint16_t CNSTATB9:1;
  uint16_t CNSTATB10:1;
  uint16_t CNSTATB11:1;
  uint16_t CNSTATB12:1;
  uint16_t CNSTATB13:1;
  uint16_t CNSTATB14:1;
  uint16_t CNSTATB15:1;
} CNSTATBBITS;
extern volatile CNSTATBBITS CNSTATBbits __attribute__((__sfr__));

#define CNEN1B CNEN1B
extern volatile uint16_t  CNEN1B __attribute__((__sfr__));
typedef struct tagCNEN1BBITS {
  uint16_t CNEN1B0:1;
  uint16_t CNEN1B1:1;
  uint16_t CNEN1B2:1;
  uint16_t CNEN1B3:1;
  uint16_t CNEN1B4:1;
  uint16_t CNEN1B5:1;
  uint16_t CNEN1B6:1;
  uint16_t CNEN1B7:1;
  uint16_t CNEN1B8:1;
  uint16_t CNEN1B9:1;
  uint16_t CNEN1B10:1;
  uint16_t CNEN1B11:1;
  uint16_t CNEN1B12:1;
  uint16_t CNEN1B13:1;
  uint16_t CNEN1B14:1;
  uint16_t CNEN1B15:1;
} CNEN1BBITS;
extern volatile CNEN1BBITS CNEN1Bbits __attribute__((__sfr__));

#define CNFB CNFB
extern volatile uint16_t  CNFB __attribute__((__sfr__));
typedef struct tagCNFBBITS {
  uint16_t CNFB0:1;
  uint16_t CNFB1:1;
  uint16_t CNFB2:1;
  uint16_t CNFB3:1;
  uint16_t CNFB4:1;
  uint16_t CNFB5:1;
  uint16_t CNFB6:1;
  uint16_t CNFB7:1;
  uint16_t CNFB8:1;
  uint16_t CNFB9:1;
  uint16_t CNFB10:1;
  uint16_t CNFB11:1;
  uint16_t CNFB12:1;
  uint16_t CNFB13:1;
  uint16_t CNFB14:1;
  uint16_t CNFB15:1;
} CNFBBITS;
extern volatile CNFBBITS CNFBbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t  ANSELC __attribute__((__sfr__));
typedef struct tagANSELCBITS {
  uint16_t ANSELC0:1;
  uint16_t ANSELC1:1;
  uint16_t ANSELC2:1;
  uint16_t ANSELC3:1;
  uint16_t :2;
  uint16_t ANSELC6:1;
  uint16_t ANSELC7:1;
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define TRISC TRISC
extern volatile uint16_t  TRISC __attribute__((__sfr__));
typedef struct tagTRISCBITS {
  uint16_t TRISC0:1;
  uint16_t TRISC1:1;
  uint16_t TRISC2:1;
  uint16_t TRISC3:1;
  uint16_t TRISC4:1;
  uint16_t TRISC5:1;
  uint16_t TRISC6:1;
  uint16_t TRISC7:1;
  uint16_t TRISC8:1;
  uint16_t TRISC9:1;
  uint16_t TRISC10:1;
  uint16_t TRISC11:1;
  uint16_t TRISC12:1;
  uint16_t TRISC13:1;
  uint16_t TRISC14:1;
  uint16_t TRISC15:1;
} TRISCBITS;
extern volatile TRISCBITS TRISCbits __attribute__((__sfr__));

#define PORTC PORTC
extern volatile uint16_t  PORTC __attribute__((__sfr__));
typedef struct tagPORTCBITS {
  uint16_t RC0:1;
  uint16_t RC1:1;
  uint16_t RC2:1;
  uint16_t RC3:1;
  uint16_t RC4:1;
  uint16_t RC5:1;
  uint16_t RC6:1;
  uint16_t RC7:1;
  uint16_t RC8:1;
  uint16_t RC9:1;
  uint16_t RC10:1;
  uint16_t RC11:1;
  uint16_t RC12:1;
  uint16_t RC13:1;
  uint16_t RC14:1;
  uint16_t RC15:1;
} PORTCBITS;
