wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* CLC4GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

/* CLC4GLSH */
/* Bitname _G3D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4T cannot be defined because it is used by more than one SFR */

/* ECCCONL */
/* Bitname _FLTINJ cannot be defined because it is used by more than one SFR */

/* ECCCONH */
#define _FLT1PTR ECCCONHbits.FLT1PTR
#define _FTL2PTR ECCCONHbits.FTL2PTR

/* ECCSTATL */
#define _SECIN ECCSTATLbits.SECIN
#define _SECOUT ECCSTATLbits.SECOUT

/* ECCSTATH */
#define _SYND ECCSTATHbits.SYND
#define _DEDIN ECCSTATHbits.DEDIN
#define _DEDOUT ECCSTATHbits.DEDOUT

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TECS T1CONbits.TECS
#define _PRWIP T1CONbits.PRWIP
#define _TMWIP T1CONbits.TMWIP
#define _TMWDIS T1CONbits.TMWDIS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON

/* QEI1CON */
#define _CCM QEI1CONbits.CCM
#define _GATEN QEI1CONbits.GATEN
#define _CNTPOL QEI1CONbits.CNTPOL
#define _INTDIV QEI1CONbits.INTDIV
#define _IMV QEI1CONbits.IMV
#define _PIMOD QEI1CONbits.PIMOD
#define _QEISIDL QEI1CONbits.QEISIDL
#define _QEIEN QEI1CONbits.QEIEN

/* QEI1IOC */
/* Bitname _QEA cannot be defined because it is used by more than one SFR */
/* Bitname _QEB cannot be defined because it is used by more than one SFR */
/* Bitname _INDEX cannot be defined because it is used by more than one SFR */
/* Bitname _HOME cannot be defined because it is used by more than one SFR */
/* Bitname _QEAPOL cannot be defined because it is used by more than one SFR */
/* Bitname _QEBPOL cannot be defined because it is used by more than one SFR */
/* Bitname _IDXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _HOMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SWPAB cannot be defined because it is used by more than one SFR */
/* Bitname _OUTFNC cannot be defined because it is used by more than one SFR */
/* Bitname _QFDIV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _QCAPEN cannot be defined because it is used by more than one SFR */

/* QEI1IOCH */
/* Bitname _HCAPEN cannot be defined because it is used by more than one SFR */

/* QEI1STAT */
/* Bitname _IDXIEN cannot be defined because it is used by more than one SFR */
/* Bitname _IDXIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIEN cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIRQ cannot be defined because it is used by more than one SFR */

/* QEI2CON */
/* Bitname _CCM cannot be defined because it is used by more than one SFR */
/* Bitname _GATEN cannot be defined because it is used by more than one SFR */
/* Bitname _CNTPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INTDIV cannot be defined because it is used by more than one SFR */
/* Bitname _IMV cannot be defined because it is used by more than one SFR */
/* Bitname _PIMOD cannot be defined because it is used by more than one SFR */
/* Bitname _QEISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _QEIEN cannot be defined because it is used by more than one SFR */

/* QEI2IOC */
/* Bitname _QEA cannot be defined because it is used by more than one SFR */
/* Bitname _QEB cannot be defined because it is used by more than one SFR */
/* Bitname _INDEX cannot be defined because it is used by more than one SFR */
/* Bitname _HOME cannot be defined because it is used by more than one SFR */
/* Bitname _QEAPOL cannot be defined because it is used by more than one SFR */
/* Bitname _QEBPOL cannot be defined because it is used by more than one SFR */
/* Bitname _IDXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _HOMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SWPAB cannot be defined because it is used by more than one SFR */
/* Bitname _OUTFNC cannot be defined because it is used by more than one SFR */
/* Bitname _QFDIV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _QCAPEN cannot be defined because it is used by more than one SFR */

/* QEI2IOCH */
/* Bitname _HCAPEN cannot be defined because it is used by more than one SFR */

