wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* QEI2STAT */
/* Bitname _IDXIEN cannot be defined because it is used by more than one SFR */
/* Bitname _IDXIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIEN cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIRQ cannot be defined because it is used by more than one SFR */

/* PMCON */
#define _RDSP PMCONbits.RDSP
#define _WRSP PMCONbits.WRSP
#define _CS1P PMCONbits.CS1P
#define _CS2P PMCONbits.CS2P
#define _ALP PMCONbits.ALP
#define _CSF PMCONbits.CSF
#define _PTRDEN PMCONbits.PTRDEN
#define _PTWREN PMCONbits.PTWREN
#define _PMPTTL PMCONbits.PMPTTL
#define _ADRMUX PMCONbits.ADRMUX
/* Bitname _SIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */
#define _CSF0 PMCONbits.CSF0
#define _CSF1 PMCONbits.CSF1
#define _ADRMUX0 PMCONbits.ADRMUX0
#define _ADRMUX1 PMCONbits.ADRMUX1
#define _PSIDL PMCONbits.PSIDL
#define _PMPEN PMCONbits.PMPEN

/* PMCONH */
#define _DUALBUF PMCONHbits.DUALBUF
#define _RDSTART PMCONHbits.RDSTART

/* PMMODE */
#define _WAITE PMMODEbits.WAITE
#define _WAITM PMMODEbits.WAITM
#define _WAITB PMMODEbits.WAITB
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
#define _INCM PMMODEbits.INCM
/* Bitname _IRQM cannot be defined because it is used by more than one SFR */
/* Bitname _BUSY cannot be defined because it is used by more than one SFR */
#define _WAITE0 PMMODEbits.WAITE0
#define _WAITE1 PMMODEbits.WAITE1
#define _WAITM0 PMMODEbits.WAITM0
#define _WAITM1 PMMODEbits.WAITM1
#define _WAITM2 PMMODEbits.WAITM2
#define _WAITM3 PMMODEbits.WAITM3
#define _WAITB0 PMMODEbits.WAITB0
#define _WAITB1 PMMODEbits.WAITB1
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
#define _INCM0 PMMODEbits.INCM0
#define _INCM1 PMMODEbits.INCM1
/* Bitname _IRQM0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM1 cannot be defined because it is used by more than one SFR */

/* PMADDR */
#define _ADDR PMADDRbits.ADDR
#define _ADDR14 PMADDRbits.ADDR14
#define _ADDR15 PMADDRbits.ADDR15
#define _CS PMADDRbits.CS
#define _CS1 PMADDRbits.CS1
#define _CS2 PMADDRbits.CS2

/* PMAEN */
#define _PTEN0 PMAENbits.PTEN0
#define _PTEN1 PMAENbits.PTEN1
#define _PTEN2 PMAENbits.PTEN2
#define _PTEN3 PMAENbits.PTEN3
#define _PTEN4 PMAENbits.PTEN4
#define _PTEN5 PMAENbits.PTEN5
#define _PTEN6 PMAENbits.PTEN6
#define _PTEN7 PMAENbits.PTEN7
#define _PTEN8 PMAENbits.PTEN8
#define _PTEN9 PMAENbits.PTEN9
#define _PTEN10 PMAENbits.PTEN10
#define _PTEN11 PMAENbits.PTEN11
#define _PTEN12 PMAENbits.PTEN12
#define _PTEN13 PMAENbits.PTEN13
#define _PTEN14 PMAENbits.PTEN14
#define _PTEN15 PMAENbits.PTEN15
#define _PTEN PMAENbits.PTEN

/* PMSTAT */
#define _OB0E PMSTATbits.OB0E
#define _OB1E PMSTATbits.OB1E
#define _OB2E PMSTATbits.OB2E
#define _OB3E PMSTATbits.OB3E
#define _OBUF PMSTATbits.OBUF
#define _OBE PMSTATbits.OBE
#define _IB0F PMSTATbits.IB0F
#define _IB1F PMSTATbits.IB1F
#define _IB2F PMSTATbits.IB2F
#define _IB3F PMSTATbits.IB3F
#define _IBOV PMSTATbits.IBOV
#define _IBF PMSTATbits.IBF

/* PMWADDR */
#define _WADDR PMWADDRbits.WADDR
#define _WADDR14 PMWADDRbits.WADDR14
#define _WADDR15 PMWADDRbits.WADDR15
#define _WCS PMWADDRbits.WCS
#define _WCS1 PMWADDRbits.WCS1
#define _WCS2 PMWADDRbits.WCS2

/* PMRADDR */
#define _RADDR PMRADDRbits.RADDR
#define _RADDR14 PMRADDRbits.RADDR14
#define _RADDR15 PMRADDRbits.RADDR15
#define _RCS PMRADDRbits.RCS
#define _RCS1 PMRADDRbits.RCS1
#define _RCS2 PMRADDRbits.RCS2

/* I2C1CON1 */
/* Bitname _SEN cannot be defined because it is used by more than one SFR */
/* Bitname _RSEN cannot be defined because it is used by more than one SFR */
/* Bitname _PEN cannot be defined because it is used by more than one SFR */
/* Bitname _RCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKDT cannot be defined because it is used by more than one SFR */
/* Bitname _STREN cannot be defined because it is used by more than one SFR */
/* Bitname _GCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SMEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSLW cannot be defined because it is used by more than one SFR */
/* Bitname _A10M cannot be defined because it is used by more than one SFR */
/* Bitname _STRICT cannot be defined because it is used by more than one SFR */
/* Bitname _SCLREL cannot be defined because it is used by more than one SFR */
/* Bitname _I2CSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _I2CEN cannot be defined because it is used by more than one SFR */

/* I2C1CON2 */
/* Bitname _DHEN cannot be defined because it is used by more than one SFR */
/* Bitname _AHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SBCDE cannot be defined because it is used by more than one SFR */
/* Bitname _SDAHT cannot be defined because it is used by more than one SFR */
/* Bitname _BOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SCIE cannot be defined because it is used by more than one SFR */
/* Bitname _PCIE cannot be defined because it is used by more than one SFR */

/* I2C1STAT */
/* Bitname _TBF cannot be defined because it is used by more than one SFR */
/* Bitname _RBF cannot be defined because it is used by more than one SFR */
/* Bitname _R_W cannot be defined because it is used by more than one SFR */
/* Bitname _S cannot be defined because it is used by more than one SFR */
/* Bitname _P cannot be defined because it is used by more than one SFR */
/* Bitname _D_A cannot be defined because it is used by more than one SFR */
/* Bitname _I2COV cannot be defined because it is used by more than one SFR */
/* Bitname _IWCOL cannot be defined because it is used by more than one SFR */
/* Bitname _ADD10 cannot be defined because it is used by more than one SFR */
/* Bitname _GCSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _BCL cannot be defined because it is used by more than one SFR */
/* Bitname _ACKTIM cannot be defined because it is used by more than one SFR */
/* Bitname _TRSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _ACKSTAT cannot be defined because it is used by more than one SFR */

/* I2C1ADD */
/* Bitname _ADD cannot be defined because it is used by more than one SFR */

/* I2C1MSK */
/* Bitname _AMSK cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK6 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK7 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK8 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK9 cannot be defined because it is used by more than one SFR */

/* I2C1TRN */
/* Bitname _I2CTXDATA cannot be defined because it is used by more than one SFR */

