wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* U1STA */
/* Bitname _TXCIF cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _RXBKIF cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _CERIF cannot be defined because it is used by more than one SFR */
/* Bitname _ABDOVF cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _TXCIE cannot be defined because it is used by more than one SFR */
/* Bitname _OERIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXBKIE cannot be defined because it is used by more than one SFR */
/* Bitname _FERIE cannot be defined because it is used by more than one SFR */
/* Bitname _CERIE cannot be defined because it is used by more than one SFR */
/* Bitname _ABDOVE cannot be defined because it is used by more than one SFR */
/* Bitname _PERIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXMTIE cannot be defined because it is used by more than one SFR */

/* U1STAH */
/* Bitname _URXBF cannot be defined because it is used by more than one SFR */
/* Bitname _URXBE cannot be defined because it is used by more than one SFR */
/* Bitname _XON cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBE cannot be defined because it is used by more than one SFR */
/* Bitname _STPMD cannot be defined because it is used by more than one SFR */
/* Bitname _TXWRE cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL2 cannot be defined because it is used by more than one SFR */

/* U1BRG */
/* Bitname _BRG cannot be defined because it is used by more than one SFR */
/* Bitname _BRG0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG5 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG6 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG7 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG8 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG9 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG10 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG11 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG12 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG13 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG14 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG15 cannot be defined because it is used by more than one SFR */

/* U1BRGH */
/* Bitname _BRG cannot be defined because it is used by more than one SFR */
/* Bitname _BRG16 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG18 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG19 cannot be defined because it is used by more than one SFR */

/* U1RXREG */
/* Bitname _RXREG cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG7 cannot be defined because it is used by more than one SFR */

/* U1TXREG */
/* Bitname _TXREG cannot be defined because it is used by more than one SFR */
/* Bitname _LAST cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG7 cannot be defined because it is used by more than one SFR */

/* U1P1 */
/* Bitname _P1 cannot be defined because it is used by more than one SFR */
/* Bitname _P10 cannot be defined because it is used by more than one SFR */
/* Bitname _P11 cannot be defined because it is used by more than one SFR */
/* Bitname _P12 cannot be defined because it is used by more than one SFR */
/* Bitname _P13 cannot be defined because it is used by more than one SFR */
/* Bitname _P14 cannot be defined because it is used by more than one SFR */
/* Bitname _P15 cannot be defined because it is used by more than one SFR */
/* Bitname _P16 cannot be defined because it is used by more than one SFR */
/* Bitname _P17 cannot be defined because it is used by more than one SFR */
/* Bitname _P18 cannot be defined because it is used by more than one SFR */

