wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* SPI3CON1H */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

/* SPI3CON2 */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

/* SPI3CON2L */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI3CON3 */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI3STATL */
/* Bitname _SPIRBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROV cannot be defined because it is used by more than one SFR */
/* Bitname _SRMT cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUR cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */

/* SPI3STATH */
/* Bitname _TXELM cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM5 cannot be defined because it is used by more than one SFR */

/* SPI3BUFL */
#define _SPI3BUFL SPI3BUFLbits.SPI3BUFL
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI3BUFH */
#define _SPI3BUFH SPI3BUFHbits.SPI3BUFH
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI3BRGL */
#define _SPI3BRGL SPI3BRGLbits.SPI3BRGL
/* Bitname _BRG cannot be defined because it is used by more than one SFR */

/* SPI3IMSK1 */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI3IMSKL */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI3IMSK2 */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI3IMSKH */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI3URDTL */
#define _SPI3URDTL SPI3URDTLbits.SPI3URDTL
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI3URDTH */
#define _SPI3URDTH SPI3URDTHbits.SPI3URDTH
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* PCLKCON */
#define _MCLKSEL PCLKCONbits.MCLKSEL
#define _DIVSEL PCLKCONbits.DIVSEL
/* Bitname _LOCK cannot be defined because it is used by more than one SFR */
#define _HRERR PCLKCONbits.HRERR
#define _HRRDY PCLKCONbits.HRRDY

/* LFSR */
#define _LFSR LFSRbits.LFSR

/* CMBTRIGL */
#define _CTA1EN CMBTRIGLbits.CTA1EN
#define _CTA2EN CMBTRIGLbits.CTA2EN
#define _CTA3EN CMBTRIGLbits.CTA3EN
#define _CTA4EN CMBTRIGLbits.CTA4EN
#define _CTA5EN CMBTRIGLbits.CTA5EN
#define _CTA6EN CMBTRIGLbits.CTA6EN
#define _CTA7EN CMBTRIGLbits.CTA7EN
#define _CTA8EN CMBTRIGLbits.CTA8EN

/* CMBTRIGH */
#define _CTB1EN CMBTRIGHbits.CTB1EN
#define _CTB2EN CMBTRIGHbits.CTB2EN
#define _CTB3EN CMBTRIGHbits.CTB3EN
#define _CTB4EN CMBTRIGHbits.CTB4EN
#define _CTB5EN CMBTRIGHbits.CTB5EN
#define _CTB6EN CMBTRIGHbits.CTB6EN
#define _CTB7EN CMBTRIGHbits.CTB7EN
#define _CTB8EN CMBTRIGHbits.CTB8EN

