wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* PG2SPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG2LEBH */
/* Bitname _PLF cannot be defined because it is used by more than one SFR */
/* Bitname _PLR cannot be defined because it is used by more than one SFR */
/* Bitname _PHF cannot be defined because it is used by more than one SFR */
/* Bitname _PHR cannot be defined because it is used by more than one SFR */
/* Bitname _PWMPCI cannot be defined because it is used by more than one SFR */

/* PG2DCA */
/* Bitname _DCA cannot be defined because it is used by more than one SFR */

/* PG2DTL */
/* Bitname _DTL cannot be defined because it is used by more than one SFR */

/* PG2DTH */
/* Bitname _DTH cannot be defined because it is used by more than one SFR */

/* PG3CONL */
/* Bitname _MODSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HREN cannot be defined because it is used by more than one SFR */
/* Bitname _TRGCNT cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* PG3CONH */
/* Bitname _SOCS cannot be defined because it is used by more than one SFR */
/* Bitname _TRGMOD cannot be defined because it is used by more than one SFR */
/* Bitname _UPDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _MPHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _MPERSEL cannot be defined because it is used by more than one SFR */
/* Bitname _MDCSEL cannot be defined because it is used by more than one SFR */

/* PG3STAT */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */
/* Bitname _CAHALF cannot be defined because it is used by more than one SFR */
/* Bitname _STEER cannot be defined because it is used by more than one SFR */
/* Bitname _UPDREQ cannot be defined because it is used by more than one SFR */
/* Bitname _UPDATE cannot be defined because it is used by more than one SFR */
/* Bitname _CAP cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _FFACT cannot be defined because it is used by more than one SFR */
/* Bitname _CLACT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTACT cannot be defined because it is used by more than one SFR */
/* Bitname _SACT cannot be defined because it is used by more than one SFR */
/* Bitname _FFEVT cannot be defined because it is used by more than one SFR */
/* Bitname _CLEVT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEVT cannot be defined because it is used by more than one SFR */
/* Bitname _SEVT cannot be defined because it is used by more than one SFR */

/* PG3IOCONL */
/* Bitname _DBDAT cannot be defined because it is used by more than one SFR */
/* Bitname _FFDAT cannot be defined because it is used by more than one SFR */
/* Bitname _CLDAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTDAT cannot be defined because it is used by more than one SFR */
/* Bitname _OSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _OVRDAT cannot be defined because it is used by more than one SFR */
/* Bitname _OVRENL cannot be defined because it is used by more than one SFR */
/* Bitname _OVRENH cannot be defined because it is used by more than one SFR */
/* Bitname _SWAP cannot be defined because it is used by more than one SFR */
/* Bitname _CLMOD cannot be defined because it is used by more than one SFR */

/* PG3IOCONH */
/* Bitname _POLL cannot be defined because it is used by more than one SFR */
/* Bitname _POLH cannot be defined because it is used by more than one SFR */
/* Bitname _PENL cannot be defined because it is used by more than one SFR */
/* Bitname _PENH cannot be defined because it is used by more than one SFR */
/* Bitname _PMOD cannot be defined because it is used by more than one SFR */
/* Bitname _DTCMPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CAPSRC cannot be defined because it is used by more than one SFR */

/* PG3EVTL */
/* Bitname _PGTRGSEL cannot be defined because it is used by more than one SFR */
/* Bitname _UPDTRG cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1PS cannot be defined because it is used by more than one SFR */

/* PG3EVTH */
/* Bitname _ADTR1OFS cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _IEVTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FFIEN cannot be defined because it is used by more than one SFR */
/* Bitname _CLIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTIEN cannot be defined because it is used by more than one SFR */

/* PG3FPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

