wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* PG4IOCONL */
/* Bitname _DBDAT cannot be defined because it is used by more than one SFR */
/* Bitname _FFDAT cannot be defined because it is used by more than one SFR */
/* Bitname _CLDAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTDAT cannot be defined because it is used by more than one SFR */
/* Bitname _OSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _OVRDAT cannot be defined because it is used by more than one SFR */
/* Bitname _OVRENL cannot be defined because it is used by more than one SFR */
/* Bitname _OVRENH cannot be defined because it is used by more than one SFR */
/* Bitname _SWAP cannot be defined because it is used by more than one SFR */
/* Bitname _CLMOD cannot be defined because it is used by more than one SFR */

/* PG4IOCONH */
/* Bitname _POLL cannot be defined because it is used by more than one SFR */
/* Bitname _POLH cannot be defined because it is used by more than one SFR */
/* Bitname _PENL cannot be defined because it is used by more than one SFR */
/* Bitname _PENH cannot be defined because it is used by more than one SFR */
/* Bitname _PMOD cannot be defined because it is used by more than one SFR */
/* Bitname _DTCMPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CAPSRC cannot be defined because it is used by more than one SFR */

/* PG4EVTL */
/* Bitname _PGTRGSEL cannot be defined because it is used by more than one SFR */
/* Bitname _UPDTRG cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1PS cannot be defined because it is used by more than one SFR */

/* PG4EVTH */
/* Bitname _ADTR1OFS cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _IEVTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FFIEN cannot be defined because it is used by more than one SFR */
/* Bitname _CLIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTIEN cannot be defined because it is used by more than one SFR */

/* PG4FPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG4FPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG4CLPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG4CLPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG4FFPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG4FFPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG4SPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG4SPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG4LEBH */
/* Bitname _PLF cannot be defined because it is used by more than one SFR */
/* Bitname _PLR cannot be defined because it is used by more than one SFR */
/* Bitname _PHF cannot be defined because it is used by more than one SFR */
/* Bitname _PHR cannot be defined because it is used by more than one SFR */
/* Bitname _PWMPCI cannot be defined because it is used by more than one SFR */

