wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* PG6EVTH */
/* Bitname _ADTR1OFS cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _IEVTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FFIEN cannot be defined because it is used by more than one SFR */
/* Bitname _CLIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTIEN cannot be defined because it is used by more than one SFR */

/* PG6FPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG6FPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG6CLPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG6CLPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG6FFPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG6FFPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG6SPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG6SPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */

/* PG6LEBH */
/* Bitname _PLF cannot be defined because it is used by more than one SFR */
/* Bitname _PLR cannot be defined because it is used by more than one SFR */
/* Bitname _PHF cannot be defined because it is used by more than one SFR */
/* Bitname _PHR cannot be defined because it is used by more than one SFR */
/* Bitname _PWMPCI cannot be defined because it is used by more than one SFR */

/* PG6DCA */
/* Bitname _DCA cannot be defined because it is used by more than one SFR */

/* PG6DTL */
/* Bitname _DTL cannot be defined because it is used by more than one SFR */

/* PG6DTH */
/* Bitname _DTH cannot be defined because it is used by more than one SFR */

/* PG7CONL */
/* Bitname _MODSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HREN cannot be defined because it is used by more than one SFR */
/* Bitname _TRGCNT cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

