wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* C1TDCH */
#define _TDCMOD C1TDCHbits.TDCMOD
#define _SID11EN C1TDCHbits.SID11EN
#define _EDGFLTEN C1TDCHbits.EDGFLTEN
#define _TDCMOD0 C1TDCHbits.TDCMOD0
#define _TDCMOD1 C1TDCHbits.TDCMOD1

/* C1TBCL */
#define _TBC0 C1TBCLbits.TBC0
#define _TBC1 C1TBCLbits.TBC1
#define _TBC2 C1TBCLbits.TBC2
#define _TBC3 C1TBCLbits.TBC3
#define _TBC4 C1TBCLbits.TBC4
#define _TBC5 C1TBCLbits.TBC5
#define _TBC6 C1TBCLbits.TBC6
#define _TBC7 C1TBCLbits.TBC7
#define _TBC8 C1TBCLbits.TBC8
#define _TBC9 C1TBCLbits.TBC9
#define _TBC10 C1TBCLbits.TBC10
#define _TBC11 C1TBCLbits.TBC11
#define _TBC12 C1TBCLbits.TBC12
#define _TBC13 C1TBCLbits.TBC13
#define _TBC14 C1TBCLbits.TBC14
#define _TBC15 C1TBCLbits.TBC15

/* C1TBCH */
#define _TBC16 C1TBCHbits.TBC16
#define _TBC17 C1TBCHbits.TBC17
#define _TBC18 C1TBCHbits.TBC18
#define _TBC19 C1TBCHbits.TBC19
#define _TBC20 C1TBCHbits.TBC20
#define _TBC21 C1TBCHbits.TBC21
#define _TBC22 C1TBCHbits.TBC22
#define _TBC23 C1TBCHbits.TBC23
#define _TBC24 C1TBCHbits.TBC24
#define _TBC25 C1TBCHbits.TBC25
#define _TBC26 C1TBCHbits.TBC26
#define _TBC27 C1TBCHbits.TBC27
#define _TBC28 C1TBCHbits.TBC28
#define _TBC29 C1TBCHbits.TBC29
#define _TBC30 C1TBCHbits.TBC30
#define _TBC31 C1TBCHbits.TBC31

/* C1TSCONL */
#define _TBCPRE C1TSCONLbits.TBCPRE
#define _TBCPRE0 C1TSCONLbits.TBCPRE0
#define _TBCPRE1 C1TSCONLbits.TBCPRE1
#define _TBCPRE2 C1TSCONLbits.TBCPRE2
#define _TBCPRE3 C1TSCONLbits.TBCPRE3
#define _TBCPRE4 C1TSCONLbits.TBCPRE4
#define _TBCPRE5 C1TSCONLbits.TBCPRE5
#define _TBCPRE6 C1TSCONLbits.TBCPRE6
#define _TBCPRE7 C1TSCONLbits.TBCPRE7
#define _TBCPRE8 C1TSCONLbits.TBCPRE8
#define _TBCPRE9 C1TSCONLbits.TBCPRE9

/* C1TSCONH */
#define _TBCEN C1TSCONHbits.TBCEN
#define _TSEOF C1TSCONHbits.TSEOF
#define _TSRES C1TSCONHbits.TSRES

/* C1VECL */
#define _ICODE C1VECLbits.ICODE
#define _FILHIT C1VECLbits.FILHIT
#define _ICODE0 C1VECLbits.ICODE0
#define _ICODE1 C1VECLbits.ICODE1
#define _ICODE2 C1VECLbits.ICODE2
#define _ICODE3 C1VECLbits.ICODE3
#define _ICODE4 C1VECLbits.ICODE4
#define _ICODE5 C1VECLbits.ICODE5
#define _ICODE6 C1VECLbits.ICODE6
#define _FILHIT0 C1VECLbits.FILHIT0
#define _FILHIT1 C1VECLbits.FILHIT1
#define _FILHIT2 C1VECLbits.FILHIT2
#define _FILHIT3 C1VECLbits.FILHIT3
#define _FILHIT4 C1VECLbits.FILHIT4

/* C1VECH */
#define _TXCODE C1VECHbits.TXCODE
#define _RXCODE C1VECHbits.RXCODE
#define _TXCODE0 C1VECHbits.TXCODE0
#define _TXCODE1 C1VECHbits.TXCODE1
#define _TXCODE2 C1VECHbits.TXCODE2
#define _TXCODE3 C1VECHbits.TXCODE3
#define _TXCODE4 C1VECHbits.TXCODE4
#define _TXCODE5 C1VECHbits.TXCODE5
#define _TXCODE6 C1VECHbits.TXCODE6
#define _RXCODE0 C1VECHbits.RXCODE0
#define _RXCODE1 C1VECHbits.RXCODE1
#define _RXCODE2 C1VECHbits.RXCODE2
#define _RXCODE3 C1VECHbits.RXCODE3
#define _RXCODE4 C1VECHbits.RXCODE4
#define _RXCODE5 C1VECHbits.RXCODE5
#define _RXCODE6 C1VECHbits.RXCODE6

/* C1INTL */
#define _TXIF C1INTLbits.TXIF
#define _RXIF C1INTLbits.RXIF
#define _TBCIF C1INTLbits.TBCIF
#define _MODIF C1INTLbits.MODIF
#define _TEFIF C1INTLbits.TEFIF
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIF cannot be defined because it is used by more than one SFR */
#define _SERRIF C1INTLbits.SERRIF
#define _CERRIF C1INTLbits.CERRIF
#define _WAKIF C1INTLbits.WAKIF
#define _IVMIF C1INTLbits.IVMIF

/* C1INTH */
#define _TXIE C1INTHbits.TXIE
#define _RXIE C1INTHbits.RXIE
#define _TBCIE C1INTHbits.TBCIE
#define _MODIE C1INTHbits.MODIE
#define _TEFIE C1INTHbits.TEFIE
/* Bitname _TXATIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIE cannot be defined because it is used by more than one SFR */
#define _SERRIE C1INTHbits.SERRIE
#define _CERRIE C1INTHbits.CERRIE
#define _WAKIE C1INTHbits.WAKIE
#define _IVMIE C1INTHbits.IVMIE

/* C1RXIFL */
#define _RFIF1 C1RXIFLbits.RFIF1
#define _RFIF2 C1RXIFLbits.RFIF2
#define _RFIF3 C1RXIFLbits.RFIF3
#define _RFIF4 C1RXIFLbits.RFIF4
#define _RFIF5 C1RXIFLbits.RFIF5
#define _RFIF6 C1RXIFLbits.RFIF6
#define _RFIF7 C1RXIFLbits.RFIF7
#define _RFIF8 C1RXIFLbits.RFIF8
#define _RFIF9 C1RXIFLbits.RFIF9
#define _RFIF10 C1RXIFLbits.RFIF10
#define _RFIF11 C1RXIFLbits.RFIF11
#define _RFIF12 C1RXIFLbits.RFIF12
#define _RFIF13 C1RXIFLbits.RFIF13
#define _RFIF14 C1RXIFLbits.RFIF14
#define _RFIF15 C1RXIFLbits.RFIF15

/* C1RXIFH */
#define _RFIF16 C1RXIFHbits.RFIF16
#define _RFIF17 C1RXIFHbits.RFIF17
#define _RFIF18 C1RXIFHbits.RFIF18
#define _RFIF19 C1RXIFHbits.RFIF19
#define _RFIF20 C1RXIFHbits.RFIF20
#define _RFIF21 C1RXIFHbits.RFIF21
#define _RFIF22 C1RXIFHbits.RFIF22
#define _RFIF23 C1RXIFHbits.RFIF23
#define _RFIF24 C1RXIFHbits.RFIF24
#define _RFIF25 C1RXIFHbits.RFIF25
#define _RFIF26 C1RXIFHbits.RFIF26
#define _RFIF27 C1RXIFHbits.RFIF27
#define _RFIF28 C1RXIFHbits.RFIF28
#define _RFIF29 C1RXIFHbits.RFIF29
#define _RFIF30 C1RXIFHbits.RFIF30
#define _RFIF31 C1RXIFHbits.RFIF31

/* C1TXIFL */
#define _TFIF0 C1TXIFLbits.TFIF0
#define _TFIF1 C1TXIFLbits.TFIF1
#define _TFIF2 C1TXIFLbits.TFIF2
#define _TFIF3 C1TXIFLbits.TFIF3
#define _TFIF4 C1TXIFLbits.TFIF4
#define _TFIF5 C1TXIFLbits.TFIF5
#define _TFIF6 C1TXIFLbits.TFIF6
#define _TFIF7 C1TXIFLbits.TFIF7
#define _TFIF8 C1TXIFLbits.TFIF8
#define _TFIF9 C1TXIFLbits.TFIF9
#define _TFIF10 C1TXIFLbits.TFIF10
#define _TFIF11 C1TXIFLbits.TFIF11
#define _TFIF12 C1TXIFLbits.TFIF12
#define _TFIF13 C1TXIFLbits.TFIF13
#define _TFIF14 C1TXIFLbits.TFIF14
#define _TFIF15 C1TXIFLbits.TFIF15

/* C1TXIFH */
#define _TFIF16 C1TXIFHbits.TFIF16
#define _TFIF17 C1TXIFHbits.TFIF17
#define _TFIF18 C1TXIFHbits.TFIF18
#define _TFIF19 C1TXIFHbits.TFIF19
#define _TFIF20 C1TXIFHbits.TFIF20
#define _TFIF21 C1TXIFHbits.TFIF21
#define _TFIF22 C1TXIFHbits.TFIF22
#define _TFIF23 C1TXIFHbits.TFIF23
#define _TFIF24 C1TXIFHbits.TFIF24
#define _TFIF25 C1TXIFHbits.TFIF25
#define _TFIF26 C1TXIFHbits.TFIF26
#define _TFIF27 C1TXIFHbits.TFIF27
#define _TFIF28 C1TXIFHbits.TFIF28
#define _TFIF29 C1TXIFHbits.TFIF29
#define _TFIF30 C1TXIFHbits.TFIF30
#define _TFIF31 C1TXIFHbits.TFIF31

