wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* C1RXOVIFL */
#define _RFOVIF1 C1RXOVIFLbits.RFOVIF1
#define _RFOVIF2 C1RXOVIFLbits.RFOVIF2
#define _RFOVIF3 C1RXOVIFLbits.RFOVIF3
#define _RFOVIF4 C1RXOVIFLbits.RFOVIF4
#define _RFOVIF5 C1RXOVIFLbits.RFOVIF5
#define _RFOVIF6 C1RXOVIFLbits.RFOVIF6
#define _RFOVIF7 C1RXOVIFLbits.RFOVIF7
#define _RFOVIF8 C1RXOVIFLbits.RFOVIF8
#define _RFOVIF9 C1RXOVIFLbits.RFOVIF9
#define _RFOVIF10 C1RXOVIFLbits.RFOVIF10
#define _RFOVIF11 C1RXOVIFLbits.RFOVIF11
#define _RFOVIF12 C1RXOVIFLbits.RFOVIF12
#define _RFOVIF13 C1RXOVIFLbits.RFOVIF13
#define _RFOVIF14 C1RXOVIFLbits.RFOVIF14
#define _RFOVIF15 C1RXOVIFLbits.RFOVIF15

/* C1RXOVIFH */
#define _RFOVIF16 C1RXOVIFHbits.RFOVIF16
#define _RFOVIF17 C1RXOVIFHbits.RFOVIF17
#define _RFOVIF18 C1RXOVIFHbits.RFOVIF18
#define _RFOVIF19 C1RXOVIFHbits.RFOVIF19
#define _RFOVIF20 C1RXOVIFHbits.RFOVIF20
#define _RFOVIF21 C1RXOVIFHbits.RFOVIF21
#define _RFOVIF22 C1RXOVIFHbits.RFOVIF22
#define _RFOVIF23 C1RXOVIFHbits.RFOVIF23
#define _RFOVIF24 C1RXOVIFHbits.RFOVIF24
#define _RFOVIF25 C1RXOVIFHbits.RFOVIF25
#define _RFOVIF26 C1RXOVIFHbits.RFOVIF26
#define _RFOVIF27 C1RXOVIFHbits.RFOVIF27
#define _RFOVIF28 C1RXOVIFHbits.RFOVIF28
#define _RFOVIF29 C1RXOVIFHbits.RFOVIF29
#define _RFOVIF30 C1RXOVIFHbits.RFOVIF30
#define _RFOVIF31 C1RXOVIFHbits.RFOVIF31

/* C1TXATIFL */
#define _TFATIF0 C1TXATIFLbits.TFATIF0
#define _TFATIF1 C1TXATIFLbits.TFATIF1
#define _TFATIF2 C1TXATIFLbits.TFATIF2
#define _TFATIF3 C1TXATIFLbits.TFATIF3
#define _TFATIF4 C1TXATIFLbits.TFATIF4
#define _TFATIF5 C1TXATIFLbits.TFATIF5
#define _TFATIF6 C1TXATIFLbits.TFATIF6
#define _TFATIF7 C1TXATIFLbits.TFATIF7
#define _TFATIF8 C1TXATIFLbits.TFATIF8
#define _TFATIF9 C1TXATIFLbits.TFATIF9
#define _TFATIF10 C1TXATIFLbits.TFATIF10
#define _TFATIF11 C1TXATIFLbits.TFATIF11
#define _TFATIF12 C1TXATIFLbits.TFATIF12
#define _TFATIF13 C1TXATIFLbits.TFATIF13
#define _TFATIF14 C1TXATIFLbits.TFATIF14
#define _TFATIF15 C1TXATIFLbits.TFATIF15

/* C1TXATIFH */
#define _TFATIF16 C1TXATIFHbits.TFATIF16
#define _TFATIF17 C1TXATIFHbits.TFATIF17
#define _TFATIF18 C1TXATIFHbits.TFATIF18
#define _TFATIF19 C1TXATIFHbits.TFATIF19
#define _TFATIF20 C1TXATIFHbits.TFATIF20
#define _TFATIF21 C1TXATIFHbits.TFATIF21
#define _TFATIF22 C1TXATIFHbits.TFATIF22
#define _TFATIF23 C1TXATIFHbits.TFATIF23
#define _TFATIF24 C1TXATIFHbits.TFATIF24
#define _TFATIF25 C1TXATIFHbits.TFATIF25
#define _TFATIF26 C1TXATIFHbits.TFATIF26
#define _TFATIF27 C1TXATIFHbits.TFATIF27
#define _TFATIF28 C1TXATIFHbits.TFATIF28
#define _TFATIF29 C1TXATIFHbits.TFATIF29
#define _TFATIF30 C1TXATIFHbits.TFATIF30
#define _TFATIF31 C1TXATIFHbits.TFATIF31

/* C1TXREQL */
#define _TXREQ0 C1TXREQLbits.TXREQ0
#define _TXREQ1 C1TXREQLbits.TXREQ1
#define _TXREQ2 C1TXREQLbits.TXREQ2
#define _TXREQ3 C1TXREQLbits.TXREQ3
#define _TXREQ4 C1TXREQLbits.TXREQ4
#define _TXREQ5 C1TXREQLbits.TXREQ5
#define _TXREQ6 C1TXREQLbits.TXREQ6
#define _TXREQ7 C1TXREQLbits.TXREQ7
#define _TXREQ8 C1TXREQLbits.TXREQ8
#define _TXREQ9 C1TXREQLbits.TXREQ9
#define _TXREQ10 C1TXREQLbits.TXREQ10
#define _TXREQ11 C1TXREQLbits.TXREQ11
#define _TXREQ12 C1TXREQLbits.TXREQ12
#define _TXREQ13 C1TXREQLbits.TXREQ13
#define _TXREQ14 C1TXREQLbits.TXREQ14
#define _TXREQ15 C1TXREQLbits.TXREQ15

/* C1TXREQH */
#define _TXREQ16 C1TXREQHbits.TXREQ16
#define _TXREQ17 C1TXREQHbits.TXREQ17
#define _TXREQ18 C1TXREQHbits.TXREQ18
#define _TXREQ19 C1TXREQHbits.TXREQ19
#define _TXREQ20 C1TXREQHbits.TXREQ20
#define _TXREQ21 C1TXREQHbits.TXREQ21
#define _TXREQ22 C1TXREQHbits.TXREQ22
#define _TXREQ23 C1TXREQHbits.TXREQ23
#define _TXREQ24 C1TXREQHbits.TXREQ24
#define _TXREQ25 C1TXREQHbits.TXREQ25
#define _TXREQ26 C1TXREQHbits.TXREQ26
#define _TXREQ27 C1TXREQHbits.TXREQ27
#define _TXREQ28 C1TXREQHbits.TXREQ28
#define _TXREQ29 C1TXREQHbits.TXREQ29
#define _TXREQ30 C1TXREQHbits.TXREQ30
#define _TXREQ31 C1TXREQHbits.TXREQ31

/* C1TRECL */
#define _RERRCNT C1TRECLbits.RERRCNT
#define _TERRCNT C1TRECLbits.TERRCNT
#define _RERRCNT0 C1TRECLbits.RERRCNT0
#define _RERRCNT1 C1TRECLbits.RERRCNT1
#define _RERRCNT2 C1TRECLbits.RERRCNT2
#define _RERRCNT3 C1TRECLbits.RERRCNT3
#define _RERRCNT4 C1TRECLbits.RERRCNT4
#define _RERRCNT5 C1TRECLbits.RERRCNT5
#define _RERRCNT6 C1TRECLbits.RERRCNT6
#define _RERRCNT7 C1TRECLbits.RERRCNT7
#define _TERRCNT0 C1TRECLbits.TERRCNT0
#define _TERRCNT1 C1TRECLbits.TERRCNT1
#define _TERRCNT2 C1TRECLbits.TERRCNT2
#define _TERRCNT3 C1TRECLbits.TERRCNT3
#define _TERRCNT4 C1TRECLbits.TERRCNT4
#define _TERRCNT5 C1TRECLbits.TERRCNT5
#define _TERRCNT6 C1TRECLbits.TERRCNT6
#define _TERRCNT7 C1TRECLbits.TERRCNT7

/* C1TRECH */
#define _EWARN C1TRECHbits.EWARN
#define _RXWARN C1TRECHbits.RXWARN
#define _TXWARN C1TRECHbits.TXWARN
#define _RXBP C1TRECHbits.RXBP
#define _TXBP C1TRECHbits.TXBP
#define _TXBO C1TRECHbits.TXBO

/* C1BDIAG0L */
#define _NRERRCNT C1BDIAG0Lbits.NRERRCNT
#define _NTERRCNT C1BDIAG0Lbits.NTERRCNT
#define _NRERRCNT0 C1BDIAG0Lbits.NRERRCNT0
#define _NRERRCNT1 C1BDIAG0Lbits.NRERRCNT1
#define _NRERRCNT2 C1BDIAG0Lbits.NRERRCNT2
#define _NRERRCNT3 C1BDIAG0Lbits.NRERRCNT3
#define _NRERRCNT4 C1BDIAG0Lbits.NRERRCNT4
#define _NRERRCNT5 C1BDIAG0Lbits.NRERRCNT5
#define _NRERRCNT6 C1BDIAG0Lbits.NRERRCNT6
#define _NRERRCNT7 C1BDIAG0Lbits.NRERRCNT7
#define _NTERRCNT0 C1BDIAG0Lbits.NTERRCNT0
#define _NTERRCNT1 C1BDIAG0Lbits.NTERRCNT1
#define _NTERRCNT2 C1BDIAG0Lbits.NTERRCNT2
#define _NTERRCNT3 C1BDIAG0Lbits.NTERRCNT3
#define _NTERRCNT4 C1BDIAG0Lbits.NTERRCNT4
#define _NTERRCNT5 C1BDIAG0Lbits.NTERRCNT5
#define _NTERRCNT6 C1BDIAG0Lbits.NTERRCNT6
#define _NTERRCNT7 C1BDIAG0Lbits.NTERRCNT7

/* C1BDIAG0H */
#define _DRERRCNT C1BDIAG0Hbits.DRERRCNT
#define _DTERRCNT C1BDIAG0Hbits.DTERRCNT
#define _DRERRCNT0 C1BDIAG0Hbits.DRERRCNT0
#define _DRERRCNT1 C1BDIAG0Hbits.DRERRCNT1
#define _DRERRCNT2 C1BDIAG0Hbits.DRERRCNT2
#define _DRERRCNT3 C1BDIAG0Hbits.DRERRCNT3
#define _DRERRCNT4 C1BDIAG0Hbits.DRERRCNT4
#define _DRERRCNT5 C1BDIAG0Hbits.DRERRCNT5
#define _DRERRCNT6 C1BDIAG0Hbits.DRERRCNT6
#define _DRERRCNT7 C1BDIAG0Hbits.DRERRCNT7
#define _DTERRCNT0 C1BDIAG0Hbits.DTERRCNT0
#define _DTERRCNT1 C1BDIAG0Hbits.DTERRCNT1
#define _DTERRCNT2 C1BDIAG0Hbits.DTERRCNT2
#define _DTERRCNT3 C1BDIAG0Hbits.DTERRCNT3
#define _DTERRCNT4 C1BDIAG0Hbits.DTERRCNT4
#define _DTERRCNT5 C1BDIAG0Hbits.DTERRCNT5
#define _DTERRCNT6 C1BDIAG0Hbits.DTERRCNT6
#define _DTERRCNT7 C1BDIAG0Hbits.DTERRCNT7

/* C1BDIAG1L */
#define _EFMSGCNT C1BDIAG1Lbits.EFMSGCNT
#define _EFMSGCNT0 C1BDIAG1Lbits.EFMSGCNT0
#define _EFMSGCNT1 C1BDIAG1Lbits.EFMSGCNT1
#define _EFMSGCNT2 C1BDIAG1Lbits.EFMSGCNT2
#define _EFMSGCNT3 C1BDIAG1Lbits.EFMSGCNT3
#define _EFMSGCNT4 C1BDIAG1Lbits.EFMSGCNT4
#define _EFMSGCNT5 C1BDIAG1Lbits.EFMSGCNT5
#define _EFMSGCNT6 C1BDIAG1Lbits.EFMSGCNT6
#define _EFMSGCNT7 C1BDIAG1Lbits.EFMSGCNT7
#define _EFMSGCNT8 C1BDIAG1Lbits.EFMSGCNT8
#define _EFMSGCNT9 C1BDIAG1Lbits.EFMSGCNT9
#define _EFMSGCNT10 C1BDIAG1Lbits.EFMSGCNT10
#define _EFMSGCNT11 C1BDIAG1Lbits.EFMSGCNT11
#define _EFMSGCNT12 C1BDIAG1Lbits.EFMSGCNT12
#define _EFMSGCNT13 C1BDIAG1Lbits.EFMSGCNT13
#define _EFMSGCNT14 C1BDIAG1Lbits.EFMSGCNT14
#define _EFMSGCNT15 C1BDIAG1Lbits.EFMSGCNT15

/* C1BDIAG1H */
#define _NBIT0ERR C1BDIAG1Hbits.NBIT0ERR
#define _NBIT1ERR C1BDIAG1Hbits.NBIT1ERR
#define _NACKERR C1BDIAG1Hbits.NACKERR
#define _NFORMERR C1BDIAG1Hbits.NFORMERR
#define _NSTUFERR C1BDIAG1Hbits.NSTUFERR
#define _NCRCERR C1BDIAG1Hbits.NCRCERR
#define _TXBOERR C1BDIAG1Hbits.TXBOERR
#define _DBIT0ERR C1BDIAG1Hbits.DBIT0ERR
#define _DBIT1ERR C1BDIAG1Hbits.DBIT1ERR
#define _DFORMERR C1BDIAG1Hbits.DFORMERR
#define _DSTUFERR C1BDIAG1Hbits.DSTUFERR
#define _DCRCERR C1BDIAG1Hbits.DCRCERR
#define _ESI C1BDIAG1Hbits.ESI
#define _DLCMM C1BDIAG1Hbits.DLCMM

/* C1TEFCONL */
#define _TEFNEIE C1TEFCONLbits.TEFNEIE
#define _TEFHIE C1TEFCONLbits.TEFHIE
#define _TEFFIE C1TEFCONLbits.TEFFIE
#define _TEFOVIE C1TEFCONLbits.TEFOVIE
#define _TEFTSEN C1TEFCONLbits.TEFTSEN
/* Bitname _UINC cannot be defined because it is used by more than one SFR */
/* Bitname _FRESET cannot be defined because it is used by more than one SFR */

