wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* C1FLTOBJ15L */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ15H */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */

/* C1MASK15L */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK15H */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */

/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _T1IF IFS0bits.T1IF
#define _CNAIF IFS0bits.CNAIF
#define _CNBIF IFS0bits.CNBIF
#define _DMA0IF IFS0bits.DMA0IF
#define _CCP1IF IFS0bits.CCP1IF
#define _CCT1IF IFS0bits.CCT1IF
#define _DMA1IF IFS0bits.DMA1IF
#define _SPI1RXIF IFS0bits.SPI1RXIF
#define _SPI1TXIF IFS0bits.SPI1TXIF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _ECCSBEIF IFS0bits.ECCSBEIF
#define _NVMIF IFS0bits.NVMIF
#define _INT1IF IFS0bits.INT1IF

/* IFS1 */
#define _SI2C1IF IFS1bits.SI2C1IF
#define _MI2C1IF IFS1bits.MI2C1IF
#define _DMA2IF IFS1bits.DMA2IF
#define _CNCIF IFS1bits.CNCIF
#define _INT2IF IFS1bits.INT2IF
#define _DMA3IF IFS1bits.DMA3IF
#define _CCP2IF IFS1bits.CCP2IF
#define _CCT2IF IFS1bits.CCT2IF
#define _C1IF IFS1bits.C1IF
#define _INT3IF IFS1bits.INT3IF
#define _U2RXIF IFS1bits.U2RXIF
#define _U2TXIF IFS1bits.U2TXIF
#define _SPI2RXIF IFS1bits.SPI2RXIF
#define _SPI2TXIF IFS1bits.SPI2TXIF
#define _C1RXIF IFS1bits.C1RXIF

/* IFS2 */
#define _CCP3IF IFS2bits.CCP3IF
#define _CCT3IF IFS2bits.CCT3IF
#define _SI2C2IF IFS2bits.SI2C2IF
#define _MI2C2IF IFS2bits.MI2C2IF
#define _CCP4IF IFS2bits.CCP4IF
#define _CCT4IF IFS2bits.CCT4IF
#define _CCP5IF IFS2bits.CCP5IF
#define _CCT5IF IFS2bits.CCT5IF
#define _DMTIF IFS2bits.DMTIF
#define _CCP6IF IFS2bits.CCP6IF
#define _CCT6IF IFS2bits.CCT6IF

/* IFS3 */
#define _QEI1IF IFS3bits.QEI1IF
#define _U1EIF IFS3bits.U1EIF
#define _U2EIF IFS3bits.U2EIF
#define _CRCIF IFS3bits.CRCIF
#define _C1TXIF IFS3bits.C1TXIF
#define _QEI2IF IFS3bits.QEI2IF
#define _U3EIF IFS3bits.U3EIF
#define _U3RXIF IFS3bits.U3RXIF
#define _U3TXIF IFS3bits.U3TXIF
#define _SPI3RXIF IFS3bits.SPI3RXIF
#define _SPI3TXIF IFS3bits.SPI3TXIF
#define _JTAGIF IFS3bits.JTAGIF
#define _PTGSTEPIF IFS3bits.PTGSTEPIF

/* IFS4 */
#define _I2C1BCIF IFS4bits.I2C1BCIF
#define _I2C2BCIF IFS4bits.I2C2BCIF
#define _PWM1IF IFS4bits.PWM1IF
#define _PWM2IF IFS4bits.PWM2IF
#define _PWM3IF IFS4bits.PWM3IF
#define _PWM4IF IFS4bits.PWM4IF
#define _PWM5IF IFS4bits.PWM5IF
#define _PWM6IF IFS4bits.PWM6IF
#define _PWM7IF IFS4bits.PWM7IF
#define _PWM8IF IFS4bits.PWM8IF
#define _CNDIF IFS4bits.CNDIF
#define _CMP1IF IFS4bits.CMP1IF
#define _CMP2IF IFS4bits.CMP2IF
#define _CMP3IF IFS4bits.CMP3IF

/* IFS5 */
#define _PTGWDTIF IFS5bits.PTGWDTIF
#define _PTG0IF IFS5bits.PTG0IF
#define _PTG1IF IFS5bits.PTG1IF
#define _PTG2IF IFS5bits.PTG2IF
#define _PTG3IF IFS5bits.PTG3IF
#define _SENT1IF IFS5bits.SENT1IF
#define _SENT1EIF IFS5bits.SENT1EIF
#define _SENT2IF IFS5bits.SENT2IF
#define _SENT2EIF IFS5bits.SENT2EIF
#define _ADCIF IFS5bits.ADCIF
#define _ADCAN0IF IFS5bits.ADCAN0IF
#define _ADCAN1IF IFS5bits.ADCAN1IF
#define _ADCAN2IF IFS5bits.ADCAN2IF
#define _ADCAN3IF IFS5bits.ADCAN3IF
#define _ADCAN4IF IFS5bits.ADCAN4IF

