wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* DAC1DATL */
/* Bitname _DACDATL cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL11 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL12 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL13 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL14 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL15 cannot be defined because it is used by more than one SFR */

/* DAC1DATH */
/* Bitname _DACDATH cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH11 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH12 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH13 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH14 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH15 cannot be defined because it is used by more than one SFR */

/* SLP1CONL */
/* Bitname _SLPSTRT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL3 cannot be defined because it is used by more than one SFR */

/* SLP1CONH */
/* Bitname _PSE cannot be defined because it is used by more than one SFR */
/* Bitname _TWME cannot be defined because it is used by more than one SFR */
/* Bitname _HME cannot be defined because it is used by more than one SFR */
/* Bitname _SLOPEN cannot be defined because it is used by more than one SFR */

/* SLP1DAT */
/* Bitname _SLPDAT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT4 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT5 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT6 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT7 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT8 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT9 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT10 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT11 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT12 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT13 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT14 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT15 cannot be defined because it is used by more than one SFR */

/* DAC2CONL */
/* Bitname _HYSSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HYSPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPPOL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _DACOEN cannot be defined because it is used by more than one SFR */
/* Bitname _CBE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM1 cannot be defined because it is used by more than one SFR */

/* DAC2CONH */
/* Bitname _TMCB cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB8 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB9 cannot be defined because it is used by more than one SFR */

/* DAC2DATL */
/* Bitname _DACDATL cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL11 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL12 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL13 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL14 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL15 cannot be defined because it is used by more than one SFR */

