wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
/* ANSELD */
#define _ANSELD10 ANSELDbits.ANSELD10
#define _ANSELD11 ANSELDbits.ANSELD11
#define _ANSELD13 ANSELDbits.ANSELD13

/* TRISD */
#define _TRISD0 TRISDbits.TRISD0
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD2 TRISDbits.TRISD2
#define _TRISD3 TRISDbits.TRISD3
#define _TRISD4 TRISDbits.TRISD4
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD7 TRISDbits.TRISD7
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD9 TRISDbits.TRISD9
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD11 TRISDbits.TRISD11
#define _TRISD12 TRISDbits.TRISD12
#define _TRISD13 TRISDbits.TRISD13
#define _TRISD14 TRISDbits.TRISD14
#define _TRISD15 TRISDbits.TRISD15

/* PORTD */
#define _RD0 PORTDbits.RD0
#define _RD1 PORTDbits.RD1
#define _RD2 PORTDbits.RD2
#define _RD3 PORTDbits.RD3
#define _RD4 PORTDbits.RD4
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD7 PORTDbits.RD7
#define _RD8 PORTDbits.RD8
#define _RD9 PORTDbits.RD9
#define _RD10 PORTDbits.RD10
#define _RD11 PORTDbits.RD11
#define _RD12 PORTDbits.RD12
#define _RD13 PORTDbits.RD13
#define _RD14 PORTDbits.RD14
#define _RD15 PORTDbits.RD15

/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11
#define _LATD12 LATDbits.LATD12
#define _LATD13 LATDbits.LATD13
#define _LATD14 LATDbits.LATD14
#define _LATD15 LATDbits.LATD15

/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD7 ODCDbits.ODCD7
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11
#define _ODCD12 ODCDbits.ODCD12
#define _ODCD13 ODCDbits.ODCD13
#define _ODCD14 ODCDbits.ODCD14
#define _ODCD15 ODCDbits.ODCD15

/* CNPUD */
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11
#define _CNPUD12 CNPUDbits.CNPUD12
#define _CNPUD13 CNPUDbits.CNPUD13
#define _CNPUD14 CNPUDbits.CNPUD14
#define _CNPUD15 CNPUDbits.CNPUD15

/* CNPDD */
#define _CNPDD0 CNPDDbits.CNPDD0
#define _CNPDD1 CNPDDbits.CNPDD1
#define _CNPDD2 CNPDDbits.CNPDD2
#define _CNPDD3 CNPDDbits.CNPDD3
#define _CNPDD4 CNPDDbits.CNPDD4
#define _CNPDD5 CNPDDbits.CNPDD5
#define _CNPDD6 CNPDDbits.CNPDD6
#define _CNPDD7 CNPDDbits.CNPDD7
#define _CNPDD8 CNPDDbits.CNPDD8
#define _CNPDD9 CNPDDbits.CNPDD9
#define _CNPDD10 CNPDDbits.CNPDD10
#define _CNPDD11 CNPDDbits.CNPDD11
#define _CNPDD12 CNPDDbits.CNPDD12
#define _CNPDD13 CNPDDbits.CNPDD13
#define _CNPDD14 CNPDDbits.CNPDD14
#define _CNPDD15 CNPDDbits.CNPDD15

/* CNCOND */
/* Bitname _CNSTYLE cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* CNEN0D */
#define _CNEN0D0 CNEN0Dbits.CNEN0D0
#define _CNEN0D1 CNEN0Dbits.CNEN0D1
#define _CNEN0D2 CNEN0Dbits.CNEN0D2
#define _CNEN0D3 CNEN0Dbits.CNEN0D3
#define _CNEN0D4 CNEN0Dbits.CNEN0D4
#define _CNEN0D5 CNEN0Dbits.CNEN0D5
#define _CNEN0D6 CNEN0Dbits.CNEN0D6
#define _CNEN0D7 CNEN0Dbits.CNEN0D7
#define _CNEN0D8 CNEN0Dbits.CNEN0D8
#define _CNEN0D9 CNEN0Dbits.CNEN0D9
#define _CNEN0D10 CNEN0Dbits.CNEN0D10
#define _CNEN0D11 CNEN0Dbits.CNEN0D11
#define _CNEN0D12 CNEN0Dbits.CNEN0D12
#define _CNEN0D13 CNEN0Dbits.CNEN0D13
#define _CNEN0D14 CNEN0Dbits.CNEN0D14
#define _CNEN0D15 CNEN0Dbits.CNEN0D15

/* CNSTATD */
#define _CNSTATD0 CNSTATDbits.CNSTATD0
#define _CNSTATD1 CNSTATDbits.CNSTATD1
#define _CNSTATD2 CNSTATDbits.CNSTATD2
#define _CNSTATD3 CNSTATDbits.CNSTATD3
#define _CNSTATD4 CNSTATDbits.CNSTATD4
#define _CNSTATD5 CNSTATDbits.CNSTATD5
#define _CNSTATD6 CNSTATDbits.CNSTATD6
#define _CNSTATD7 CNSTATDbits.CNSTATD7
#define _CNSTATD8 CNSTATDbits.CNSTATD8
#define _CNSTATD9 CNSTATDbits.CNSTATD9
#define _CNSTATD10 CNSTATDbits.CNSTATD10
#define _CNSTATD11 CNSTATDbits.CNSTATD11
#define _CNSTATD12 CNSTATDbits.CNSTATD12
#define _CNSTATD13 CNSTATDbits.CNSTATD13
#define _CNSTATD14 CNSTATDbits.CNSTATD14
#define _CNSTATD15 CNSTATDbits.CNSTATD15

/* CNEN1D */
#define _CNEN1D0 CNEN1Dbits.CNEN1D0
#define _CNEN1D1 CNEN1Dbits.CNEN1D1
#define _CNEN1D2 CNEN1Dbits.CNEN1D2
#define _CNEN1D3 CNEN1Dbits.CNEN1D3
#define _CNEN1D4 CNEN1Dbits.CNEN1D4
#define _CNEN1D5 CNEN1Dbits.CNEN1D5
#define _CNEN1D6 CNEN1Dbits.CNEN1D6
#define _CNEN1D7 CNEN1Dbits.CNEN1D7
#define _CNEN1D8 CNEN1Dbits.CNEN1D8
#define _CNEN1D9 CNEN1Dbits.CNEN1D9
#define _CNEN1D10 CNEN1Dbits.CNEN1D10
#define _CNEN1D11 CNEN1Dbits.CNEN1D11
#define _CNEN1D12 CNEN1Dbits.CNEN1D12
#define _CNEN1D13 CNEN1Dbits.CNEN1D13
#define _CNEN1D14 CNEN1Dbits.CNEN1D14
#define _CNEN1D15 CNEN1Dbits.CNEN1D15

/* CNFD */
#define _CNFD0 CNFDbits.CNFD0
#define _CNFD1 CNFDbits.CNFD1
#define _CNFD2 CNFDbits.CNFD2
#define _CNFD3 CNFDbits.CNFD3
#define _CNFD4 CNFDbits.CNFD4
#define _CNFD5 CNFDbits.CNFD5
#define _CNFD6 CNFDbits.CNFD6
#define _CNFD7 CNFDbits.CNFD7
#define _CNFD8 CNFDbits.CNFD8
#define _CNFD9 CNFDbits.CNFD9
#define _CNFD10 CNFDbits.CNFD10
#define _CNFD11 CNFDbits.CNFD11
#define _CNFD12 CNFDbits.CNFD12
#define _CNFD13 CNFDbits.CNFD13
#define _CNFD14 CNFDbits.CNFD14
#define _CNFD15 CNFDbits.CNFD15

/* MBISTCON */
#define _MBISTEN MBISTCONbits.MBISTEN
#define _MBISTSTAT MBISTCONbits.MBISTSTAT
#define _MBISTDONE MBISTCONbits.MBISTDONE
/* Bitname _FLTINJ cannot be defined because it is used by more than one SFR */

/* U3MODE */
/* Bitname _MOD cannot be defined because it is used by more than one SFR */
/* Bitname _URXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _BRKOVR cannot be defined because it is used by more than one SFR */
/* Bitname _RXBIMD cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _MOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD3 cannot be defined because it is used by more than one SFR */

/* U3MODEH */
/* Bitname _FLO cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _C0EN cannot be defined because it is used by more than one SFR */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _RUNOVF cannot be defined because it is used by more than one SFR */
/* Bitname _HALFDPLX cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKMOD cannot be defined because it is used by more than one SFR */
/* Bitname _ACTIVE cannot be defined because it is used by more than one SFR */
/* Bitname _SLPEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLO0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLO1 cannot be defined because it is used by more than one SFR */
/* Bitname _STSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _STSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKSEL1 cannot be defined because it is used by more than one SFR */

/* U3STA */
/* Bitname _TXCIF cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _RXBKIF cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _CERIF cannot be defined because it is used by more than one SFR */
/* Bitname _ABDOVF cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _TXCIE cannot be defined because it is used by more than one SFR */
/* Bitname _OERIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXBKIE cannot be defined because it is used by more than one SFR */
/* Bitname _FERIE cannot be defined because it is used by more than one SFR */
/* Bitname _CERIE cannot be defined because it is used by more than one SFR */
/* Bitname _ABDOVE cannot be defined because it is used by more than one SFR */
/* Bitname _PERIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXMTIE cannot be defined because it is used by more than one SFR */

/* U3STAH */
/* Bitname _URXBF cannot be defined because it is used by more than one SFR */
/* Bitname _URXBE cannot be defined because it is used by more than one SFR */
/* Bitname _XON cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBE cannot be defined because it is used by more than one SFR */
/* Bitname _STPMD cannot be defined because it is used by more than one SFR */
/* Bitname _TXWRE cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL2 cannot be defined because it is used by more than one SFR */

/* U3BRG */
/* Bitname _BRG cannot be defined because it is used by more than one SFR */
/* Bitname _BRG0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG5 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG6 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG7 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG8 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG9 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG10 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG11 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG12 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG13 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG14 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG15 cannot be defined because it is used by more than one SFR */

