wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _XBREV_XB6_POSITION                      0x00000006
#define _XBREV_XB6_MASK                          0x00000040
#define _XBREV_XB6_LENGTH                        0x00000001

#define _XBREV_XB7_POSITION                      0x00000007
#define _XBREV_XB7_MASK                          0x00000080
#define _XBREV_XB7_LENGTH                        0x00000001

#define _XBREV_XB8_POSITION                      0x00000008
#define _XBREV_XB8_MASK                          0x00000100
#define _XBREV_XB8_LENGTH                        0x00000001

#define _XBREV_XB9_POSITION                      0x00000009
#define _XBREV_XB9_MASK                          0x00000200
#define _XBREV_XB9_LENGTH                        0x00000001

#define _XBREV_XB10_POSITION                     0x0000000A
#define _XBREV_XB10_MASK                         0x00000400
#define _XBREV_XB10_LENGTH                       0x00000001

#define _XBREV_XB11_POSITION                     0x0000000B
#define _XBREV_XB11_MASK                         0x00000800
#define _XBREV_XB11_LENGTH                       0x00000001

#define _XBREV_XB12_POSITION                     0x0000000C
#define _XBREV_XB12_MASK                         0x00001000
#define _XBREV_XB12_LENGTH                       0x00000001

#define _XBREV_XB13_POSITION                     0x0000000D
#define _XBREV_XB13_MASK                         0x00002000
#define _XBREV_XB13_LENGTH                       0x00000001

#define _XBREV_XB14_POSITION                     0x0000000E
#define _XBREV_XB14_MASK                         0x00004000
#define _XBREV_XB14_LENGTH                       0x00000001

#define _TBLPAG_TBLPAG_POSITION                  0x00000000
#define _TBLPAG_TBLPAG_MASK                      0x000000FF
#define _TBLPAG_TBLPAG_LENGTH                    0x00000008

#define _YPAG_YPAG_POSITION                      0x00000000
#define _YPAG_YPAG_MASK                          0x000000FF
#define _YPAG_YPAG_LENGTH                        0x00000008

#define _MSTRPR_NVMPR_POSITION                   0x00000000
#define _MSTRPR_NVMPR_MASK                       0x00000001
#define _MSTRPR_NVMPR_LENGTH                     0x00000001

#define _MSTRPR_CANPR_POSITION                   0x00000004
#define _MSTRPR_CANPR_MASK                       0x00000010
#define _MSTRPR_CANPR_LENGTH                     0x00000001

#define _MSTRPR_DMAPR_POSITION                   0x00000005
#define _MSTRPR_DMAPR_MASK                       0x00000020
#define _MSTRPR_DMAPR_LENGTH                     0x00000001

#define _CTXTSTAT_MCTXI_POSITION                 0x00000000
#define _CTXTSTAT_MCTXI_MASK                     0x00000007
#define _CTXTSTAT_MCTXI_LENGTH                   0x00000003

#define _CTXTSTAT_CCTXI_POSITION                 0x00000008
#define _CTXTSTAT_CCTXI_MASK                     0x00000700
#define _CTXTSTAT_CCTXI_LENGTH                   0x00000003

#define _DMTCON_ON_POSITION                      0x0000000F
#define _DMTCON_ON_MASK                          0x00008000
#define _DMTCON_ON_LENGTH                        0x00000001

#define _DMTPRECLR_STEP1_POSITION                0x00000008
#define _DMTPRECLR_STEP1_MASK                    0x0000FF00
#define _DMTPRECLR_STEP1_LENGTH                  0x00000008

#define _DMTCLR_STEP2_POSITION                   0x00000000
#define _DMTCLR_STEP2_MASK                       0x000000FF
#define _DMTCLR_STEP2_LENGTH                     0x00000008

#define _DMTSTAT_WINOPN_POSITION                 0x00000000
#define _DMTSTAT_WINOPN_MASK                     0x00000001
#define _DMTSTAT_WINOPN_LENGTH                   0x00000001

#define _DMTSTAT_DMTEVENT_POSITION               0x00000005
#define _DMTSTAT_DMTEVENT_MASK                   0x00000020
#define _DMTSTAT_DMTEVENT_LENGTH                 0x00000001

#define _DMTSTAT_BAD2_POSITION                   0x00000006
#define _DMTSTAT_BAD2_MASK                       0x00000040
#define _DMTSTAT_BAD2_LENGTH                     0x00000001

#define _DMTSTAT_BAD1_POSITION                   0x00000007
#define _DMTSTAT_BAD1_MASK                       0x00000080
#define _DMTSTAT_BAD1_LENGTH                     0x00000001

#define _SENT1CON1_NIBCNT_POSITION               0x00000000
#define _SENT1CON1_NIBCNT_MASK                   0x00000007
#define _SENT1CON1_NIBCNT_LENGTH                 0x00000003

#define _SENT1CON1_PS_POSITION                   0x00000004
#define _SENT1CON1_PS_MASK                       0x00000010
#define _SENT1CON1_PS_LENGTH                     0x00000001

#define _SENT1CON1_SPCEN_POSITION                0x00000006
#define _SENT1CON1_SPCEN_MASK                    0x00000040
#define _SENT1CON1_SPCEN_LENGTH                  0x00000001

#define _SENT1CON1_PPP_POSITION                  0x00000007
#define _SENT1CON1_PPP_MASK                      0x00000080
#define _SENT1CON1_PPP_LENGTH                    0x00000001

#define _SENT1CON1_CRCEN_POSITION                0x00000008
#define _SENT1CON1_CRCEN_MASK                    0x00000100
#define _SENT1CON1_CRCEN_LENGTH                  0x00000001

#define _SENT1CON1_TXPOL_POSITION                0x00000009
#define _SENT1CON1_TXPOL_MASK                    0x00000200
#define _SENT1CON1_TXPOL_LENGTH                  0x00000001

#define _SENT1CON1_TXM_POSITION                  0x0000000A
#define _SENT1CON1_TXM_MASK                      0x00000400
#define _SENT1CON1_TXM_LENGTH                    0x00000001

#define _SENT1CON1_RCVEN_POSITION                0x0000000B
#define _SENT1CON1_RCVEN_MASK                    0x00000800
#define _SENT1CON1_RCVEN_LENGTH                  0x00000001

#define _SENT1CON1_SNTSIDL_POSITION              0x0000000D
#define _SENT1CON1_SNTSIDL_MASK                  0x00002000
#define _SENT1CON1_SNTSIDL_LENGTH                0x00000001

#define _SENT1CON1_SNTEN_POSITION                0x0000000F
#define _SENT1CON1_SNTEN_MASK                    0x00008000
#define _SENT1CON1_SNTEN_LENGTH                  0x00000001

#define _SENT1STAT_SYNCTXEN_POSITION             0x00000000
#define _SENT1STAT_SYNCTXEN_MASK                 0x00000001
#define _SENT1STAT_SYNCTXEN_LENGTH               0x00000001

#define _SENT1STAT_RXIDLE_POSITION               0x00000001
#define _SENT1STAT_RXIDLE_MASK                   0x00000002
#define _SENT1STAT_RXIDLE_LENGTH                 0x00000001

#define _SENT1STAT_FRMERR_POSITION               0x00000002
#define _SENT1STAT_FRMERR_MASK                   0x00000004
#define _SENT1STAT_FRMERR_LENGTH                 0x00000001

