wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _CRCXORL_X14_POSITION                    0x0000000E
#define _CRCXORL_X14_MASK                        0x00004000
#define _CRCXORL_X14_LENGTH                      0x00000001

#define _CRCXORL_X15_POSITION                    0x0000000F
#define _CRCXORL_X15_MASK                        0x00008000
#define _CRCXORL_X15_LENGTH                      0x00000001

#define _CRCXORH_X16_POSITION                    0x00000000
#define _CRCXORH_X16_MASK                        0x00000001
#define _CRCXORH_X16_LENGTH                      0x00000001

#define _CRCXORH_X17_POSITION                    0x00000001
#define _CRCXORH_X17_MASK                        0x00000002
#define _CRCXORH_X17_LENGTH                      0x00000001

#define _CRCXORH_X18_POSITION                    0x00000002
#define _CRCXORH_X18_MASK                        0x00000004
#define _CRCXORH_X18_LENGTH                      0x00000001

#define _CRCXORH_X19_POSITION                    0x00000003
#define _CRCXORH_X19_MASK                        0x00000008
#define _CRCXORH_X19_LENGTH                      0x00000001

#define _CRCXORH_X20_POSITION                    0x00000004
#define _CRCXORH_X20_MASK                        0x00000010
#define _CRCXORH_X20_LENGTH                      0x00000001

#define _CRCXORH_X21_POSITION                    0x00000005
#define _CRCXORH_X21_MASK                        0x00000020
#define _CRCXORH_X21_LENGTH                      0x00000001

#define _CRCXORH_X22_POSITION                    0x00000006
#define _CRCXORH_X22_MASK                        0x00000040
#define _CRCXORH_X22_LENGTH                      0x00000001

#define _CRCXORH_X23_POSITION                    0x00000007
#define _CRCXORH_X23_MASK                        0x00000080
#define _CRCXORH_X23_LENGTH                      0x00000001

#define _CRCXORH_X24_POSITION                    0x00000008
#define _CRCXORH_X24_MASK                        0x00000100
#define _CRCXORH_X24_LENGTH                      0x00000001

#define _CRCXORH_X25_POSITION                    0x00000009
#define _CRCXORH_X25_MASK                        0x00000200
#define _CRCXORH_X25_LENGTH                      0x00000001

#define _CRCXORH_X26_POSITION                    0x0000000A
#define _CRCXORH_X26_MASK                        0x00000400
#define _CRCXORH_X26_LENGTH                      0x00000001

#define _CRCXORH_X27_POSITION                    0x0000000B
#define _CRCXORH_X27_MASK                        0x00000800
#define _CRCXORH_X27_LENGTH                      0x00000001

#define _CRCXORH_X28_POSITION                    0x0000000C
#define _CRCXORH_X28_MASK                        0x00001000
#define _CRCXORH_X28_LENGTH                      0x00000001

#define _CRCXORH_X29_POSITION                    0x0000000D
#define _CRCXORH_X29_MASK                        0x00002000
#define _CRCXORH_X29_LENGTH                      0x00000001

#define _CRCXORH_X30_POSITION                    0x0000000E
#define _CRCXORH_X30_MASK                        0x00004000
#define _CRCXORH_X30_LENGTH                      0x00000001

#define _CRCXORH_X31_POSITION                    0x0000000F
#define _CRCXORH_X31_MASK                        0x00008000
#define _CRCXORH_X31_LENGTH                      0x00000001

#define _CLC1CONL_MODE_POSITION                  0x00000000
#define _CLC1CONL_MODE_MASK                      0x00000007
#define _CLC1CONL_MODE_LENGTH                    0x00000003

#define _CLC1CONL_LCPOL_POSITION                 0x00000005
#define _CLC1CONL_LCPOL_MASK                     0x00000020
#define _CLC1CONL_LCPOL_LENGTH                   0x00000001

#define _CLC1CONL_LCOUT_POSITION                 0x00000006
#define _CLC1CONL_LCOUT_MASK                     0x00000040
#define _CLC1CONL_LCOUT_LENGTH                   0x00000001

#define _CLC1CONL_LCOE_POSITION                  0x00000007
#define _CLC1CONL_LCOE_MASK                      0x00000080
#define _CLC1CONL_LCOE_LENGTH                    0x00000001

#define _CLC1CONL_INTN_POSITION                  0x0000000A
#define _CLC1CONL_INTN_MASK                      0x00000400
#define _CLC1CONL_INTN_LENGTH                    0x00000001

#define _CLC1CONL_INTP_POSITION                  0x0000000B
#define _CLC1CONL_INTP_MASK                      0x00000800
#define _CLC1CONL_INTP_LENGTH                    0x00000001

#define _CLC1CONL_LCEN_POSITION                  0x0000000F
#define _CLC1CONL_LCEN_MASK                      0x00008000
#define _CLC1CONL_LCEN_LENGTH                    0x00000001

#define _CLC1CONL_MODE0_POSITION                 0x00000000
#define _CLC1CONL_MODE0_MASK                     0x00000001
#define _CLC1CONL_MODE0_LENGTH                   0x00000001

#define _CLC1CONL_MODE1_POSITION                 0x00000001
#define _CLC1CONL_MODE1_MASK                     0x00000002
#define _CLC1CONL_MODE1_LENGTH                   0x00000001

#define _CLC1CONL_MODE2_POSITION                 0x00000002
#define _CLC1CONL_MODE2_MASK                     0x00000004
#define _CLC1CONL_MODE2_LENGTH                   0x00000001

#define _CLC1CONH_G1POL_POSITION                 0x00000000
#define _CLC1CONH_G1POL_MASK                     0x00000001
#define _CLC1CONH_G1POL_LENGTH                   0x00000001

#define _CLC1CONH_G2POL_POSITION                 0x00000001
#define _CLC1CONH_G2POL_MASK                     0x00000002
#define _CLC1CONH_G2POL_LENGTH                   0x00000001

#define _CLC1CONH_G3POL_POSITION                 0x00000002
#define _CLC1CONH_G3POL_MASK                     0x00000004
#define _CLC1CONH_G3POL_LENGTH                   0x00000001

#define _CLC1CONH_G4POL_POSITION                 0x00000003
#define _CLC1CONH_G4POL_MASK                     0x00000008
#define _CLC1CONH_G4POL_LENGTH                   0x00000001

#define _CLC1SEL_DS1_POSITION                    0x00000000
#define _CLC1SEL_DS1_MASK                        0x00000007
#define _CLC1SEL_DS1_LENGTH                      0x00000003

#define _CLC1SEL_DS2_POSITION                    0x00000004
#define _CLC1SEL_DS2_MASK                        0x00000070
#define _CLC1SEL_DS2_LENGTH                      0x00000003

#define _CLC1SEL_DS3_POSITION                    0x00000008
#define _CLC1SEL_DS3_MASK                        0x00000700
#define _CLC1SEL_DS3_LENGTH                      0x00000003

