wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _U2P2_P24_POSITION                       0x00000004
#define _U2P2_P24_MASK                           0x00000010
#define _U2P2_P24_LENGTH                         0x00000001

#define _U2P2_P25_POSITION                       0x00000005
#define _U2P2_P25_MASK                           0x00000020
#define _U2P2_P25_LENGTH                         0x00000001

#define _U2P2_P26_POSITION                       0x00000006
#define _U2P2_P26_MASK                           0x00000040
#define _U2P2_P26_LENGTH                         0x00000001

#define _U2P2_P27_POSITION                       0x00000007
#define _U2P2_P27_MASK                           0x00000080
#define _U2P2_P27_LENGTH                         0x00000001

#define _U2P2_P28_POSITION                       0x00000008
#define _U2P2_P28_MASK                           0x00000100
#define _U2P2_P28_LENGTH                         0x00000001

#define _U2P3_P3_POSITION                        0x00000000
#define _U2P3_P3_MASK                            0x0000FFFF
#define _U2P3_P3_LENGTH                          0x00000010

#define _U2P3_P30_POSITION                       0x00000000
#define _U2P3_P30_MASK                           0x00000001
#define _U2P3_P30_LENGTH                         0x00000001

#define _U2P3_P31_POSITION                       0x00000001
#define _U2P3_P31_MASK                           0x00000002
#define _U2P3_P31_LENGTH                         0x00000001

#define _U2P3_P32_POSITION                       0x00000002
#define _U2P3_P32_MASK                           0x00000004
#define _U2P3_P32_LENGTH                         0x00000001

#define _U2P3_P33_POSITION                       0x00000003
#define _U2P3_P33_MASK                           0x00000008
#define _U2P3_P33_LENGTH                         0x00000001

#define _U2P3_P34_POSITION                       0x00000004
#define _U2P3_P34_MASK                           0x00000010
#define _U2P3_P34_LENGTH                         0x00000001

#define _U2P3_P35_POSITION                       0x00000005
#define _U2P3_P35_MASK                           0x00000020
#define _U2P3_P35_LENGTH                         0x00000001

#define _U2P3_P36_POSITION                       0x00000006
#define _U2P3_P36_MASK                           0x00000040
#define _U2P3_P36_LENGTH                         0x00000001

#define _U2P3_P37_POSITION                       0x00000007
#define _U2P3_P37_MASK                           0x00000080
#define _U2P3_P37_LENGTH                         0x00000001

#define _U2P3_P38_POSITION                       0x00000008
#define _U2P3_P38_MASK                           0x00000100
#define _U2P3_P38_LENGTH                         0x00000001

#define _U2P3_P39_POSITION                       0x00000009
#define _U2P3_P39_MASK                           0x00000200
#define _U2P3_P39_LENGTH                         0x00000001

#define _U2P3_P310_POSITION                      0x0000000A
#define _U2P3_P310_MASK                          0x00000400
#define _U2P3_P310_LENGTH                        0x00000001

#define _U2P3_P311_POSITION                      0x0000000B
#define _U2P3_P311_MASK                          0x00000800
#define _U2P3_P311_LENGTH                        0x00000001

#define _U2P3_P312_POSITION                      0x0000000C
#define _U2P3_P312_MASK                          0x00001000
#define _U2P3_P312_LENGTH                        0x00000001

#define _U2P3_P313_POSITION                      0x0000000D
#define _U2P3_P313_MASK                          0x00002000
#define _U2P3_P313_LENGTH                        0x00000001

#define _U2P3_P314_POSITION                      0x0000000E
#define _U2P3_P314_MASK                          0x00004000
#define _U2P3_P314_LENGTH                        0x00000001

#define _U2P3_P315_POSITION                      0x0000000F
#define _U2P3_P315_MASK                          0x00008000
#define _U2P3_P315_LENGTH                        0x00000001

#define _U2P3H_P3H_POSITION                      0x00000000
#define _U2P3H_P3H_MASK                          0x000000FF
#define _U2P3H_P3H_LENGTH                        0x00000008

#define _U2P3H_P316_POSITION                     0x00000000
#define _U2P3H_P316_MASK                         0x00000001
#define _U2P3H_P316_LENGTH                       0x00000001

#define _U2P3H_P317_POSITION                     0x00000001
#define _U2P3H_P317_MASK                         0x00000002
#define _U2P3H_P317_LENGTH                       0x00000001

#define _U2P3H_P318_POSITION                     0x00000002
#define _U2P3H_P318_MASK                         0x00000004
#define _U2P3H_P318_LENGTH                       0x00000001

#define _U2P3H_P319_POSITION                     0x00000003
#define _U2P3H_P319_MASK                         0x00000008
#define _U2P3H_P319_LENGTH                       0x00000001

#define _U2P3H_P320_POSITION                     0x00000004
#define _U2P3H_P320_MASK                         0x00000010
#define _U2P3H_P320_LENGTH                       0x00000001

#define _U2P3H_P321_POSITION                     0x00000005
#define _U2P3H_P321_MASK                         0x00000020
#define _U2P3H_P321_LENGTH                       0x00000001

#define _U2P3H_P322_POSITION                     0x00000006
#define _U2P3H_P322_MASK                         0x00000040
#define _U2P3H_P322_LENGTH                       0x00000001

#define _U2P3H_P323_POSITION                     0x00000007
#define _U2P3H_P323_MASK                         0x00000080
#define _U2P3H_P323_LENGTH                       0x00000001

#define _U2TXCHK_TXCHK_POSITION                  0x00000000
#define _U2TXCHK_TXCHK_MASK                      0x000000FF
#define _U2TXCHK_TXCHK_LENGTH                    0x00000008

#define _U2TXCHK_TXCHK0_POSITION                 0x00000000
#define _U2TXCHK_TXCHK0_MASK                     0x00000001
#define _U2TXCHK_TXCHK0_LENGTH                   0x00000001

#define _U2TXCHK_TXCHK1_POSITION                 0x00000001
#define _U2TXCHK_TXCHK1_MASK                     0x00000002
#define _U2TXCHK_TXCHK1_LENGTH                   0x00000001

#define _U2TXCHK_TXCHK2_POSITION                 0x00000002
#define _U2TXCHK_TXCHK2_MASK                     0x00000004
#define _U2TXCHK_TXCHK2_LENGTH                   0x00000001

