wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _LOGCONA_S2APOL_POSITION                 0x00000006
#define _LOGCONA_S2APOL_MASK                     0x00000040
#define _LOGCONA_S2APOL_LENGTH                   0x00000001

#define _LOGCONA_S1APOL_POSITION                 0x00000007
#define _LOGCONA_S1APOL_MASK                     0x00000080
#define _LOGCONA_S1APOL_LENGTH                   0x00000001

#define _LOGCONA_PWMS2A_POSITION                 0x00000008
#define _LOGCONA_PWMS2A_MASK                     0x00000F00
#define _LOGCONA_PWMS2A_LENGTH                   0x00000004

#define _LOGCONA_PWMS1A_POSITION                 0x0000000C
#define _LOGCONA_PWMS1A_MASK                     0x0000F000
#define _LOGCONA_PWMS1A_LENGTH                   0x00000004

#define _LOGCONB_PWMLFBD_POSITION                0x00000000
#define _LOGCONB_PWMLFBD_MASK                    0x00000007
#define _LOGCONB_PWMLFBD_LENGTH                  0x00000003

#define _LOGCONB_PWMLFB_POSITION                 0x00000004
#define _LOGCONB_PWMLFB_MASK                     0x00000030
#define _LOGCONB_PWMLFB_LENGTH                   0x00000002

#define _LOGCONB_S2BPOL_POSITION                 0x00000006
#define _LOGCONB_S2BPOL_MASK                     0x00000040
#define _LOGCONB_S2BPOL_LENGTH                   0x00000001

#define _LOGCONB_S1BPOL_POSITION                 0x00000007
#define _LOGCONB_S1BPOL_MASK                     0x00000080
#define _LOGCONB_S1BPOL_LENGTH                   0x00000001

#define _LOGCONB_PWMS2B_POSITION                 0x00000008
#define _LOGCONB_PWMS2B_MASK                     0x00000F00
#define _LOGCONB_PWMS2B_LENGTH                   0x00000004

#define _LOGCONB_PWMS1B_POSITION                 0x0000000C
#define _LOGCONB_PWMS1B_MASK                     0x0000F000
#define _LOGCONB_PWMS1B_LENGTH                   0x00000004

#define _LOGCONC_PWMLFCD_POSITION                0x00000000
#define _LOGCONC_PWMLFCD_MASK                    0x00000007
#define _LOGCONC_PWMLFCD_LENGTH                  0x00000003

#define _LOGCONC_PWMLFC_POSITION                 0x00000004
#define _LOGCONC_PWMLFC_MASK                     0x00000030
#define _LOGCONC_PWMLFC_LENGTH                   0x00000002

#define _LOGCONC_S2CPOL_POSITION                 0x00000006
#define _LOGCONC_S2CPOL_MASK                     0x00000040
#define _LOGCONC_S2CPOL_LENGTH                   0x00000001

#define _LOGCONC_S1CPOL_POSITION                 0x00000007
#define _LOGCONC_S1CPOL_MASK                     0x00000080
#define _LOGCONC_S1CPOL_LENGTH                   0x00000001

#define _LOGCONC_PWMS2C_POSITION                 0x00000008
#define _LOGCONC_PWMS2C_MASK                     0x00000F00
#define _LOGCONC_PWMS2C_LENGTH                   0x00000004

#define _LOGCONC_PWMS1C_POSITION                 0x0000000C
#define _LOGCONC_PWMS1C_MASK                     0x0000F000
#define _LOGCONC_PWMS1C_LENGTH                   0x00000004

#define _LOGCOND_PWMLFDD_POSITION                0x00000000
#define _LOGCOND_PWMLFDD_MASK                    0x00000007
#define _LOGCOND_PWMLFDD_LENGTH                  0x00000003

#define _LOGCOND_PWMLFD_POSITION                 0x00000004
#define _LOGCOND_PWMLFD_MASK                     0x00000030
#define _LOGCOND_PWMLFD_LENGTH                   0x00000002

#define _LOGCOND_S2DPOL_POSITION                 0x00000006
#define _LOGCOND_S2DPOL_MASK                     0x00000040
#define _LOGCOND_S2DPOL_LENGTH                   0x00000001

#define _LOGCOND_S1DPOL_POSITION                 0x00000007
#define _LOGCOND_S1DPOL_MASK                     0x00000080
#define _LOGCOND_S1DPOL_LENGTH                   0x00000001

#define _LOGCOND_PWMS2D_POSITION                 0x00000008
#define _LOGCOND_PWMS2D_MASK                     0x00000F00
#define _LOGCOND_PWMS2D_LENGTH                   0x00000004

#define _LOGCOND_PWMS1D_POSITION                 0x0000000C
#define _LOGCOND_PWMS1D_MASK                     0x0000F000
#define _LOGCOND_PWMS1D_LENGTH                   0x00000004

#define _LOGCONE_PWMLFED_POSITION                0x00000000
#define _LOGCONE_PWMLFED_MASK                    0x00000007
#define _LOGCONE_PWMLFED_LENGTH                  0x00000003

#define _LOGCONE_PWMLFE_POSITION                 0x00000004
#define _LOGCONE_PWMLFE_MASK                     0x00000030
#define _LOGCONE_PWMLFE_LENGTH                   0x00000002

#define _LOGCONE_S2EPOL_POSITION                 0x00000006
#define _LOGCONE_S2EPOL_MASK                     0x00000040
#define _LOGCONE_S2EPOL_LENGTH                   0x00000001

#define _LOGCONE_S1EPOL_POSITION                 0x00000007
#define _LOGCONE_S1EPOL_MASK                     0x00000080
#define _LOGCONE_S1EPOL_LENGTH                   0x00000001

#define _LOGCONE_PWMS2E_POSITION                 0x00000008
#define _LOGCONE_PWMS2E_MASK                     0x00000F00
#define _LOGCONE_PWMS2E_LENGTH                   0x00000004

#define _LOGCONE_PWMS1E_POSITION                 0x0000000C
#define _LOGCONE_PWMS1E_MASK                     0x0000F000
#define _LOGCONE_PWMS1E_LENGTH                   0x00000004

#define _LOGCONF_PWMLFFD_POSITION                0x00000000
#define _LOGCONF_PWMLFFD_MASK                    0x00000007
#define _LOGCONF_PWMLFFD_LENGTH                  0x00000003

#define _LOGCONF_PWMLFF_POSITION                 0x00000004
#define _LOGCONF_PWMLFF_MASK                     0x00000030
#define _LOGCONF_PWMLFF_LENGTH                   0x00000002

#define _LOGCONF_S2FPOL_POSITION                 0x00000006
#define _LOGCONF_S2FPOL_MASK                     0x00000040
#define _LOGCONF_S2FPOL_LENGTH                   0x00000001

#define _LOGCONF_S1FPOL_POSITION                 0x00000007
#define _LOGCONF_S1FPOL_MASK                     0x00000080
#define _LOGCONF_S1FPOL_LENGTH                   0x00000001

#define _LOGCONF_PWMS2F_POSITION                 0x00000008
#define _LOGCONF_PWMS2F_MASK                     0x00000F00
#define _LOGCONF_PWMS2F_LENGTH                   0x00000004

#define _LOGCONF_PWMS1F_POSITION                 0x0000000C
#define _LOGCONF_PWMS1F_MASK                     0x0000F000
#define _LOGCONF_PWMS1F_LENGTH                   0x00000004

#define _PWMEVTA_EVTAPGS_POSITION                0x00000000
#define _PWMEVTA_EVTAPGS_MASK                    0x00000007
#define _PWMEVTA_EVTAPGS_LENGTH                  0x00000003

