wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PWMEVTA_EVTASEL_POSITION                0x00000004
#define _PWMEVTA_EVTASEL_MASK                    0x000000F0
#define _PWMEVTA_EVTASEL_LENGTH                  0x00000004

#define _PWMEVTA_EVTASYNC_POSITION               0x0000000C
#define _PWMEVTA_EVTASYNC_MASK                   0x00001000
#define _PWMEVTA_EVTASYNC_LENGTH                 0x00000001

#define _PWMEVTA_EVTASTRD_POSITION               0x0000000D
#define _PWMEVTA_EVTASTRD_MASK                   0x00002000
#define _PWMEVTA_EVTASTRD_LENGTH                 0x00000001

#define _PWMEVTA_EVTAPOL_POSITION                0x0000000E
#define _PWMEVTA_EVTAPOL_MASK                    0x00004000
#define _PWMEVTA_EVTAPOL_LENGTH                  0x00000001

#define _PWMEVTA_EVTAOEN_POSITION                0x0000000F
#define _PWMEVTA_EVTAOEN_MASK                    0x00008000
#define _PWMEVTA_EVTAOEN_LENGTH                  0x00000001

#define _PWMEVTB_EVTBPGS_POSITION                0x00000000
#define _PWMEVTB_EVTBPGS_MASK                    0x00000007
#define _PWMEVTB_EVTBPGS_LENGTH                  0x00000003

#define _PWMEVTB_EVTBSEL_POSITION                0x00000004
#define _PWMEVTB_EVTBSEL_MASK                    0x000000F0
#define _PWMEVTB_EVTBSEL_LENGTH                  0x00000004

#define _PWMEVTB_EVTBSYNC_POSITION               0x0000000C
#define _PWMEVTB_EVTBSYNC_MASK                   0x00001000
#define _PWMEVTB_EVTBSYNC_LENGTH                 0x00000001

#define _PWMEVTB_EVTBSTRD_POSITION               0x0000000D
#define _PWMEVTB_EVTBSTRD_MASK                   0x00002000
#define _PWMEVTB_EVTBSTRD_LENGTH                 0x00000001

#define _PWMEVTB_EVTBPOL_POSITION                0x0000000E
#define _PWMEVTB_EVTBPOL_MASK                    0x00004000
#define _PWMEVTB_EVTBPOL_LENGTH                  0x00000001

#define _PWMEVTB_EVTBOEN_POSITION                0x0000000F
#define _PWMEVTB_EVTBOEN_MASK                    0x00008000
#define _PWMEVTB_EVTBOEN_LENGTH                  0x00000001

#define _PWMEVTC_EVTCPGS_POSITION                0x00000000
#define _PWMEVTC_EVTCPGS_MASK                    0x00000007
#define _PWMEVTC_EVTCPGS_LENGTH                  0x00000003

#define _PWMEVTC_EVTCSEL_POSITION                0x00000004
#define _PWMEVTC_EVTCSEL_MASK                    0x000000F0
#define _PWMEVTC_EVTCSEL_LENGTH                  0x00000004

#define _PWMEVTC_EVTCSYNC_POSITION               0x0000000C
#define _PWMEVTC_EVTCSYNC_MASK                   0x00001000
#define _PWMEVTC_EVTCSYNC_LENGTH                 0x00000001

#define _PWMEVTC_EVTCSTRD_POSITION               0x0000000D
#define _PWMEVTC_EVTCSTRD_MASK                   0x00002000
#define _PWMEVTC_EVTCSTRD_LENGTH                 0x00000001

#define _PWMEVTC_EVTCPOL_POSITION                0x0000000E
#define _PWMEVTC_EVTCPOL_MASK                    0x00004000
#define _PWMEVTC_EVTCPOL_LENGTH                  0x00000001

#define _PWMEVTC_EVTCOEN_POSITION                0x0000000F
#define _PWMEVTC_EVTCOEN_MASK                    0x00008000
#define _PWMEVTC_EVTCOEN_LENGTH                  0x00000001

#define _PWMEVTD_EVTDPGS_POSITION                0x00000000
#define _PWMEVTD_EVTDPGS_MASK                    0x00000007
#define _PWMEVTD_EVTDPGS_LENGTH                  0x00000003

#define _PWMEVTD_EVTDSEL_POSITION                0x00000004
#define _PWMEVTD_EVTDSEL_MASK                    0x000000F0
#define _PWMEVTD_EVTDSEL_LENGTH                  0x00000004

#define _PWMEVTD_EVTDSYNC_POSITION               0x0000000C
#define _PWMEVTD_EVTDSYNC_MASK                   0x00001000
#define _PWMEVTD_EVTDSYNC_LENGTH                 0x00000001

#define _PWMEVTD_EVTDSTRD_POSITION               0x0000000D
#define _PWMEVTD_EVTDSTRD_MASK                   0x00002000
#define _PWMEVTD_EVTDSTRD_LENGTH                 0x00000001

#define _PWMEVTD_EVTDPOL_POSITION                0x0000000E
#define _PWMEVTD_EVTDPOL_MASK                    0x00004000
#define _PWMEVTD_EVTDPOL_LENGTH                  0x00000001

#define _PWMEVTD_EVTDOEN_POSITION                0x0000000F
#define _PWMEVTD_EVTDOEN_MASK                    0x00008000
#define _PWMEVTD_EVTDOEN_LENGTH                  0x00000001

#define _PWMEVTE_EVTEPGS_POSITION                0x00000000
#define _PWMEVTE_EVTEPGS_MASK                    0x00000007
#define _PWMEVTE_EVTEPGS_LENGTH                  0x00000003

#define _PWMEVTE_EVTESEL_POSITION                0x00000004
#define _PWMEVTE_EVTESEL_MASK                    0x000000F0
#define _PWMEVTE_EVTESEL_LENGTH                  0x00000004

#define _PWMEVTE_EVTESYNC_POSITION               0x0000000C
#define _PWMEVTE_EVTESYNC_MASK                   0x00001000
#define _PWMEVTE_EVTESYNC_LENGTH                 0x00000001

#define _PWMEVTE_EVTESTRD_POSITION               0x0000000D
#define _PWMEVTE_EVTESTRD_MASK                   0x00002000
#define _PWMEVTE_EVTESTRD_LENGTH                 0x00000001

#define _PWMEVTE_EVTEPOL_POSITION                0x0000000E
#define _PWMEVTE_EVTEPOL_MASK                    0x00004000
#define _PWMEVTE_EVTEPOL_LENGTH                  0x00000001

#define _PWMEVTE_EVTEOEN_POSITION                0x0000000F
#define _PWMEVTE_EVTEOEN_MASK                    0x00008000
#define _PWMEVTE_EVTEOEN_LENGTH                  0x00000001

#define _PWMEVTF_EVTFPGS_POSITION                0x00000000
#define _PWMEVTF_EVTFPGS_MASK                    0x00000007
#define _PWMEVTF_EVTFPGS_LENGTH                  0x00000003

#define _PWMEVTF_EVTFSEL_POSITION                0x00000004
#define _PWMEVTF_EVTFSEL_MASK                    0x000000F0
#define _PWMEVTF_EVTFSEL_LENGTH                  0x00000004

#define _PWMEVTF_EVTFSYNC_POSITION               0x0000000C
#define _PWMEVTF_EVTFSYNC_MASK                   0x00001000
#define _PWMEVTF_EVTFSYNC_LENGTH                 0x00000001

#define _PWMEVTF_EVTFSTRD_POSITION               0x0000000D
#define _PWMEVTF_EVTFSTRD_MASK                   0x00002000
#define _PWMEVTF_EVTFSTRD_LENGTH                 0x00000001

#define _PWMEVTF_EVTFPOL_POSITION                0x0000000E
#define _PWMEVTF_EVTFPOL_MASK                    0x00004000
#define _PWMEVTF_EVTFPOL_LENGTH                  0x00000001

#define _PWMEVTF_EVTFOEN_POSITION                0x0000000F
#define _PWMEVTF_EVTFOEN_MASK                    0x00008000
#define _PWMEVTF_EVTFOEN_LENGTH                  0x00000001

#define _PG1CONL_MODSEL_POSITION                 0x00000000
#define _PG1CONL_MODSEL_MASK                     0x00000007
#define _PG1CONL_MODSEL_LENGTH                   0x00000003

#define _PG1CONL_CLKSEL_POSITION                 0x00000003
#define _PG1CONL_CLKSEL_MASK                     0x00000018
#define _PG1CONL_CLKSEL_LENGTH                   0x00000002

#define _PG1CONL_HREN_POSITION                   0x00000007
#define _PG1CONL_HREN_MASK                       0x00000080
#define _PG1CONL_HREN_LENGTH                     0x00000001

