wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PG3FPCIH_ACP_POSITION                   0x00000008
#define _PG3FPCIH_ACP_MASK                       0x00000700
#define _PG3FPCIH_ACP_LENGTH                     0x00000003

#define _PG3FPCIH_BPSEL_POSITION                 0x0000000C
#define _PG3FPCIH_BPSEL_MASK                     0x00007000
#define _PG3FPCIH_BPSEL_LENGTH                   0x00000003

#define _PG3FPCIH_BPEN_POSITION                  0x0000000F
#define _PG3FPCIH_BPEN_MASK                      0x00008000
#define _PG3FPCIH_BPEN_LENGTH                    0x00000001

#define _PG3CLPCIL_PSS_POSITION                  0x00000000
#define _PG3CLPCIL_PSS_MASK                      0x0000001F
#define _PG3CLPCIL_PSS_LENGTH                    0x00000005

#define _PG3CLPCIL_PPS_POSITION                  0x00000005
#define _PG3CLPCIL_PPS_MASK                      0x00000020
#define _PG3CLPCIL_PPS_LENGTH                    0x00000001

#define _PG3CLPCIL_PSYNC_POSITION                0x00000006
#define _PG3CLPCIL_PSYNC_MASK                    0x00000040
#define _PG3CLPCIL_PSYNC_LENGTH                  0x00000001

#define _PG3CLPCIL_SWTERM_POSITION               0x00000007
#define _PG3CLPCIL_SWTERM_MASK                   0x00000080
#define _PG3CLPCIL_SWTERM_LENGTH                 0x00000001

#define _PG3CLPCIL_AQSS_POSITION                 0x00000008
#define _PG3CLPCIL_AQSS_MASK                     0x00000700
#define _PG3CLPCIL_AQSS_LENGTH                   0x00000003

#define _PG3CLPCIL_AQPS_POSITION                 0x0000000B
#define _PG3CLPCIL_AQPS_MASK                     0x00000800
#define _PG3CLPCIL_AQPS_LENGTH                   0x00000001

#define _PG3CLPCIL_TERM_POSITION                 0x0000000C
#define _PG3CLPCIL_TERM_MASK                     0x00007000
#define _PG3CLPCIL_TERM_LENGTH                   0x00000003

#define _PG3CLPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG3CLPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG3CLPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG3CLPCIH_TQSS_POSITION                 0x00000000
#define _PG3CLPCIH_TQSS_MASK                     0x00000007
#define _PG3CLPCIH_TQSS_LENGTH                   0x00000003

#define _PG3CLPCIH_TQPS_POSITION                 0x00000003
#define _PG3CLPCIH_TQPS_MASK                     0x00000008
#define _PG3CLPCIH_TQPS_LENGTH                   0x00000001

#define _PG3CLPCIH_PCIGT_POSITION                0x00000004
#define _PG3CLPCIH_PCIGT_MASK                    0x00000010
#define _PG3CLPCIH_PCIGT_LENGTH                  0x00000001

#define _PG3CLPCIH_SWPCIM_POSITION               0x00000005
#define _PG3CLPCIH_SWPCIM_MASK                   0x00000060
#define _PG3CLPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG3CLPCIH_SWPCI_POSITION                0x00000007
#define _PG3CLPCIH_SWPCI_MASK                    0x00000080
#define _PG3CLPCIH_SWPCI_LENGTH                  0x00000001

#define _PG3CLPCIH_ACP_POSITION                  0x00000008
#define _PG3CLPCIH_ACP_MASK                      0x00000700
#define _PG3CLPCIH_ACP_LENGTH                    0x00000003

#define _PG3CLPCIH_BPSEL_POSITION                0x0000000C
#define _PG3CLPCIH_BPSEL_MASK                    0x00007000
#define _PG3CLPCIH_BPSEL_LENGTH                  0x00000003

#define _PG3CLPCIH_BPEN_POSITION                 0x0000000F
#define _PG3CLPCIH_BPEN_MASK                     0x00008000
#define _PG3CLPCIH_BPEN_LENGTH                   0x00000001

#define _PG3FFPCIL_PSS_POSITION                  0x00000000
#define _PG3FFPCIL_PSS_MASK                      0x0000001F
#define _PG3FFPCIL_PSS_LENGTH                    0x00000005

#define _PG3FFPCIL_PPS_POSITION                  0x00000005
#define _PG3FFPCIL_PPS_MASK                      0x00000020
#define _PG3FFPCIL_PPS_LENGTH                    0x00000001

#define _PG3FFPCIL_PSYNC_POSITION                0x00000006
#define _PG3FFPCIL_PSYNC_MASK                    0x00000040
#define _PG3FFPCIL_PSYNC_LENGTH                  0x00000001

#define _PG3FFPCIL_SWTERM_POSITION               0x00000007
#define _PG3FFPCIL_SWTERM_MASK                   0x00000080
#define _PG3FFPCIL_SWTERM_LENGTH                 0x00000001

#define _PG3FFPCIL_AQSS_POSITION                 0x00000008
#define _PG3FFPCIL_AQSS_MASK                     0x00000700
#define _PG3FFPCIL_AQSS_LENGTH                   0x00000003

#define _PG3FFPCIL_AQPS_POSITION                 0x0000000B
#define _PG3FFPCIL_AQPS_MASK                     0x00000800
#define _PG3FFPCIL_AQPS_LENGTH                   0x00000001

#define _PG3FFPCIL_TERM_POSITION                 0x0000000C
#define _PG3FFPCIL_TERM_MASK                     0x00007000
#define _PG3FFPCIL_TERM_LENGTH                   0x00000003

#define _PG3FFPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG3FFPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG3FFPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG3FFPCIH_TQSS_POSITION                 0x00000000
#define _PG3FFPCIH_TQSS_MASK                     0x00000007
#define _PG3FFPCIH_TQSS_LENGTH                   0x00000003

#define _PG3FFPCIH_TQPS_POSITION                 0x00000003
#define _PG3FFPCIH_TQPS_MASK                     0x00000008
#define _PG3FFPCIH_TQPS_LENGTH                   0x00000001

#define _PG3FFPCIH_PCIGT_POSITION                0x00000004
#define _PG3FFPCIH_PCIGT_MASK                    0x00000010
#define _PG3FFPCIH_PCIGT_LENGTH                  0x00000001

#define _PG3FFPCIH_SWPCIM_POSITION               0x00000005
#define _PG3FFPCIH_SWPCIM_MASK                   0x00000060
#define _PG3FFPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG3FFPCIH_SWPCI_POSITION                0x00000007
#define _PG3FFPCIH_SWPCI_MASK                    0x00000080
#define _PG3FFPCIH_SWPCI_LENGTH                  0x00000001

#define _PG3FFPCIH_ACP_POSITION                  0x00000008
#define _PG3FFPCIH_ACP_MASK                      0x00000700
#define _PG3FFPCIH_ACP_LENGTH                    0x00000003

#define _PG3FFPCIH_BPSEL_POSITION                0x0000000C
#define _PG3FFPCIH_BPSEL_MASK                    0x00007000
#define _PG3FFPCIH_BPSEL_LENGTH                  0x00000003

#define _PG3FFPCIH_BPEN_POSITION                 0x0000000F
#define _PG3FFPCIH_BPEN_MASK                     0x00008000
#define _PG3FFPCIH_BPEN_LENGTH                   0x00000001

#define _PG3SPCIL_PSS_POSITION                   0x00000000
#define _PG3SPCIL_PSS_MASK                       0x0000001F
#define _PG3SPCIL_PSS_LENGTH                     0x00000005

#define _PG3SPCIL_PPS_POSITION                   0x00000005
#define _PG3SPCIL_PPS_MASK                       0x00000020
#define _PG3SPCIL_PPS_LENGTH                     0x00000001

#define _PG3SPCIL_PSYNC_POSITION                 0x00000006
#define _PG3SPCIL_PSYNC_MASK                     0x00000040
#define _PG3SPCIL_PSYNC_LENGTH                   0x00000001

#define _PG3SPCIL_SWTERM_POSITION                0x00000007
#define _PG3SPCIL_SWTERM_MASK                    0x00000080
#define _PG3SPCIL_SWTERM_LENGTH                  0x00000001

#define _PG3SPCIL_AQSS_POSITION                  0x00000008
#define _PG3SPCIL_AQSS_MASK                      0x00000700
#define _PG3SPCIL_AQSS_LENGTH                    0x00000003

#define _PG3SPCIL_AQPS_POSITION                  0x0000000B
#define _PG3SPCIL_AQPS_MASK                      0x00000800
#define _PG3SPCIL_AQPS_LENGTH                    0x00000001

#define _PG3SPCIL_TERM_POSITION                  0x0000000C
#define _PG3SPCIL_TERM_MASK                      0x00007000
#define _PG3SPCIL_TERM_LENGTH                    0x00000003

#define _PG3SPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG3SPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG3SPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG3SPCIH_TQSS_POSITION                  0x00000000
#define _PG3SPCIH_TQSS_MASK                      0x00000007
#define _PG3SPCIH_TQSS_LENGTH                    0x00000003

#define _PG3SPCIH_TQPS_POSITION                  0x00000003
#define _PG3SPCIH_TQPS_MASK                      0x00000008
#define _PG3SPCIH_TQPS_LENGTH                    0x00000001

#define _PG3SPCIH_PCIGT_POSITION                 0x00000004
#define _PG3SPCIH_PCIGT_MASK                     0x00000010
#define _PG3SPCIH_PCIGT_LENGTH                   0x00000001

#define _PG3SPCIH_SWPCIM_POSITION                0x00000005
#define _PG3SPCIH_SWPCIM_MASK                    0x00000060
#define _PG3SPCIH_SWPCIM_LENGTH                  0x00000002

