wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PG4FPCIL_PPS_POSITION                   0x00000005
#define _PG4FPCIL_PPS_MASK                       0x00000020
#define _PG4FPCIL_PPS_LENGTH                     0x00000001

#define _PG4FPCIL_PSYNC_POSITION                 0x00000006
#define _PG4FPCIL_PSYNC_MASK                     0x00000040
#define _PG4FPCIL_PSYNC_LENGTH                   0x00000001

#define _PG4FPCIL_SWTERM_POSITION                0x00000007
#define _PG4FPCIL_SWTERM_MASK                    0x00000080
#define _PG4FPCIL_SWTERM_LENGTH                  0x00000001

#define _PG4FPCIL_AQSS_POSITION                  0x00000008
#define _PG4FPCIL_AQSS_MASK                      0x00000700
#define _PG4FPCIL_AQSS_LENGTH                    0x00000003

#define _PG4FPCIL_AQPS_POSITION                  0x0000000B
#define _PG4FPCIL_AQPS_MASK                      0x00000800
#define _PG4FPCIL_AQPS_LENGTH                    0x00000001

#define _PG4FPCIL_TERM_POSITION                  0x0000000C
#define _PG4FPCIL_TERM_MASK                      0x00007000
#define _PG4FPCIL_TERM_LENGTH                    0x00000003

#define _PG4FPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG4FPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG4FPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG4FPCIH_TQSS_POSITION                  0x00000000
#define _PG4FPCIH_TQSS_MASK                      0x00000007
#define _PG4FPCIH_TQSS_LENGTH                    0x00000003

#define _PG4FPCIH_TQPS_POSITION                  0x00000003
#define _PG4FPCIH_TQPS_MASK                      0x00000008
#define _PG4FPCIH_TQPS_LENGTH                    0x00000001

#define _PG4FPCIH_PCIGT_POSITION                 0x00000004
#define _PG4FPCIH_PCIGT_MASK                     0x00000010
#define _PG4FPCIH_PCIGT_LENGTH                   0x00000001

#define _PG4FPCIH_SWPCIM_POSITION                0x00000005
#define _PG4FPCIH_SWPCIM_MASK                    0x00000060
#define _PG4FPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG4FPCIH_SWPCI_POSITION                 0x00000007
#define _PG4FPCIH_SWPCI_MASK                     0x00000080
#define _PG4FPCIH_SWPCI_LENGTH                   0x00000001

#define _PG4FPCIH_ACP_POSITION                   0x00000008
#define _PG4FPCIH_ACP_MASK                       0x00000700
#define _PG4FPCIH_ACP_LENGTH                     0x00000003

#define _PG4FPCIH_BPSEL_POSITION                 0x0000000C
#define _PG4FPCIH_BPSEL_MASK                     0x00007000
#define _PG4FPCIH_BPSEL_LENGTH                   0x00000003

#define _PG4FPCIH_BPEN_POSITION                  0x0000000F
#define _PG4FPCIH_BPEN_MASK                      0x00008000
#define _PG4FPCIH_BPEN_LENGTH                    0x00000001

#define _PG4CLPCIL_PSS_POSITION                  0x00000000
#define _PG4CLPCIL_PSS_MASK                      0x0000001F
#define _PG4CLPCIL_PSS_LENGTH                    0x00000005

#define _PG4CLPCIL_PPS_POSITION                  0x00000005
#define _PG4CLPCIL_PPS_MASK                      0x00000020
#define _PG4CLPCIL_PPS_LENGTH                    0x00000001

#define _PG4CLPCIL_PSYNC_POSITION                0x00000006
#define _PG4CLPCIL_PSYNC_MASK                    0x00000040
#define _PG4CLPCIL_PSYNC_LENGTH                  0x00000001

#define _PG4CLPCIL_SWTERM_POSITION               0x00000007
#define _PG4CLPCIL_SWTERM_MASK                   0x00000080
#define _PG4CLPCIL_SWTERM_LENGTH                 0x00000001

#define _PG4CLPCIL_AQSS_POSITION                 0x00000008
#define _PG4CLPCIL_AQSS_MASK                     0x00000700
#define _PG4CLPCIL_AQSS_LENGTH                   0x00000003

#define _PG4CLPCIL_AQPS_POSITION                 0x0000000B
#define _PG4CLPCIL_AQPS_MASK                     0x00000800
#define _PG4CLPCIL_AQPS_LENGTH                   0x00000001

#define _PG4CLPCIL_TERM_POSITION                 0x0000000C
#define _PG4CLPCIL_TERM_MASK                     0x00007000
#define _PG4CLPCIL_TERM_LENGTH                   0x00000003

#define _PG4CLPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG4CLPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG4CLPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG4CLPCIH_TQSS_POSITION                 0x00000000
#define _PG4CLPCIH_TQSS_MASK                     0x00000007
#define _PG4CLPCIH_TQSS_LENGTH                   0x00000003

#define _PG4CLPCIH_TQPS_POSITION                 0x00000003
#define _PG4CLPCIH_TQPS_MASK                     0x00000008
#define _PG4CLPCIH_TQPS_LENGTH                   0x00000001

#define _PG4CLPCIH_PCIGT_POSITION                0x00000004
#define _PG4CLPCIH_PCIGT_MASK                    0x00000010
#define _PG4CLPCIH_PCIGT_LENGTH                  0x00000001

#define _PG4CLPCIH_SWPCIM_POSITION               0x00000005
#define _PG4CLPCIH_SWPCIM_MASK                   0x00000060
#define _PG4CLPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG4CLPCIH_SWPCI_POSITION                0x00000007
#define _PG4CLPCIH_SWPCI_MASK                    0x00000080
#define _PG4CLPCIH_SWPCI_LENGTH                  0x00000001

#define _PG4CLPCIH_ACP_POSITION                  0x00000008
#define _PG4CLPCIH_ACP_MASK                      0x00000700
#define _PG4CLPCIH_ACP_LENGTH                    0x00000003

#define _PG4CLPCIH_BPSEL_POSITION                0x0000000C
#define _PG4CLPCIH_BPSEL_MASK                    0x00007000
#define _PG4CLPCIH_BPSEL_LENGTH                  0x00000003

#define _PG4CLPCIH_BPEN_POSITION                 0x0000000F
#define _PG4CLPCIH_BPEN_MASK                     0x00008000
#define _PG4CLPCIH_BPEN_LENGTH                   0x00000001

#define _PG4FFPCIL_PSS_POSITION                  0x00000000
#define _PG4FFPCIL_PSS_MASK                      0x0000001F
#define _PG4FFPCIL_PSS_LENGTH                    0x00000005

#define _PG4FFPCIL_PPS_POSITION                  0x00000005
#define _PG4FFPCIL_PPS_MASK                      0x00000020
#define _PG4FFPCIL_PPS_LENGTH                    0x00000001

#define _PG4FFPCIL_PSYNC_POSITION                0x00000006
#define _PG4FFPCIL_PSYNC_MASK                    0x00000040
#define _PG4FFPCIL_PSYNC_LENGTH                  0x00000001

#define _PG4FFPCIL_SWTERM_POSITION               0x00000007
#define _PG4FFPCIL_SWTERM_MASK                   0x00000080
#define _PG4FFPCIL_SWTERM_LENGTH                 0x00000001

#define _PG4FFPCIL_AQSS_POSITION                 0x00000008
#define _PG4FFPCIL_AQSS_MASK                     0x00000700
#define _PG4FFPCIL_AQSS_LENGTH                   0x00000003

#define _PG4FFPCIL_AQPS_POSITION                 0x0000000B
#define _PG4FFPCIL_AQPS_MASK                     0x00000800
#define _PG4FFPCIL_AQPS_LENGTH                   0x00000001

#define _PG4FFPCIL_TERM_POSITION                 0x0000000C
#define _PG4FFPCIL_TERM_MASK                     0x00007000
#define _PG4FFPCIL_TERM_LENGTH                   0x00000003

#define _PG4FFPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG4FFPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG4FFPCIL_TSYNCDIS_LENGTH               0x00000001

