wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PG4FFPCIH_TQSS_POSITION                 0x00000000
#define _PG4FFPCIH_TQSS_MASK                     0x00000007
#define _PG4FFPCIH_TQSS_LENGTH                   0x00000003

#define _PG4FFPCIH_TQPS_POSITION                 0x00000003
#define _PG4FFPCIH_TQPS_MASK                     0x00000008
#define _PG4FFPCIH_TQPS_LENGTH                   0x00000001

#define _PG4FFPCIH_PCIGT_POSITION                0x00000004
#define _PG4FFPCIH_PCIGT_MASK                    0x00000010
#define _PG4FFPCIH_PCIGT_LENGTH                  0x00000001

#define _PG4FFPCIH_SWPCIM_POSITION               0x00000005
#define _PG4FFPCIH_SWPCIM_MASK                   0x00000060
#define _PG4FFPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG4FFPCIH_SWPCI_POSITION                0x00000007
#define _PG4FFPCIH_SWPCI_MASK                    0x00000080
#define _PG4FFPCIH_SWPCI_LENGTH                  0x00000001

#define _PG4FFPCIH_ACP_POSITION                  0x00000008
#define _PG4FFPCIH_ACP_MASK                      0x00000700
#define _PG4FFPCIH_ACP_LENGTH                    0x00000003

#define _PG4FFPCIH_BPSEL_POSITION                0x0000000C
#define _PG4FFPCIH_BPSEL_MASK                    0x00007000
#define _PG4FFPCIH_BPSEL_LENGTH                  0x00000003

#define _PG4FFPCIH_BPEN_POSITION                 0x0000000F
#define _PG4FFPCIH_BPEN_MASK                     0x00008000
#define _PG4FFPCIH_BPEN_LENGTH                   0x00000001

#define _PG4SPCIL_PSS_POSITION                   0x00000000
#define _PG4SPCIL_PSS_MASK                       0x0000001F
#define _PG4SPCIL_PSS_LENGTH                     0x00000005

#define _PG4SPCIL_PPS_POSITION                   0x00000005
#define _PG4SPCIL_PPS_MASK                       0x00000020
#define _PG4SPCIL_PPS_LENGTH                     0x00000001

#define _PG4SPCIL_PSYNC_POSITION                 0x00000006
#define _PG4SPCIL_PSYNC_MASK                     0x00000040
#define _PG4SPCIL_PSYNC_LENGTH                   0x00000001

#define _PG4SPCIL_SWTERM_POSITION                0x00000007
#define _PG4SPCIL_SWTERM_MASK                    0x00000080
#define _PG4SPCIL_SWTERM_LENGTH                  0x00000001

#define _PG4SPCIL_AQSS_POSITION                  0x00000008
#define _PG4SPCIL_AQSS_MASK                      0x00000700
#define _PG4SPCIL_AQSS_LENGTH                    0x00000003

#define _PG4SPCIL_AQPS_POSITION                  0x0000000B
#define _PG4SPCIL_AQPS_MASK                      0x00000800
#define _PG4SPCIL_AQPS_LENGTH                    0x00000001

#define _PG4SPCIL_TERM_POSITION                  0x0000000C
#define _PG4SPCIL_TERM_MASK                      0x00007000
#define _PG4SPCIL_TERM_LENGTH                    0x00000003

#define _PG4SPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG4SPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG4SPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG4SPCIH_TQSS_POSITION                  0x00000000
#define _PG4SPCIH_TQSS_MASK                      0x00000007
#define _PG4SPCIH_TQSS_LENGTH                    0x00000003

#define _PG4SPCIH_TQPS_POSITION                  0x00000003
#define _PG4SPCIH_TQPS_MASK                      0x00000008
#define _PG4SPCIH_TQPS_LENGTH                    0x00000001

#define _PG4SPCIH_PCIGT_POSITION                 0x00000004
#define _PG4SPCIH_PCIGT_MASK                     0x00000010
#define _PG4SPCIH_PCIGT_LENGTH                   0x00000001

#define _PG4SPCIH_SWPCIM_POSITION                0x00000005
#define _PG4SPCIH_SWPCIM_MASK                    0x00000060
#define _PG4SPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG4SPCIH_SWPCI_POSITION                 0x00000007
#define _PG4SPCIH_SWPCI_MASK                     0x00000080
#define _PG4SPCIH_SWPCI_LENGTH                   0x00000001

#define _PG4SPCIH_ACP_POSITION                   0x00000008
#define _PG4SPCIH_ACP_MASK                       0x00000700
#define _PG4SPCIH_ACP_LENGTH                     0x00000003

#define _PG4SPCIH_BPSEL_POSITION                 0x0000000C
#define _PG4SPCIH_BPSEL_MASK                     0x00007000
#define _PG4SPCIH_BPSEL_LENGTH                   0x00000003

#define _PG4SPCIH_BPEN_POSITION                  0x0000000F
#define _PG4SPCIH_BPEN_MASK                      0x00008000
#define _PG4SPCIH_BPEN_LENGTH                    0x00000001

#define _PG4LEBH_PLF_POSITION                    0x00000000
#define _PG4LEBH_PLF_MASK                        0x00000001
#define _PG4LEBH_PLF_LENGTH                      0x00000001

#define _PG4LEBH_PLR_POSITION                    0x00000001
#define _PG4LEBH_PLR_MASK                        0x00000002
#define _PG4LEBH_PLR_LENGTH                      0x00000001

#define _PG4LEBH_PHF_POSITION                    0x00000002
#define _PG4LEBH_PHF_MASK                        0x00000004
#define _PG4LEBH_PHF_LENGTH                      0x00000001

#define _PG4LEBH_PHR_POSITION                    0x00000003
#define _PG4LEBH_PHR_MASK                        0x00000008
#define _PG4LEBH_PHR_LENGTH                      0x00000001

#define _PG4LEBH_PWMPCI_POSITION                 0x00000008
#define _PG4LEBH_PWMPCI_MASK                     0x00000700
#define _PG4LEBH_PWMPCI_LENGTH                   0x00000003

#define _PG4DCA_DCA_POSITION                     0x00000000
#define _PG4DCA_DCA_MASK                         0x000000FF
#define _PG4DCA_DCA_LENGTH                       0x00000008

#define _PG4DTL_DTL_POSITION                     0x00000000
#define _PG4DTL_DTL_MASK                         0x00003FFF
#define _PG4DTL_DTL_LENGTH                       0x0000000E

#define _PG4DTH_DTH_POSITION                     0x00000000
#define _PG4DTH_DTH_MASK                         0x00003FFF
#define _PG4DTH_DTH_LENGTH                       0x0000000E

#define _PG5CONL_MODSEL_POSITION                 0x00000000
#define _PG5CONL_MODSEL_MASK                     0x00000007
#define _PG5CONL_MODSEL_LENGTH                   0x00000003

#define _PG5CONL_CLKSEL_POSITION                 0x00000003
#define _PG5CONL_CLKSEL_MASK                     0x00000018
#define _PG5CONL_CLKSEL_LENGTH                   0x00000002

#define _PG5CONL_HREN_POSITION                   0x00000007
#define _PG5CONL_HREN_MASK                       0x00000080
#define _PG5CONL_HREN_LENGTH                     0x00000001

