wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PG8STAT_SEVT_POSITION                   0x0000000F
#define _PG8STAT_SEVT_MASK                       0x00008000
#define _PG8STAT_SEVT_LENGTH                     0x00000001

#define _PG8IOCONL_DBDAT_POSITION                0x00000000
#define _PG8IOCONL_DBDAT_MASK                    0x00000003
#define _PG8IOCONL_DBDAT_LENGTH                  0x00000002

#define _PG8IOCONL_FFDAT_POSITION                0x00000002
#define _PG8IOCONL_FFDAT_MASK                    0x0000000C
#define _PG8IOCONL_FFDAT_LENGTH                  0x00000002

#define _PG8IOCONL_CLDAT_POSITION                0x00000004
#define _PG8IOCONL_CLDAT_MASK                    0x00000030
#define _PG8IOCONL_CLDAT_LENGTH                  0x00000002

#define _PG8IOCONL_FLTDAT_POSITION               0x00000006
#define _PG8IOCONL_FLTDAT_MASK                   0x000000C0
#define _PG8IOCONL_FLTDAT_LENGTH                 0x00000002

#define _PG8IOCONL_OSYNC_POSITION                0x00000008
#define _PG8IOCONL_OSYNC_MASK                    0x00000300
#define _PG8IOCONL_OSYNC_LENGTH                  0x00000002

#define _PG8IOCONL_OVRDAT_POSITION               0x0000000A
#define _PG8IOCONL_OVRDAT_MASK                   0x00000C00
#define _PG8IOCONL_OVRDAT_LENGTH                 0x00000002

#define _PG8IOCONL_OVRENL_POSITION               0x0000000C
#define _PG8IOCONL_OVRENL_MASK                   0x00001000
#define _PG8IOCONL_OVRENL_LENGTH                 0x00000001

#define _PG8IOCONL_OVRENH_POSITION               0x0000000D
#define _PG8IOCONL_OVRENH_MASK                   0x00002000
#define _PG8IOCONL_OVRENH_LENGTH                 0x00000001

#define _PG8IOCONL_SWAP_POSITION                 0x0000000E
#define _PG8IOCONL_SWAP_MASK                     0x00004000
#define _PG8IOCONL_SWAP_LENGTH                   0x00000001

#define _PG8IOCONL_CLMOD_POSITION                0x0000000F
#define _PG8IOCONL_CLMOD_MASK                    0x00008000
#define _PG8IOCONL_CLMOD_LENGTH                  0x00000001

#define _PG8IOCONH_POLL_POSITION                 0x00000000
#define _PG8IOCONH_POLL_MASK                     0x00000001
#define _PG8IOCONH_POLL_LENGTH                   0x00000001

#define _PG8IOCONH_POLH_POSITION                 0x00000001
#define _PG8IOCONH_POLH_MASK                     0x00000002
#define _PG8IOCONH_POLH_LENGTH                   0x00000001

#define _PG8IOCONH_PENL_POSITION                 0x00000002
#define _PG8IOCONH_PENL_MASK                     0x00000004
#define _PG8IOCONH_PENL_LENGTH                   0x00000001

#define _PG8IOCONH_PENH_POSITION                 0x00000003
#define _PG8IOCONH_PENH_MASK                     0x00000008
#define _PG8IOCONH_PENH_LENGTH                   0x00000001

#define _PG8IOCONH_PMOD_POSITION                 0x00000004
#define _PG8IOCONH_PMOD_MASK                     0x00000030
#define _PG8IOCONH_PMOD_LENGTH                   0x00000002

#define _PG8IOCONH_DTCMPSEL_POSITION             0x00000008
#define _PG8IOCONH_DTCMPSEL_MASK                 0x00000100
#define _PG8IOCONH_DTCMPSEL_LENGTH               0x00000001

#define _PG8IOCONH_CAPSRC_POSITION               0x0000000C
#define _PG8IOCONH_CAPSRC_MASK                   0x00007000
#define _PG8IOCONH_CAPSRC_LENGTH                 0x00000003

#define _PG8EVTL_PGTRGSEL_POSITION               0x00000000
#define _PG8EVTL_PGTRGSEL_MASK                   0x00000007
#define _PG8EVTL_PGTRGSEL_LENGTH                 0x00000003

#define _PG8EVTL_UPDTRG_POSITION                 0x00000003
#define _PG8EVTL_UPDTRG_MASK                     0x00000018
#define _PG8EVTL_UPDTRG_LENGTH                   0x00000002

#define _PG8EVTL_ADTR1EN1_POSITION               0x00000008
#define _PG8EVTL_ADTR1EN1_MASK                   0x00000100
#define _PG8EVTL_ADTR1EN1_LENGTH                 0x00000001

#define _PG8EVTL_ADTR1EN2_POSITION               0x00000009
#define _PG8EVTL_ADTR1EN2_MASK                   0x00000200
#define _PG8EVTL_ADTR1EN2_LENGTH                 0x00000001

#define _PG8EVTL_ADTR1EN3_POSITION               0x0000000A
#define _PG8EVTL_ADTR1EN3_MASK                   0x00000400
#define _PG8EVTL_ADTR1EN3_LENGTH                 0x00000001

#define _PG8EVTL_ADTR1PS_POSITION                0x0000000B
#define _PG8EVTL_ADTR1PS_MASK                    0x0000F800
#define _PG8EVTL_ADTR1PS_LENGTH                  0x00000005

#define _PG8EVTH_ADTR1OFS_POSITION               0x00000000
#define _PG8EVTH_ADTR1OFS_MASK                   0x0000001F
#define _PG8EVTH_ADTR1OFS_LENGTH                 0x00000005

#define _PG8EVTH_ADTR2EN1_POSITION               0x00000005
#define _PG8EVTH_ADTR2EN1_MASK                   0x00000020
#define _PG8EVTH_ADTR2EN1_LENGTH                 0x00000001

#define _PG8EVTH_ADTR2EN2_POSITION               0x00000006
#define _PG8EVTH_ADTR2EN2_MASK                   0x00000040
#define _PG8EVTH_ADTR2EN2_LENGTH                 0x00000001

#define _PG8EVTH_ADTR2EN3_POSITION               0x00000007
#define _PG8EVTH_ADTR2EN3_MASK                   0x00000080
#define _PG8EVTH_ADTR2EN3_LENGTH                 0x00000001

#define _PG8EVTH_IEVTSEL_POSITION                0x00000008
#define _PG8EVTH_IEVTSEL_MASK                    0x00000300
#define _PG8EVTH_IEVTSEL_LENGTH                  0x00000002

#define _PG8EVTH_SIEN_POSITION                   0x0000000C
#define _PG8EVTH_SIEN_MASK                       0x00001000
#define _PG8EVTH_SIEN_LENGTH                     0x00000001

#define _PG8EVTH_FFIEN_POSITION                  0x0000000D
#define _PG8EVTH_FFIEN_MASK                      0x00002000
#define _PG8EVTH_FFIEN_LENGTH                    0x00000001

#define _PG8EVTH_CLIEN_POSITION                  0x0000000E
#define _PG8EVTH_CLIEN_MASK                      0x00004000
#define _PG8EVTH_CLIEN_LENGTH                    0x00000001

#define _PG8EVTH_FLTIEN_POSITION                 0x0000000F
#define _PG8EVTH_FLTIEN_MASK                     0x00008000
#define _PG8EVTH_FLTIEN_LENGTH                   0x00000001

#define _PG8FPCIL_PSS_POSITION                   0x00000000
#define _PG8FPCIL_PSS_MASK                       0x0000001F
#define _PG8FPCIL_PSS_LENGTH                     0x00000005

#define _PG8FPCIL_PPS_POSITION                   0x00000005
#define _PG8FPCIL_PPS_MASK                       0x00000020
#define _PG8FPCIL_PPS_LENGTH                     0x00000001

#define _PG8FPCIL_PSYNC_POSITION                 0x00000006
#define _PG8FPCIL_PSYNC_MASK                     0x00000040
#define _PG8FPCIL_PSYNC_LENGTH                   0x00000001

#define _PG8FPCIL_SWTERM_POSITION                0x00000007
#define _PG8FPCIL_SWTERM_MASK                    0x00000080
#define _PG8FPCIL_SWTERM_LENGTH                  0x00000001

#define _PG8FPCIL_AQSS_POSITION                  0x00000008
#define _PG8FPCIL_AQSS_MASK                      0x00000700
#define _PG8FPCIL_AQSS_LENGTH                    0x00000003

#define _PG8FPCIL_AQPS_POSITION                  0x0000000B
#define _PG8FPCIL_AQPS_MASK                      0x00000800
#define _PG8FPCIL_AQPS_LENGTH                    0x00000001

#define _PG8FPCIL_TERM_POSITION                  0x0000000C
#define _PG8FPCIL_TERM_MASK                      0x00007000
#define _PG8FPCIL_TERM_LENGTH                    0x00000003

#define _PG8FPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG8FPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG8FPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG8FPCIH_TQSS_POSITION                  0x00000000
#define _PG8FPCIH_TQSS_MASK                      0x00000007
#define _PG8FPCIH_TQSS_LENGTH                    0x00000003

#define _PG8FPCIH_TQPS_POSITION                  0x00000003
#define _PG8FPCIH_TQPS_MASK                      0x00000008
#define _PG8FPCIH_TQPS_LENGTH                    0x00000001

#define _PG8FPCIH_PCIGT_POSITION                 0x00000004
#define _PG8FPCIH_PCIGT_MASK                     0x00000010
#define _PG8FPCIH_PCIGT_LENGTH                   0x00000001

#define _PG8FPCIH_SWPCIM_POSITION                0x00000005
#define _PG8FPCIH_SWPCIM_MASK                    0x00000060
#define _PG8FPCIH_SWPCIM_LENGTH                  0x00000002

