wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PG8SPCIL_PPS_POSITION                   0x00000005
#define _PG8SPCIL_PPS_MASK                       0x00000020
#define _PG8SPCIL_PPS_LENGTH                     0x00000001

#define _PG8SPCIL_PSYNC_POSITION                 0x00000006
#define _PG8SPCIL_PSYNC_MASK                     0x00000040
#define _PG8SPCIL_PSYNC_LENGTH                   0x00000001

#define _PG8SPCIL_SWTERM_POSITION                0x00000007
#define _PG8SPCIL_SWTERM_MASK                    0x00000080
#define _PG8SPCIL_SWTERM_LENGTH                  0x00000001

#define _PG8SPCIL_AQSS_POSITION                  0x00000008
#define _PG8SPCIL_AQSS_MASK                      0x00000700
#define _PG8SPCIL_AQSS_LENGTH                    0x00000003

#define _PG8SPCIL_AQPS_POSITION                  0x0000000B
#define _PG8SPCIL_AQPS_MASK                      0x00000800
#define _PG8SPCIL_AQPS_LENGTH                    0x00000001

#define _PG8SPCIL_TERM_POSITION                  0x0000000C
#define _PG8SPCIL_TERM_MASK                      0x00007000
#define _PG8SPCIL_TERM_LENGTH                    0x00000003

#define _PG8SPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG8SPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG8SPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG8SPCIH_TQSS_POSITION                  0x00000000
#define _PG8SPCIH_TQSS_MASK                      0x00000007
#define _PG8SPCIH_TQSS_LENGTH                    0x00000003

#define _PG8SPCIH_TQPS_POSITION                  0x00000003
#define _PG8SPCIH_TQPS_MASK                      0x00000008
#define _PG8SPCIH_TQPS_LENGTH                    0x00000001

#define _PG8SPCIH_PCIGT_POSITION                 0x00000004
#define _PG8SPCIH_PCIGT_MASK                     0x00000010
#define _PG8SPCIH_PCIGT_LENGTH                   0x00000001

#define _PG8SPCIH_SWPCIM_POSITION                0x00000005
#define _PG8SPCIH_SWPCIM_MASK                    0x00000060
#define _PG8SPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG8SPCIH_SWPCI_POSITION                 0x00000007
#define _PG8SPCIH_SWPCI_MASK                     0x00000080
#define _PG8SPCIH_SWPCI_LENGTH                   0x00000001

#define _PG8SPCIH_ACP_POSITION                   0x00000008
#define _PG8SPCIH_ACP_MASK                       0x00000700
#define _PG8SPCIH_ACP_LENGTH                     0x00000003

#define _PG8SPCIH_BPSEL_POSITION                 0x0000000C
#define _PG8SPCIH_BPSEL_MASK                     0x00007000
#define _PG8SPCIH_BPSEL_LENGTH                   0x00000003

#define _PG8SPCIH_BPEN_POSITION                  0x0000000F
#define _PG8SPCIH_BPEN_MASK                      0x00008000
#define _PG8SPCIH_BPEN_LENGTH                    0x00000001

#define _PG8LEBH_PLF_POSITION                    0x00000000
#define _PG8LEBH_PLF_MASK                        0x00000001
#define _PG8LEBH_PLF_LENGTH                      0x00000001

#define _PG8LEBH_PLR_POSITION                    0x00000001
#define _PG8LEBH_PLR_MASK                        0x00000002
#define _PG8LEBH_PLR_LENGTH                      0x00000001

#define _PG8LEBH_PHF_POSITION                    0x00000002
#define _PG8LEBH_PHF_MASK                        0x00000004
#define _PG8LEBH_PHF_LENGTH                      0x00000001

#define _PG8LEBH_PHR_POSITION                    0x00000003
#define _PG8LEBH_PHR_MASK                        0x00000008
#define _PG8LEBH_PHR_LENGTH                      0x00000001

#define _PG8LEBH_PWMPCI_POSITION                 0x00000008
#define _PG8LEBH_PWMPCI_MASK                     0x00000700
#define _PG8LEBH_PWMPCI_LENGTH                   0x00000003

#define _PG8DCA_DCA_POSITION                     0x00000000
#define _PG8DCA_DCA_MASK                         0x000000FF
#define _PG8DCA_DCA_LENGTH                       0x00000008

#define _PG8DTL_DTL_POSITION                     0x00000000
#define _PG8DTL_DTL_MASK                         0x00003FFF
#define _PG8DTL_DTL_LENGTH                       0x0000000E

#define _PG8DTH_DTH_POSITION                     0x00000000
#define _PG8DTH_DTH_MASK                         0x00003FFF
#define _PG8DTH_DTH_LENGTH                       0x0000000E

#define _C1CONL_DNCNT_POSITION                   0x00000000
#define _C1CONL_DNCNT_MASK                       0x0000001F
#define _C1CONL_DNCNT_LENGTH                     0x00000005

#define _C1CONL_ISOCRCEN_POSITION                0x00000005
#define _C1CONL_ISOCRCEN_MASK                    0x00000020
#define _C1CONL_ISOCRCEN_LENGTH                  0x00000001

#define _C1CONL_PXEDIS_POSITION                  0x00000006
#define _C1CONL_PXEDIS_MASK                      0x00000040
#define _C1CONL_PXEDIS_LENGTH                    0x00000001

#define _C1CONL_CLKSEL_POSITION                  0x00000007
#define _C1CONL_CLKSEL_MASK                      0x00000080
#define _C1CONL_CLKSEL_LENGTH                    0x00000001

#define _C1CONL_WAKFIL_POSITION                  0x00000008
#define _C1CONL_WAKFIL_MASK                      0x00000100
#define _C1CONL_WAKFIL_LENGTH                    0x00000001

#define _C1CONL_WFT_POSITION                     0x00000009
#define _C1CONL_WFT_MASK                         0x00000600
#define _C1CONL_WFT_LENGTH                       0x00000002

#define _C1CONL_BUSY_POSITION                    0x0000000B
#define _C1CONL_BUSY_MASK                        0x00000800
#define _C1CONL_BUSY_LENGTH                      0x00000001

#define _C1CONL_BRSDIS_POSITION                  0x0000000C
#define _C1CONL_BRSDIS_MASK                      0x00001000
#define _C1CONL_BRSDIS_LENGTH                    0x00000001

#define _C1CONL_SIDL_POSITION                    0x0000000D
#define _C1CONL_SIDL_MASK                        0x00002000
#define _C1CONL_SIDL_LENGTH                      0x00000001

#define _C1CONL_CON_POSITION                     0x0000000F
#define _C1CONL_CON_MASK                         0x00008000
#define _C1CONL_CON_LENGTH                       0x00000001

#define _C1CONL_DNCNT0_POSITION                  0x00000000
#define _C1CONL_DNCNT0_MASK                      0x00000001
#define _C1CONL_DNCNT0_LENGTH                    0x00000001

#define _C1CONL_DNCNT1_POSITION                  0x00000001
#define _C1CONL_DNCNT1_MASK                      0x00000002
#define _C1CONL_DNCNT1_LENGTH                    0x00000001

#define _C1CONL_DNCNT2_POSITION                  0x00000002
#define _C1CONL_DNCNT2_MASK                      0x00000004
#define _C1CONL_DNCNT2_LENGTH                    0x00000001

#define _C1CONL_DNCNT3_POSITION                  0x00000003
#define _C1CONL_DNCNT3_MASK                      0x00000008
#define _C1CONL_DNCNT3_LENGTH                    0x00000001

