wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1CONL_DNCNT4_POSITION                  0x00000004
#define _C1CONL_DNCNT4_MASK                      0x00000010
#define _C1CONL_DNCNT4_LENGTH                    0x00000001

#define _C1CONL_WFT0_POSITION                    0x00000009
#define _C1CONL_WFT0_MASK                        0x00000200
#define _C1CONL_WFT0_LENGTH                      0x00000001

#define _C1CONL_WFT1_POSITION                    0x0000000A
#define _C1CONL_WFT1_MASK                        0x00000400
#define _C1CONL_WFT1_LENGTH                      0x00000001

#define _C1CONH_RTXAT_POSITION                   0x00000000
#define _C1CONH_RTXAT_MASK                       0x00000001
#define _C1CONH_RTXAT_LENGTH                     0x00000001

#define _C1CONH_ESIGM_POSITION                   0x00000001
#define _C1CONH_ESIGM_MASK                       0x00000002
#define _C1CONH_ESIGM_LENGTH                     0x00000001

#define _C1CONH_SERRLOM_POSITION                 0x00000002
#define _C1CONH_SERRLOM_MASK                     0x00000004
#define _C1CONH_SERRLOM_LENGTH                   0x00000001

#define _C1CONH_STEF_POSITION                    0x00000003
#define _C1CONH_STEF_MASK                        0x00000008
#define _C1CONH_STEF_LENGTH                      0x00000001

#define _C1CONH_TXQEN_POSITION                   0x00000004
#define _C1CONH_TXQEN_MASK                       0x00000010
#define _C1CONH_TXQEN_LENGTH                     0x00000001

#define _C1CONH_OPMOD_POSITION                   0x00000005
#define _C1CONH_OPMOD_MASK                       0x000000E0
#define _C1CONH_OPMOD_LENGTH                     0x00000003

#define _C1CONH_REQOP_POSITION                   0x00000008
#define _C1CONH_REQOP_MASK                       0x00000700
#define _C1CONH_REQOP_LENGTH                     0x00000003

#define _C1CONH_ABAT_POSITION                    0x0000000B
#define _C1CONH_ABAT_MASK                        0x00000800
#define _C1CONH_ABAT_LENGTH                      0x00000001

#define _C1CONH_TXBWS_POSITION                   0x0000000C
#define _C1CONH_TXBWS_MASK                       0x0000F000
#define _C1CONH_TXBWS_LENGTH                     0x00000004

#define _C1CONH_OPMOD0_POSITION                  0x00000005
#define _C1CONH_OPMOD0_MASK                      0x00000020
#define _C1CONH_OPMOD0_LENGTH                    0x00000001

#define _C1CONH_OPMOD1_POSITION                  0x00000006
#define _C1CONH_OPMOD1_MASK                      0x00000040
#define _C1CONH_OPMOD1_LENGTH                    0x00000001

#define _C1CONH_OPMOD2_POSITION                  0x00000007
#define _C1CONH_OPMOD2_MASK                      0x00000080
#define _C1CONH_OPMOD2_LENGTH                    0x00000001

#define _C1CONH_REQOP0_POSITION                  0x00000008
#define _C1CONH_REQOP0_MASK                      0x00000100
#define _C1CONH_REQOP0_LENGTH                    0x00000001

#define _C1CONH_REQOP1_POSITION                  0x00000009
#define _C1CONH_REQOP1_MASK                      0x00000200
#define _C1CONH_REQOP1_LENGTH                    0x00000001

#define _C1CONH_REQOP2_POSITION                  0x0000000A
#define _C1CONH_REQOP2_MASK                      0x00000400
#define _C1CONH_REQOP2_LENGTH                    0x00000001

#define _C1CONH_TXBWS0_POSITION                  0x0000000C
#define _C1CONH_TXBWS0_MASK                      0x00001000
#define _C1CONH_TXBWS0_LENGTH                    0x00000001

#define _C1CONH_TXBWS1_POSITION                  0x0000000D
#define _C1CONH_TXBWS1_MASK                      0x00002000
#define _C1CONH_TXBWS1_LENGTH                    0x00000001

#define _C1CONH_TXBWS2_POSITION                  0x0000000E
#define _C1CONH_TXBWS2_MASK                      0x00004000
#define _C1CONH_TXBWS2_LENGTH                    0x00000001

#define _C1CONH_TXBWS3_POSITION                  0x0000000F
#define _C1CONH_TXBWS3_MASK                      0x00008000
#define _C1CONH_TXBWS3_LENGTH                    0x00000001

#define _C1NBTCFGL_SJW_POSITION                  0x00000000
#define _C1NBTCFGL_SJW_MASK                      0x0000007F
#define _C1NBTCFGL_SJW_LENGTH                    0x00000007

#define _C1NBTCFGL_TSEG2_POSITION                0x00000008
#define _C1NBTCFGL_TSEG2_MASK                    0x00007F00
#define _C1NBTCFGL_TSEG2_LENGTH                  0x00000007

#define _C1NBTCFGL_SJW0_POSITION                 0x00000000
#define _C1NBTCFGL_SJW0_MASK                     0x00000001
#define _C1NBTCFGL_SJW0_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW1_POSITION                 0x00000001
#define _C1NBTCFGL_SJW1_MASK                     0x00000002
#define _C1NBTCFGL_SJW1_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW2_POSITION                 0x00000002
#define _C1NBTCFGL_SJW2_MASK                     0x00000004
#define _C1NBTCFGL_SJW2_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW3_POSITION                 0x00000003
#define _C1NBTCFGL_SJW3_MASK                     0x00000008
#define _C1NBTCFGL_SJW3_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW4_POSITION                 0x00000004
#define _C1NBTCFGL_SJW4_MASK                     0x00000010
#define _C1NBTCFGL_SJW4_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW5_POSITION                 0x00000005
#define _C1NBTCFGL_SJW5_MASK                     0x00000020
#define _C1NBTCFGL_SJW5_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW6_POSITION                 0x00000006
#define _C1NBTCFGL_SJW6_MASK                     0x00000040
#define _C1NBTCFGL_SJW6_LENGTH                   0x00000001

#define _C1NBTCFGL_TSEG20_POSITION               0x00000008
#define _C1NBTCFGL_TSEG20_MASK                   0x00000100
#define _C1NBTCFGL_TSEG20_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG21_POSITION               0x00000009
#define _C1NBTCFGL_TSEG21_MASK                   0x00000200
#define _C1NBTCFGL_TSEG21_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG22_POSITION               0x0000000A
#define _C1NBTCFGL_TSEG22_MASK                   0x00000400
#define _C1NBTCFGL_TSEG22_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG23_POSITION               0x0000000B
#define _C1NBTCFGL_TSEG23_MASK                   0x00000800
#define _C1NBTCFGL_TSEG23_LENGTH                 0x00000001

