wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1NBTCFGL_TSEG24_POSITION               0x0000000C
#define _C1NBTCFGL_TSEG24_MASK                   0x00001000
#define _C1NBTCFGL_TSEG24_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG25_POSITION               0x0000000D
#define _C1NBTCFGL_TSEG25_MASK                   0x00002000
#define _C1NBTCFGL_TSEG25_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG26_POSITION               0x0000000E
#define _C1NBTCFGL_TSEG26_MASK                   0x00004000
#define _C1NBTCFGL_TSEG26_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG1_POSITION                0x00000000
#define _C1NBTCFGH_TSEG1_MASK                    0x000000FF
#define _C1NBTCFGH_TSEG1_LENGTH                  0x00000008

#define _C1NBTCFGH_BRP_POSITION                  0x00000008
#define _C1NBTCFGH_BRP_MASK                      0x0000FF00
#define _C1NBTCFGH_BRP_LENGTH                    0x00000008

#define _C1NBTCFGH_TSEG10_POSITION               0x00000000
#define _C1NBTCFGH_TSEG10_MASK                   0x00000001
#define _C1NBTCFGH_TSEG10_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG11_POSITION               0x00000001
#define _C1NBTCFGH_TSEG11_MASK                   0x00000002
#define _C1NBTCFGH_TSEG11_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG12_POSITION               0x00000002
#define _C1NBTCFGH_TSEG12_MASK                   0x00000004
#define _C1NBTCFGH_TSEG12_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG13_POSITION               0x00000003
#define _C1NBTCFGH_TSEG13_MASK                   0x00000008
#define _C1NBTCFGH_TSEG13_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG14_POSITION               0x00000004
#define _C1NBTCFGH_TSEG14_MASK                   0x00000010
#define _C1NBTCFGH_TSEG14_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG15_POSITION               0x00000005
#define _C1NBTCFGH_TSEG15_MASK                   0x00000020
#define _C1NBTCFGH_TSEG15_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG16_POSITION               0x00000006
#define _C1NBTCFGH_TSEG16_MASK                   0x00000040
#define _C1NBTCFGH_TSEG16_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG17_POSITION               0x00000007
#define _C1NBTCFGH_TSEG17_MASK                   0x00000080
#define _C1NBTCFGH_TSEG17_LENGTH                 0x00000001

#define _C1NBTCFGH_BRP0_POSITION                 0x00000008
#define _C1NBTCFGH_BRP0_MASK                     0x00000100
#define _C1NBTCFGH_BRP0_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP1_POSITION                 0x00000009
#define _C1NBTCFGH_BRP1_MASK                     0x00000200
#define _C1NBTCFGH_BRP1_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP2_POSITION                 0x0000000A
#define _C1NBTCFGH_BRP2_MASK                     0x00000400
#define _C1NBTCFGH_BRP2_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP3_POSITION                 0x0000000B
#define _C1NBTCFGH_BRP3_MASK                     0x00000800
#define _C1NBTCFGH_BRP3_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP4_POSITION                 0x0000000C
#define _C1NBTCFGH_BRP4_MASK                     0x00001000
#define _C1NBTCFGH_BRP4_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP5_POSITION                 0x0000000D
#define _C1NBTCFGH_BRP5_MASK                     0x00002000
#define _C1NBTCFGH_BRP5_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP6_POSITION                 0x0000000E
#define _C1NBTCFGH_BRP6_MASK                     0x00004000
#define _C1NBTCFGH_BRP6_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP7_POSITION                 0x0000000F
#define _C1NBTCFGH_BRP7_MASK                     0x00008000
#define _C1NBTCFGH_BRP7_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW_POSITION                  0x00000000
#define _C1DBTCFGL_SJW_MASK                      0x0000000F
#define _C1DBTCFGL_SJW_LENGTH                    0x00000004

#define _C1DBTCFGL_TSEG2_POSITION                0x00000008
#define _C1DBTCFGL_TSEG2_MASK                    0x00000F00
#define _C1DBTCFGL_TSEG2_LENGTH                  0x00000004

#define _C1DBTCFGL_SJW0_POSITION                 0x00000000
#define _C1DBTCFGL_SJW0_MASK                     0x00000001
#define _C1DBTCFGL_SJW0_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW1_POSITION                 0x00000001
#define _C1DBTCFGL_SJW1_MASK                     0x00000002
#define _C1DBTCFGL_SJW1_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW2_POSITION                 0x00000002
#define _C1DBTCFGL_SJW2_MASK                     0x00000004
#define _C1DBTCFGL_SJW2_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW3_POSITION                 0x00000003
#define _C1DBTCFGL_SJW3_MASK                     0x00000008
#define _C1DBTCFGL_SJW3_LENGTH                   0x00000001

#define _C1DBTCFGL_TSEG20_POSITION               0x00000008
#define _C1DBTCFGL_TSEG20_MASK                   0x00000100
#define _C1DBTCFGL_TSEG20_LENGTH                 0x00000001

#define _C1DBTCFGL_TSEG21_POSITION               0x00000009
#define _C1DBTCFGL_TSEG21_MASK                   0x00000200
#define _C1DBTCFGL_TSEG21_LENGTH                 0x00000001

#define _C1DBTCFGL_TSEG22_POSITION               0x0000000A
#define _C1DBTCFGL_TSEG22_MASK                   0x00000400
#define _C1DBTCFGL_TSEG22_LENGTH                 0x00000001

#define _C1DBTCFGL_TSEG23_POSITION               0x0000000B
#define _C1DBTCFGL_TSEG23_MASK                   0x00000800
#define _C1DBTCFGL_TSEG23_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG1_POSITION                0x00000000
#define _C1DBTCFGH_TSEG1_MASK                    0x0000001F
#define _C1DBTCFGH_TSEG1_LENGTH                  0x00000005

#define _C1DBTCFGH_BRP_POSITION                  0x00000008
#define _C1DBTCFGH_BRP_MASK                      0x0000FF00
#define _C1DBTCFGH_BRP_LENGTH                    0x00000008

#define _C1DBTCFGH_TSEG10_POSITION               0x00000000
#define _C1DBTCFGH_TSEG10_MASK                   0x00000001
#define _C1DBTCFGH_TSEG10_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG11_POSITION               0x00000001
#define _C1DBTCFGH_TSEG11_MASK                   0x00000002
#define _C1DBTCFGH_TSEG11_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG12_POSITION               0x00000002
#define _C1DBTCFGH_TSEG12_MASK                   0x00000004
#define _C1DBTCFGH_TSEG12_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG13_POSITION               0x00000003
#define _C1DBTCFGH_TSEG13_MASK                   0x00000008
#define _C1DBTCFGH_TSEG13_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG14_POSITION               0x00000004
#define _C1DBTCFGH_TSEG14_MASK                   0x00000010
#define _C1DBTCFGH_TSEG14_LENGTH                 0x00000001

