wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1DBTCFGH_BRP0_POSITION                 0x00000008
#define _C1DBTCFGH_BRP0_MASK                     0x00000100
#define _C1DBTCFGH_BRP0_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP1_POSITION                 0x00000009
#define _C1DBTCFGH_BRP1_MASK                     0x00000200
#define _C1DBTCFGH_BRP1_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP2_POSITION                 0x0000000A
#define _C1DBTCFGH_BRP2_MASK                     0x00000400
#define _C1DBTCFGH_BRP2_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP3_POSITION                 0x0000000B
#define _C1DBTCFGH_BRP3_MASK                     0x00000800
#define _C1DBTCFGH_BRP3_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP4_POSITION                 0x0000000C
#define _C1DBTCFGH_BRP4_MASK                     0x00001000
#define _C1DBTCFGH_BRP4_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP5_POSITION                 0x0000000D
#define _C1DBTCFGH_BRP5_MASK                     0x00002000
#define _C1DBTCFGH_BRP5_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP6_POSITION                 0x0000000E
#define _C1DBTCFGH_BRP6_MASK                     0x00004000
#define _C1DBTCFGH_BRP6_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP7_POSITION                 0x0000000F
#define _C1DBTCFGH_BRP7_MASK                     0x00008000
#define _C1DBTCFGH_BRP7_LENGTH                   0x00000001

#define _C1TDCL_TDCV_POSITION                    0x00000000
#define _C1TDCL_TDCV_MASK                        0x0000003F
#define _C1TDCL_TDCV_LENGTH                      0x00000006

#define _C1TDCL_TDCO_POSITION                    0x00000008
#define _C1TDCL_TDCO_MASK                        0x00007F00
#define _C1TDCL_TDCO_LENGTH                      0x00000007

#define _C1TDCL_TDCV0_POSITION                   0x00000000
#define _C1TDCL_TDCV0_MASK                       0x00000001
#define _C1TDCL_TDCV0_LENGTH                     0x00000001

#define _C1TDCL_TDCV1_POSITION                   0x00000001
#define _C1TDCL_TDCV1_MASK                       0x00000002
#define _C1TDCL_TDCV1_LENGTH                     0x00000001

#define _C1TDCL_TDCV2_POSITION                   0x00000002
#define _C1TDCL_TDCV2_MASK                       0x00000004
#define _C1TDCL_TDCV2_LENGTH                     0x00000001

#define _C1TDCL_TDCV3_POSITION                   0x00000003
#define _C1TDCL_TDCV3_MASK                       0x00000008
#define _C1TDCL_TDCV3_LENGTH                     0x00000001

#define _C1TDCL_TDCV4_POSITION                   0x00000004
#define _C1TDCL_TDCV4_MASK                       0x00000010
#define _C1TDCL_TDCV4_LENGTH                     0x00000001

#define _C1TDCL_TDCV5_POSITION                   0x00000005
#define _C1TDCL_TDCV5_MASK                       0x00000020
#define _C1TDCL_TDCV5_LENGTH                     0x00000001

#define _C1TDCL_TDCO0_POSITION                   0x00000008
#define _C1TDCL_TDCO0_MASK                       0x00000100
#define _C1TDCL_TDCO0_LENGTH                     0x00000001

#define _C1TDCL_TDCO1_POSITION                   0x00000009
#define _C1TDCL_TDCO1_MASK                       0x00000200
#define _C1TDCL_TDCO1_LENGTH                     0x00000001

#define _C1TDCL_TDCO2_POSITION                   0x0000000A
#define _C1TDCL_TDCO2_MASK                       0x00000400
#define _C1TDCL_TDCO2_LENGTH                     0x00000001

#define _C1TDCL_TDCO3_POSITION                   0x0000000B
#define _C1TDCL_TDCO3_MASK                       0x00000800
#define _C1TDCL_TDCO3_LENGTH                     0x00000001

#define _C1TDCL_TDCO4_POSITION                   0x0000000C
#define _C1TDCL_TDCO4_MASK                       0x00001000
#define _C1TDCL_TDCO4_LENGTH                     0x00000001

#define _C1TDCL_TDCO5_POSITION                   0x0000000D
#define _C1TDCL_TDCO5_MASK                       0x00002000
#define _C1TDCL_TDCO5_LENGTH                     0x00000001

#define _C1TDCL_TDCO6_POSITION                   0x0000000E
#define _C1TDCL_TDCO6_MASK                       0x00004000
#define _C1TDCL_TDCO6_LENGTH                     0x00000001

#define _C1TDCH_TDCMOD_POSITION                  0x00000000
#define _C1TDCH_TDCMOD_MASK                      0x00000003
#define _C1TDCH_TDCMOD_LENGTH                    0x00000002

#define _C1TDCH_SID11EN_POSITION                 0x00000008
#define _C1TDCH_SID11EN_MASK                     0x00000100
#define _C1TDCH_SID11EN_LENGTH                   0x00000001

#define _C1TDCH_EDGFLTEN_POSITION                0x00000009
#define _C1TDCH_EDGFLTEN_MASK                    0x00000200
#define _C1TDCH_EDGFLTEN_LENGTH                  0x00000001

#define _C1TDCH_TDCMOD0_POSITION                 0x00000000
#define _C1TDCH_TDCMOD0_MASK                     0x00000001
#define _C1TDCH_TDCMOD0_LENGTH                   0x00000001

#define _C1TDCH_TDCMOD1_POSITION                 0x00000001
#define _C1TDCH_TDCMOD1_MASK                     0x00000002
#define _C1TDCH_TDCMOD1_LENGTH                   0x00000001

#define _C1TBCL_TBC0_POSITION                    0x00000000
#define _C1TBCL_TBC0_MASK                        0x00000001
#define _C1TBCL_TBC0_LENGTH                      0x00000001

#define _C1TBCL_TBC1_POSITION                    0x00000001
#define _C1TBCL_TBC1_MASK                        0x00000002
#define _C1TBCL_TBC1_LENGTH                      0x00000001

#define _C1TBCL_TBC2_POSITION                    0x00000002
#define _C1TBCL_TBC2_MASK                        0x00000004
#define _C1TBCL_TBC2_LENGTH                      0x00000001

#define _C1TBCL_TBC3_POSITION                    0x00000003
#define _C1TBCL_TBC3_MASK                        0x00000008
#define _C1TBCL_TBC3_LENGTH                      0x00000001

#define _C1TBCL_TBC4_POSITION                    0x00000004
#define _C1TBCL_TBC4_MASK                        0x00000010
#define _C1TBCL_TBC4_LENGTH                      0x00000001

#define _C1TBCL_TBC5_POSITION                    0x00000005
#define _C1TBCL_TBC5_MASK                        0x00000020
#define _C1TBCL_TBC5_LENGTH                      0x00000001

#define _C1TBCL_TBC6_POSITION                    0x00000006
#define _C1TBCL_TBC6_MASK                        0x00000040
#define _C1TBCL_TBC6_LENGTH                      0x00000001

#define _C1TBCL_TBC7_POSITION                    0x00000007
#define _C1TBCL_TBC7_MASK                        0x00000080
#define _C1TBCL_TBC7_LENGTH                      0x00000001

#define _C1TBCL_TBC8_POSITION                    0x00000008
#define _C1TBCL_TBC8_MASK                        0x00000100
#define _C1TBCL_TBC8_LENGTH                      0x00000001

#define _C1TBCL_TBC9_POSITION                    0x00000009
#define _C1TBCL_TBC9_MASK                        0x00000200
#define _C1TBCL_TBC9_LENGTH                      0x00000001

