wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TBCL_TBC10_POSITION                   0x0000000A
#define _C1TBCL_TBC10_MASK                       0x00000400
#define _C1TBCL_TBC10_LENGTH                     0x00000001

#define _C1TBCL_TBC11_POSITION                   0x0000000B
#define _C1TBCL_TBC11_MASK                       0x00000800
#define _C1TBCL_TBC11_LENGTH                     0x00000001

#define _C1TBCL_TBC12_POSITION                   0x0000000C
#define _C1TBCL_TBC12_MASK                       0x00001000
#define _C1TBCL_TBC12_LENGTH                     0x00000001

#define _C1TBCL_TBC13_POSITION                   0x0000000D
#define _C1TBCL_TBC13_MASK                       0x00002000
#define _C1TBCL_TBC13_LENGTH                     0x00000001

#define _C1TBCL_TBC14_POSITION                   0x0000000E
#define _C1TBCL_TBC14_MASK                       0x00004000
#define _C1TBCL_TBC14_LENGTH                     0x00000001

#define _C1TBCL_TBC15_POSITION                   0x0000000F
#define _C1TBCL_TBC15_MASK                       0x00008000
#define _C1TBCL_TBC15_LENGTH                     0x00000001

#define _C1TBCH_TBC16_POSITION                   0x00000000
#define _C1TBCH_TBC16_MASK                       0x00000001
#define _C1TBCH_TBC16_LENGTH                     0x00000001

#define _C1TBCH_TBC17_POSITION                   0x00000001
#define _C1TBCH_TBC17_MASK                       0x00000002
#define _C1TBCH_TBC17_LENGTH                     0x00000001

#define _C1TBCH_TBC18_POSITION                   0x00000002
#define _C1TBCH_TBC18_MASK                       0x00000004
#define _C1TBCH_TBC18_LENGTH                     0x00000001

#define _C1TBCH_TBC19_POSITION                   0x00000003
#define _C1TBCH_TBC19_MASK                       0x00000008
#define _C1TBCH_TBC19_LENGTH                     0x00000001

#define _C1TBCH_TBC20_POSITION                   0x00000004
#define _C1TBCH_TBC20_MASK                       0x00000010
#define _C1TBCH_TBC20_LENGTH                     0x00000001

#define _C1TBCH_TBC21_POSITION                   0x00000005
#define _C1TBCH_TBC21_MASK                       0x00000020
#define _C1TBCH_TBC21_LENGTH                     0x00000001

#define _C1TBCH_TBC22_POSITION                   0x00000006
#define _C1TBCH_TBC22_MASK                       0x00000040
#define _C1TBCH_TBC22_LENGTH                     0x00000001

#define _C1TBCH_TBC23_POSITION                   0x00000007
#define _C1TBCH_TBC23_MASK                       0x00000080
#define _C1TBCH_TBC23_LENGTH                     0x00000001

#define _C1TBCH_TBC24_POSITION                   0x00000008
#define _C1TBCH_TBC24_MASK                       0x00000100
#define _C1TBCH_TBC24_LENGTH                     0x00000001

#define _C1TBCH_TBC25_POSITION                   0x00000009
#define _C1TBCH_TBC25_MASK                       0x00000200
#define _C1TBCH_TBC25_LENGTH                     0x00000001

#define _C1TBCH_TBC26_POSITION                   0x0000000A
#define _C1TBCH_TBC26_MASK                       0x00000400
#define _C1TBCH_TBC26_LENGTH                     0x00000001

#define _C1TBCH_TBC27_POSITION                   0x0000000B
#define _C1TBCH_TBC27_MASK                       0x00000800
#define _C1TBCH_TBC27_LENGTH                     0x00000001

#define _C1TBCH_TBC28_POSITION                   0x0000000C
#define _C1TBCH_TBC28_MASK                       0x00001000
#define _C1TBCH_TBC28_LENGTH                     0x00000001

#define _C1TBCH_TBC29_POSITION                   0x0000000D
#define _C1TBCH_TBC29_MASK                       0x00002000
#define _C1TBCH_TBC29_LENGTH                     0x00000001

#define _C1TBCH_TBC30_POSITION                   0x0000000E
#define _C1TBCH_TBC30_MASK                       0x00004000
#define _C1TBCH_TBC30_LENGTH                     0x00000001

#define _C1TBCH_TBC31_POSITION                   0x0000000F
#define _C1TBCH_TBC31_MASK                       0x00008000
#define _C1TBCH_TBC31_LENGTH                     0x00000001

#define _C1TSCONL_TBCPRE_POSITION                0x00000000
#define _C1TSCONL_TBCPRE_MASK                    0x000003FF
#define _C1TSCONL_TBCPRE_LENGTH                  0x0000000A

#define _C1TSCONL_TBCPRE0_POSITION               0x00000000
#define _C1TSCONL_TBCPRE0_MASK                   0x00000001
#define _C1TSCONL_TBCPRE0_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE1_POSITION               0x00000001
#define _C1TSCONL_TBCPRE1_MASK                   0x00000002
#define _C1TSCONL_TBCPRE1_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE2_POSITION               0x00000002
#define _C1TSCONL_TBCPRE2_MASK                   0x00000004
#define _C1TSCONL_TBCPRE2_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE3_POSITION               0x00000003
#define _C1TSCONL_TBCPRE3_MASK                   0x00000008
#define _C1TSCONL_TBCPRE3_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE4_POSITION               0x00000004
#define _C1TSCONL_TBCPRE4_MASK                   0x00000010
#define _C1TSCONL_TBCPRE4_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE5_POSITION               0x00000005
#define _C1TSCONL_TBCPRE5_MASK                   0x00000020
#define _C1TSCONL_TBCPRE5_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE6_POSITION               0x00000006
#define _C1TSCONL_TBCPRE6_MASK                   0x00000040
#define _C1TSCONL_TBCPRE6_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE7_POSITION               0x00000007
#define _C1TSCONL_TBCPRE7_MASK                   0x00000080
#define _C1TSCONL_TBCPRE7_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE8_POSITION               0x00000008
#define _C1TSCONL_TBCPRE8_MASK                   0x00000100
#define _C1TSCONL_TBCPRE8_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE9_POSITION               0x00000009
#define _C1TSCONL_TBCPRE9_MASK                   0x00000200
#define _C1TSCONL_TBCPRE9_LENGTH                 0x00000001

#define _C1TSCONH_TBCEN_POSITION                 0x00000000
#define _C1TSCONH_TBCEN_MASK                     0x00000001
#define _C1TSCONH_TBCEN_LENGTH                   0x00000001

