wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TSCONH_TSEOF_POSITION                 0x00000001
#define _C1TSCONH_TSEOF_MASK                     0x00000002
#define _C1TSCONH_TSEOF_LENGTH                   0x00000001

#define _C1TSCONH_TSRES_POSITION                 0x00000002
#define _C1TSCONH_TSRES_MASK                     0x00000004
#define _C1TSCONH_TSRES_LENGTH                   0x00000001

#define _C1VECL_ICODE_POSITION                   0x00000000
#define _C1VECL_ICODE_MASK                       0x0000007F
#define _C1VECL_ICODE_LENGTH                     0x00000007

#define _C1VECL_FILHIT_POSITION                  0x00000008
#define _C1VECL_FILHIT_MASK                      0x00001F00
#define _C1VECL_FILHIT_LENGTH                    0x00000005

#define _C1VECL_ICODE0_POSITION                  0x00000000
#define _C1VECL_ICODE0_MASK                      0x00000001
#define _C1VECL_ICODE0_LENGTH                    0x00000001

#define _C1VECL_ICODE1_POSITION                  0x00000001
#define _C1VECL_ICODE1_MASK                      0x00000002
#define _C1VECL_ICODE1_LENGTH                    0x00000001

#define _C1VECL_ICODE2_POSITION                  0x00000002
#define _C1VECL_ICODE2_MASK                      0x00000004
#define _C1VECL_ICODE2_LENGTH                    0x00000001

#define _C1VECL_ICODE3_POSITION                  0x00000003
#define _C1VECL_ICODE3_MASK                      0x00000008
#define _C1VECL_ICODE3_LENGTH                    0x00000001

#define _C1VECL_ICODE4_POSITION                  0x00000004
#define _C1VECL_ICODE4_MASK                      0x00000010
#define _C1VECL_ICODE4_LENGTH                    0x00000001

#define _C1VECL_ICODE5_POSITION                  0x00000005
#define _C1VECL_ICODE5_MASK                      0x00000020
#define _C1VECL_ICODE5_LENGTH                    0x00000001

#define _C1VECL_ICODE6_POSITION                  0x00000006
#define _C1VECL_ICODE6_MASK                      0x00000040
#define _C1VECL_ICODE6_LENGTH                    0x00000001

#define _C1VECL_FILHIT0_POSITION                 0x00000008
#define _C1VECL_FILHIT0_MASK                     0x00000100
#define _C1VECL_FILHIT0_LENGTH                   0x00000001

#define _C1VECL_FILHIT1_POSITION                 0x00000009
#define _C1VECL_FILHIT1_MASK                     0x00000200
#define _C1VECL_FILHIT1_LENGTH                   0x00000001

#define _C1VECL_FILHIT2_POSITION                 0x0000000A
#define _C1VECL_FILHIT2_MASK                     0x00000400
#define _C1VECL_FILHIT2_LENGTH                   0x00000001

#define _C1VECL_FILHIT3_POSITION                 0x0000000B
#define _C1VECL_FILHIT3_MASK                     0x00000800
#define _C1VECL_FILHIT3_LENGTH                   0x00000001

#define _C1VECL_FILHIT4_POSITION                 0x0000000C
#define _C1VECL_FILHIT4_MASK                     0x00001000
#define _C1VECL_FILHIT4_LENGTH                   0x00000001

#define _C1VECH_TXCODE_POSITION                  0x00000000
#define _C1VECH_TXCODE_MASK                      0x0000007F
#define _C1VECH_TXCODE_LENGTH                    0x00000007

#define _C1VECH_RXCODE_POSITION                  0x00000008
#define _C1VECH_RXCODE_MASK                      0x00007F00
#define _C1VECH_RXCODE_LENGTH                    0x00000007

#define _C1VECH_TXCODE0_POSITION                 0x00000000
#define _C1VECH_TXCODE0_MASK                     0x00000001
#define _C1VECH_TXCODE0_LENGTH                   0x00000001

#define _C1VECH_TXCODE1_POSITION                 0x00000001
#define _C1VECH_TXCODE1_MASK                     0x00000002
#define _C1VECH_TXCODE1_LENGTH                   0x00000001

#define _C1VECH_TXCODE2_POSITION                 0x00000002
#define _C1VECH_TXCODE2_MASK                     0x00000004
#define _C1VECH_TXCODE2_LENGTH                   0x00000001

#define _C1VECH_TXCODE3_POSITION                 0x00000003
#define _C1VECH_TXCODE3_MASK                     0x00000008
#define _C1VECH_TXCODE3_LENGTH                   0x00000001

#define _C1VECH_TXCODE4_POSITION                 0x00000004
#define _C1VECH_TXCODE4_MASK                     0x00000010
#define _C1VECH_TXCODE4_LENGTH                   0x00000001

#define _C1VECH_TXCODE5_POSITION                 0x00000005
#define _C1VECH_TXCODE5_MASK                     0x00000020
#define _C1VECH_TXCODE5_LENGTH                   0x00000001

#define _C1VECH_TXCODE6_POSITION                 0x00000006
#define _C1VECH_TXCODE6_MASK                     0x00000040
#define _C1VECH_TXCODE6_LENGTH                   0x00000001

#define _C1VECH_RXCODE0_POSITION                 0x00000008
#define _C1VECH_RXCODE0_MASK                     0x00000100
#define _C1VECH_RXCODE0_LENGTH                   0x00000001

#define _C1VECH_RXCODE1_POSITION                 0x00000009
#define _C1VECH_RXCODE1_MASK                     0x00000200
#define _C1VECH_RXCODE1_LENGTH                   0x00000001

#define _C1VECH_RXCODE2_POSITION                 0x0000000A
#define _C1VECH_RXCODE2_MASK                     0x00000400
#define _C1VECH_RXCODE2_LENGTH                   0x00000001

#define _C1VECH_RXCODE3_POSITION                 0x0000000B
#define _C1VECH_RXCODE3_MASK                     0x00000800
#define _C1VECH_RXCODE3_LENGTH                   0x00000001

#define _C1VECH_RXCODE4_POSITION                 0x0000000C
#define _C1VECH_RXCODE4_MASK                     0x00001000
#define _C1VECH_RXCODE4_LENGTH                   0x00000001

#define _C1VECH_RXCODE5_POSITION                 0x0000000D
#define _C1VECH_RXCODE5_MASK                     0x00002000
#define _C1VECH_RXCODE5_LENGTH                   0x00000001

#define _C1VECH_RXCODE6_POSITION                 0x0000000E
#define _C1VECH_RXCODE6_MASK                     0x00004000
#define _C1VECH_RXCODE6_LENGTH                   0x00000001

#define _C1INTL_TXIF_POSITION                    0x00000000
#define _C1INTL_TXIF_MASK                        0x00000001
#define _C1INTL_TXIF_LENGTH                      0x00000001

#define _C1INTL_RXIF_POSITION                    0x00000001
#define _C1INTL_RXIF_MASK                        0x00000002
#define _C1INTL_RXIF_LENGTH                      0x00000001

#define _C1INTL_TBCIF_POSITION                   0x00000002
#define _C1INTL_TBCIF_MASK                       0x00000004
#define _C1INTL_TBCIF_LENGTH                     0x00000001

#define _C1INTL_MODIF_POSITION                   0x00000003
#define _C1INTL_MODIF_MASK                       0x00000008
#define _C1INTL_MODIF_LENGTH                     0x00000001

#define _C1INTL_TEFIF_POSITION                   0x00000004
#define _C1INTL_TEFIF_MASK                       0x00000010
#define _C1INTL_TEFIF_LENGTH                     0x00000001

#define _C1INTL_TXATIF_POSITION                  0x0000000A
#define _C1INTL_TXATIF_MASK                      0x00000400
#define _C1INTL_TXATIF_LENGTH                    0x00000001

#define _C1INTL_RXOVIF_POSITION                  0x0000000B
#define _C1INTL_RXOVIF_MASK                      0x00000800
#define _C1INTL_RXOVIF_LENGTH                    0x00000001

#define _C1INTL_SERRIF_POSITION                  0x0000000C
#define _C1INTL_SERRIF_MASK                      0x00001000
#define _C1INTL_SERRIF_LENGTH                    0x00000001

#define _C1INTL_CERRIF_POSITION                  0x0000000D
#define _C1INTL_CERRIF_MASK                      0x00002000
#define _C1INTL_CERRIF_LENGTH                    0x00000001

