wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1INTL_WAKIF_POSITION                   0x0000000E
#define _C1INTL_WAKIF_MASK                       0x00004000
#define _C1INTL_WAKIF_LENGTH                     0x00000001

#define _C1INTL_IVMIF_POSITION                   0x0000000F
#define _C1INTL_IVMIF_MASK                       0x00008000
#define _C1INTL_IVMIF_LENGTH                     0x00000001

#define _C1INTH_TXIE_POSITION                    0x00000000
#define _C1INTH_TXIE_MASK                        0x00000001
#define _C1INTH_TXIE_LENGTH                      0x00000001

#define _C1INTH_RXIE_POSITION                    0x00000001
#define _C1INTH_RXIE_MASK                        0x00000002
#define _C1INTH_RXIE_LENGTH                      0x00000001

#define _C1INTH_TBCIE_POSITION                   0x00000002
#define _C1INTH_TBCIE_MASK                       0x00000004
#define _C1INTH_TBCIE_LENGTH                     0x00000001

#define _C1INTH_MODIE_POSITION                   0x00000003
#define _C1INTH_MODIE_MASK                       0x00000008
#define _C1INTH_MODIE_LENGTH                     0x00000001

#define _C1INTH_TEFIE_POSITION                   0x00000004
#define _C1INTH_TEFIE_MASK                       0x00000010
#define _C1INTH_TEFIE_LENGTH                     0x00000001

#define _C1INTH_TXATIE_POSITION                  0x0000000A
#define _C1INTH_TXATIE_MASK                      0x00000400
#define _C1INTH_TXATIE_LENGTH                    0x00000001

#define _C1INTH_RXOVIE_POSITION                  0x0000000B
#define _C1INTH_RXOVIE_MASK                      0x00000800
#define _C1INTH_RXOVIE_LENGTH                    0x00000001

#define _C1INTH_SERRIE_POSITION                  0x0000000C
#define _C1INTH_SERRIE_MASK                      0x00001000
#define _C1INTH_SERRIE_LENGTH                    0x00000001

#define _C1INTH_CERRIE_POSITION                  0x0000000D
#define _C1INTH_CERRIE_MASK                      0x00002000
#define _C1INTH_CERRIE_LENGTH                    0x00000001

#define _C1INTH_WAKIE_POSITION                   0x0000000E
#define _C1INTH_WAKIE_MASK                       0x00004000
#define _C1INTH_WAKIE_LENGTH                     0x00000001

#define _C1INTH_IVMIE_POSITION                   0x0000000F
#define _C1INTH_IVMIE_MASK                       0x00008000
#define _C1INTH_IVMIE_LENGTH                     0x00000001

#define _C1RXIFL_RFIF1_POSITION                  0x00000001
#define _C1RXIFL_RFIF1_MASK                      0x00000002
#define _C1RXIFL_RFIF1_LENGTH                    0x00000001

#define _C1RXIFL_RFIF2_POSITION                  0x00000002
#define _C1RXIFL_RFIF2_MASK                      0x00000004
#define _C1RXIFL_RFIF2_LENGTH                    0x00000001

#define _C1RXIFL_RFIF3_POSITION                  0x00000003
#define _C1RXIFL_RFIF3_MASK                      0x00000008
#define _C1RXIFL_RFIF3_LENGTH                    0x00000001

#define _C1RXIFL_RFIF4_POSITION                  0x00000004
#define _C1RXIFL_RFIF4_MASK                      0x00000010
#define _C1RXIFL_RFIF4_LENGTH                    0x00000001

#define _C1RXIFL_RFIF5_POSITION                  0x00000005
#define _C1RXIFL_RFIF5_MASK                      0x00000020
#define _C1RXIFL_RFIF5_LENGTH                    0x00000001

#define _C1RXIFL_RFIF6_POSITION                  0x00000006
#define _C1RXIFL_RFIF6_MASK                      0x00000040
#define _C1RXIFL_RFIF6_LENGTH                    0x00000001

#define _C1RXIFL_RFIF7_POSITION                  0x00000007
#define _C1RXIFL_RFIF7_MASK                      0x00000080
#define _C1RXIFL_RFIF7_LENGTH                    0x00000001

#define _C1RXIFL_RFIF8_POSITION                  0x00000008
#define _C1RXIFL_RFIF8_MASK                      0x00000100
#define _C1RXIFL_RFIF8_LENGTH                    0x00000001

#define _C1RXIFL_RFIF9_POSITION                  0x00000009
#define _C1RXIFL_RFIF9_MASK                      0x00000200
#define _C1RXIFL_RFIF9_LENGTH                    0x00000001

#define _C1RXIFL_RFIF10_POSITION                 0x0000000A
#define _C1RXIFL_RFIF10_MASK                     0x00000400
#define _C1RXIFL_RFIF10_LENGTH                   0x00000001

#define _C1RXIFL_RFIF11_POSITION                 0x0000000B
#define _C1RXIFL_RFIF11_MASK                     0x00000800
#define _C1RXIFL_RFIF11_LENGTH                   0x00000001

#define _C1RXIFL_RFIF12_POSITION                 0x0000000C
#define _C1RXIFL_RFIF12_MASK                     0x00001000
#define _C1RXIFL_RFIF12_LENGTH                   0x00000001

#define _C1RXIFL_RFIF13_POSITION                 0x0000000D
#define _C1RXIFL_RFIF13_MASK                     0x00002000
#define _C1RXIFL_RFIF13_LENGTH                   0x00000001

#define _C1RXIFL_RFIF14_POSITION                 0x0000000E
#define _C1RXIFL_RFIF14_MASK                     0x00004000
#define _C1RXIFL_RFIF14_LENGTH                   0x00000001

#define _C1RXIFL_RFIF15_POSITION                 0x0000000F
#define _C1RXIFL_RFIF15_MASK                     0x00008000
#define _C1RXIFL_RFIF15_LENGTH                   0x00000001

#define _C1RXIFH_RFIF16_POSITION                 0x00000000
#define _C1RXIFH_RFIF16_MASK                     0x00000001
#define _C1RXIFH_RFIF16_LENGTH                   0x00000001

#define _C1RXIFH_RFIF17_POSITION                 0x00000001
#define _C1RXIFH_RFIF17_MASK                     0x00000002
#define _C1RXIFH_RFIF17_LENGTH                   0x00000001

#define _C1RXIFH_RFIF18_POSITION                 0x00000002
#define _C1RXIFH_RFIF18_MASK                     0x00000004
#define _C1RXIFH_RFIF18_LENGTH                   0x00000001

#define _C1RXIFH_RFIF19_POSITION                 0x00000003
#define _C1RXIFH_RFIF19_MASK                     0x00000008
#define _C1RXIFH_RFIF19_LENGTH                   0x00000001

#define _C1RXIFH_RFIF20_POSITION                 0x00000004
#define _C1RXIFH_RFIF20_MASK                     0x00000010
#define _C1RXIFH_RFIF20_LENGTH                   0x00000001

#define _C1RXIFH_RFIF21_POSITION                 0x00000005
#define _C1RXIFH_RFIF21_MASK                     0x00000020
#define _C1RXIFH_RFIF21_LENGTH                   0x00000001

