wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1RXIFH_RFIF22_POSITION                 0x00000006
#define _C1RXIFH_RFIF22_MASK                     0x00000040
#define _C1RXIFH_RFIF22_LENGTH                   0x00000001

#define _C1RXIFH_RFIF23_POSITION                 0x00000007
#define _C1RXIFH_RFIF23_MASK                     0x00000080
#define _C1RXIFH_RFIF23_LENGTH                   0x00000001

#define _C1RXIFH_RFIF24_POSITION                 0x00000008
#define _C1RXIFH_RFIF24_MASK                     0x00000100
#define _C1RXIFH_RFIF24_LENGTH                   0x00000001

#define _C1RXIFH_RFIF25_POSITION                 0x00000009
#define _C1RXIFH_RFIF25_MASK                     0x00000200
#define _C1RXIFH_RFIF25_LENGTH                   0x00000001

#define _C1RXIFH_RFIF26_POSITION                 0x0000000A
#define _C1RXIFH_RFIF26_MASK                     0x00000400
#define _C1RXIFH_RFIF26_LENGTH                   0x00000001

#define _C1RXIFH_RFIF27_POSITION                 0x0000000B
#define _C1RXIFH_RFIF27_MASK                     0x00000800
#define _C1RXIFH_RFIF27_LENGTH                   0x00000001

#define _C1RXIFH_RFIF28_POSITION                 0x0000000C
#define _C1RXIFH_RFIF28_MASK                     0x00001000
#define _C1RXIFH_RFIF28_LENGTH                   0x00000001

#define _C1RXIFH_RFIF29_POSITION                 0x0000000D
#define _C1RXIFH_RFIF29_MASK                     0x00002000
#define _C1RXIFH_RFIF29_LENGTH                   0x00000001

#define _C1RXIFH_RFIF30_POSITION                 0x0000000E
#define _C1RXIFH_RFIF30_MASK                     0x00004000
#define _C1RXIFH_RFIF30_LENGTH                   0x00000001

#define _C1RXIFH_RFIF31_POSITION                 0x0000000F
#define _C1RXIFH_RFIF31_MASK                     0x00008000
#define _C1RXIFH_RFIF31_LENGTH                   0x00000001

#define _C1TXIFL_TFIF0_POSITION                  0x00000000
#define _C1TXIFL_TFIF0_MASK                      0x00000001
#define _C1TXIFL_TFIF0_LENGTH                    0x00000001

#define _C1TXIFL_TFIF1_POSITION                  0x00000001
#define _C1TXIFL_TFIF1_MASK                      0x00000002
#define _C1TXIFL_TFIF1_LENGTH                    0x00000001

#define _C1TXIFL_TFIF2_POSITION                  0x00000002
#define _C1TXIFL_TFIF2_MASK                      0x00000004
#define _C1TXIFL_TFIF2_LENGTH                    0x00000001

#define _C1TXIFL_TFIF3_POSITION                  0x00000003
#define _C1TXIFL_TFIF3_MASK                      0x00000008
#define _C1TXIFL_TFIF3_LENGTH                    0x00000001

#define _C1TXIFL_TFIF4_POSITION                  0x00000004
#define _C1TXIFL_TFIF4_MASK                      0x00000010
#define _C1TXIFL_TFIF4_LENGTH                    0x00000001

#define _C1TXIFL_TFIF5_POSITION                  0x00000005
#define _C1TXIFL_TFIF5_MASK                      0x00000020
#define _C1TXIFL_TFIF5_LENGTH                    0x00000001

#define _C1TXIFL_TFIF6_POSITION                  0x00000006
#define _C1TXIFL_TFIF6_MASK                      0x00000040
#define _C1TXIFL_TFIF6_LENGTH                    0x00000001

#define _C1TXIFL_TFIF7_POSITION                  0x00000007
#define _C1TXIFL_TFIF7_MASK                      0x00000080
#define _C1TXIFL_TFIF7_LENGTH                    0x00000001

#define _C1TXIFL_TFIF8_POSITION                  0x00000008
#define _C1TXIFL_TFIF8_MASK                      0x00000100
#define _C1TXIFL_TFIF8_LENGTH                    0x00000001

#define _C1TXIFL_TFIF9_POSITION                  0x00000009
#define _C1TXIFL_TFIF9_MASK                      0x00000200
#define _C1TXIFL_TFIF9_LENGTH                    0x00000001

#define _C1TXIFL_TFIF10_POSITION                 0x0000000A
#define _C1TXIFL_TFIF10_MASK                     0x00000400
#define _C1TXIFL_TFIF10_LENGTH                   0x00000001

#define _C1TXIFL_TFIF11_POSITION                 0x0000000B
#define _C1TXIFL_TFIF11_MASK                     0x00000800
#define _C1TXIFL_TFIF11_LENGTH                   0x00000001

#define _C1TXIFL_TFIF12_POSITION                 0x0000000C
#define _C1TXIFL_TFIF12_MASK                     0x00001000
#define _C1TXIFL_TFIF12_LENGTH                   0x00000001

#define _C1TXIFL_TFIF13_POSITION                 0x0000000D
#define _C1TXIFL_TFIF13_MASK                     0x00002000
#define _C1TXIFL_TFIF13_LENGTH                   0x00000001

#define _C1TXIFL_TFIF14_POSITION                 0x0000000E
#define _C1TXIFL_TFIF14_MASK                     0x00004000
#define _C1TXIFL_TFIF14_LENGTH                   0x00000001

#define _C1TXIFL_TFIF15_POSITION                 0x0000000F
#define _C1TXIFL_TFIF15_MASK                     0x00008000
#define _C1TXIFL_TFIF15_LENGTH                   0x00000001

#define _C1TXIFH_TFIF16_POSITION                 0x00000000
#define _C1TXIFH_TFIF16_MASK                     0x00000001
#define _C1TXIFH_TFIF16_LENGTH                   0x00000001

#define _C1TXIFH_TFIF17_POSITION                 0x00000001
#define _C1TXIFH_TFIF17_MASK                     0x00000002
#define _C1TXIFH_TFIF17_LENGTH                   0x00000001

#define _C1TXIFH_TFIF18_POSITION                 0x00000002
#define _C1TXIFH_TFIF18_MASK                     0x00000004
#define _C1TXIFH_TFIF18_LENGTH                   0x00000001

#define _C1TXIFH_TFIF19_POSITION                 0x00000003
#define _C1TXIFH_TFIF19_MASK                     0x00000008
#define _C1TXIFH_TFIF19_LENGTH                   0x00000001

#define _C1TXIFH_TFIF20_POSITION                 0x00000004
#define _C1TXIFH_TFIF20_MASK                     0x00000010
#define _C1TXIFH_TFIF20_LENGTH                   0x00000001

#define _C1TXIFH_TFIF21_POSITION                 0x00000005
#define _C1TXIFH_TFIF21_MASK                     0x00000020
#define _C1TXIFH_TFIF21_LENGTH                   0x00000001

#define _C1TXIFH_TFIF22_POSITION                 0x00000006
#define _C1TXIFH_TFIF22_MASK                     0x00000040
#define _C1TXIFH_TFIF22_LENGTH                   0x00000001

#define _C1TXIFH_TFIF23_POSITION                 0x00000007
#define _C1TXIFH_TFIF23_MASK                     0x00000080
#define _C1TXIFH_TFIF23_LENGTH                   0x00000001

#define _C1TXIFH_TFIF24_POSITION                 0x00000008
#define _C1TXIFH_TFIF24_MASK                     0x00000100
#define _C1TXIFH_TFIF24_LENGTH                   0x00000001

