wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TXIFH_TFIF25_POSITION                 0x00000009
#define _C1TXIFH_TFIF25_MASK                     0x00000200
#define _C1TXIFH_TFIF25_LENGTH                   0x00000001

#define _C1TXIFH_TFIF26_POSITION                 0x0000000A
#define _C1TXIFH_TFIF26_MASK                     0x00000400
#define _C1TXIFH_TFIF26_LENGTH                   0x00000001

#define _C1TXIFH_TFIF27_POSITION                 0x0000000B
#define _C1TXIFH_TFIF27_MASK                     0x00000800
#define _C1TXIFH_TFIF27_LENGTH                   0x00000001

#define _C1TXIFH_TFIF28_POSITION                 0x0000000C
#define _C1TXIFH_TFIF28_MASK                     0x00001000
#define _C1TXIFH_TFIF28_LENGTH                   0x00000001

#define _C1TXIFH_TFIF29_POSITION                 0x0000000D
#define _C1TXIFH_TFIF29_MASK                     0x00002000
#define _C1TXIFH_TFIF29_LENGTH                   0x00000001

#define _C1TXIFH_TFIF30_POSITION                 0x0000000E
#define _C1TXIFH_TFIF30_MASK                     0x00004000
#define _C1TXIFH_TFIF30_LENGTH                   0x00000001

#define _C1TXIFH_TFIF31_POSITION                 0x0000000F
#define _C1TXIFH_TFIF31_MASK                     0x00008000
#define _C1TXIFH_TFIF31_LENGTH                   0x00000001

#define _C1RXOVIFL_RFOVIF1_POSITION              0x00000001
#define _C1RXOVIFL_RFOVIF1_MASK                  0x00000002
#define _C1RXOVIFL_RFOVIF1_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF2_POSITION              0x00000002
#define _C1RXOVIFL_RFOVIF2_MASK                  0x00000004
#define _C1RXOVIFL_RFOVIF2_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF3_POSITION              0x00000003
#define _C1RXOVIFL_RFOVIF3_MASK                  0x00000008
#define _C1RXOVIFL_RFOVIF3_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF4_POSITION              0x00000004
#define _C1RXOVIFL_RFOVIF4_MASK                  0x00000010
#define _C1RXOVIFL_RFOVIF4_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF5_POSITION              0x00000005
#define _C1RXOVIFL_RFOVIF5_MASK                  0x00000020
#define _C1RXOVIFL_RFOVIF5_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF6_POSITION              0x00000006
#define _C1RXOVIFL_RFOVIF6_MASK                  0x00000040
#define _C1RXOVIFL_RFOVIF6_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF7_POSITION              0x00000007
#define _C1RXOVIFL_RFOVIF7_MASK                  0x00000080
#define _C1RXOVIFL_RFOVIF7_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF8_POSITION              0x00000008
#define _C1RXOVIFL_RFOVIF8_MASK                  0x00000100
#define _C1RXOVIFL_RFOVIF8_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF9_POSITION              0x00000009
#define _C1RXOVIFL_RFOVIF9_MASK                  0x00000200
#define _C1RXOVIFL_RFOVIF9_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF10_POSITION             0x0000000A
#define _C1RXOVIFL_RFOVIF10_MASK                 0x00000400
#define _C1RXOVIFL_RFOVIF10_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF11_POSITION             0x0000000B
#define _C1RXOVIFL_RFOVIF11_MASK                 0x00000800
#define _C1RXOVIFL_RFOVIF11_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF12_POSITION             0x0000000C
#define _C1RXOVIFL_RFOVIF12_MASK                 0x00001000
#define _C1RXOVIFL_RFOVIF12_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF13_POSITION             0x0000000D
#define _C1RXOVIFL_RFOVIF13_MASK                 0x00002000
#define _C1RXOVIFL_RFOVIF13_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF14_POSITION             0x0000000E
#define _C1RXOVIFL_RFOVIF14_MASK                 0x00004000
#define _C1RXOVIFL_RFOVIF14_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF15_POSITION             0x0000000F
#define _C1RXOVIFL_RFOVIF15_MASK                 0x00008000
#define _C1RXOVIFL_RFOVIF15_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF16_POSITION             0x00000000
#define _C1RXOVIFH_RFOVIF16_MASK                 0x00000001
#define _C1RXOVIFH_RFOVIF16_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF17_POSITION             0x00000001
#define _C1RXOVIFH_RFOVIF17_MASK                 0x00000002
#define _C1RXOVIFH_RFOVIF17_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF18_POSITION             0x00000002
#define _C1RXOVIFH_RFOVIF18_MASK                 0x00000004
#define _C1RXOVIFH_RFOVIF18_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF19_POSITION             0x00000003
#define _C1RXOVIFH_RFOVIF19_MASK                 0x00000008
#define _C1RXOVIFH_RFOVIF19_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF20_POSITION             0x00000004
#define _C1RXOVIFH_RFOVIF20_MASK                 0x00000010
#define _C1RXOVIFH_RFOVIF20_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF21_POSITION             0x00000005
#define _C1RXOVIFH_RFOVIF21_MASK                 0x00000020
#define _C1RXOVIFH_RFOVIF21_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF22_POSITION             0x00000006
#define _C1RXOVIFH_RFOVIF22_MASK                 0x00000040
#define _C1RXOVIFH_RFOVIF22_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF23_POSITION             0x00000007
#define _C1RXOVIFH_RFOVIF23_MASK                 0x00000080
#define _C1RXOVIFH_RFOVIF23_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF24_POSITION             0x00000008
#define _C1RXOVIFH_RFOVIF24_MASK                 0x00000100
#define _C1RXOVIFH_RFOVIF24_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF25_POSITION             0x00000009
#define _C1RXOVIFH_RFOVIF25_MASK                 0x00000200
#define _C1RXOVIFH_RFOVIF25_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF26_POSITION             0x0000000A
#define _C1RXOVIFH_RFOVIF26_MASK                 0x00000400
#define _C1RXOVIFH_RFOVIF26_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF27_POSITION             0x0000000B
#define _C1RXOVIFH_RFOVIF27_MASK                 0x00000800
#define _C1RXOVIFH_RFOVIF27_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF28_POSITION             0x0000000C
#define _C1RXOVIFH_RFOVIF28_MASK                 0x00001000
#define _C1RXOVIFH_RFOVIF28_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF29_POSITION             0x0000000D
#define _C1RXOVIFH_RFOVIF29_MASK                 0x00002000
#define _C1RXOVIFH_RFOVIF29_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF30_POSITION             0x0000000E
#define _C1RXOVIFH_RFOVIF30_MASK                 0x00004000
#define _C1RXOVIFH_RFOVIF30_LENGTH               0x00000001

