wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TXREQL_TXREQ3_POSITION                0x00000003
#define _C1TXREQL_TXREQ3_MASK                    0x00000008
#define _C1TXREQL_TXREQ3_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ4_POSITION                0x00000004
#define _C1TXREQL_TXREQ4_MASK                    0x00000010
#define _C1TXREQL_TXREQ4_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ5_POSITION                0x00000005
#define _C1TXREQL_TXREQ5_MASK                    0x00000020
#define _C1TXREQL_TXREQ5_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ6_POSITION                0x00000006
#define _C1TXREQL_TXREQ6_MASK                    0x00000040
#define _C1TXREQL_TXREQ6_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ7_POSITION                0x00000007
#define _C1TXREQL_TXREQ7_MASK                    0x00000080
#define _C1TXREQL_TXREQ7_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ8_POSITION                0x00000008
#define _C1TXREQL_TXREQ8_MASK                    0x00000100
#define _C1TXREQL_TXREQ8_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ9_POSITION                0x00000009
#define _C1TXREQL_TXREQ9_MASK                    0x00000200
#define _C1TXREQL_TXREQ9_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ10_POSITION               0x0000000A
#define _C1TXREQL_TXREQ10_MASK                   0x00000400
#define _C1TXREQL_TXREQ10_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ11_POSITION               0x0000000B
#define _C1TXREQL_TXREQ11_MASK                   0x00000800
#define _C1TXREQL_TXREQ11_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ12_POSITION               0x0000000C
#define _C1TXREQL_TXREQ12_MASK                   0x00001000
#define _C1TXREQL_TXREQ12_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ13_POSITION               0x0000000D
#define _C1TXREQL_TXREQ13_MASK                   0x00002000
#define _C1TXREQL_TXREQ13_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ14_POSITION               0x0000000E
#define _C1TXREQL_TXREQ14_MASK                   0x00004000
#define _C1TXREQL_TXREQ14_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ15_POSITION               0x0000000F
#define _C1TXREQL_TXREQ15_MASK                   0x00008000
#define _C1TXREQL_TXREQ15_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ16_POSITION               0x00000000
#define _C1TXREQH_TXREQ16_MASK                   0x00000001
#define _C1TXREQH_TXREQ16_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ17_POSITION               0x00000001
#define _C1TXREQH_TXREQ17_MASK                   0x00000002
#define _C1TXREQH_TXREQ17_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ18_POSITION               0x00000002
#define _C1TXREQH_TXREQ18_MASK                   0x00000004
#define _C1TXREQH_TXREQ18_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ19_POSITION               0x00000003
#define _C1TXREQH_TXREQ19_MASK                   0x00000008
#define _C1TXREQH_TXREQ19_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ20_POSITION               0x00000004
#define _C1TXREQH_TXREQ20_MASK                   0x00000010
#define _C1TXREQH_TXREQ20_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ21_POSITION               0x00000005
#define _C1TXREQH_TXREQ21_MASK                   0x00000020
#define _C1TXREQH_TXREQ21_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ22_POSITION               0x00000006
#define _C1TXREQH_TXREQ22_MASK                   0x00000040
#define _C1TXREQH_TXREQ22_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ23_POSITION               0x00000007
#define _C1TXREQH_TXREQ23_MASK                   0x00000080
#define _C1TXREQH_TXREQ23_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ24_POSITION               0x00000008
#define _C1TXREQH_TXREQ24_MASK                   0x00000100
#define _C1TXREQH_TXREQ24_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ25_POSITION               0x00000009
#define _C1TXREQH_TXREQ25_MASK                   0x00000200
#define _C1TXREQH_TXREQ25_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ26_POSITION               0x0000000A
#define _C1TXREQH_TXREQ26_MASK                   0x00000400
#define _C1TXREQH_TXREQ26_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ27_POSITION               0x0000000B
#define _C1TXREQH_TXREQ27_MASK                   0x00000800
#define _C1TXREQH_TXREQ27_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ28_POSITION               0x0000000C
#define _C1TXREQH_TXREQ28_MASK                   0x00001000
#define _C1TXREQH_TXREQ28_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ29_POSITION               0x0000000D
#define _C1TXREQH_TXREQ29_MASK                   0x00002000
#define _C1TXREQH_TXREQ29_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ30_POSITION               0x0000000E
#define _C1TXREQH_TXREQ30_MASK                   0x00004000
#define _C1TXREQH_TXREQ30_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ31_POSITION               0x0000000F
#define _C1TXREQH_TXREQ31_MASK                   0x00008000
#define _C1TXREQH_TXREQ31_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT_POSITION                0x00000000
#define _C1TRECL_RERRCNT_MASK                    0x000000FF
#define _C1TRECL_RERRCNT_LENGTH                  0x00000008

#define _C1TRECL_TERRCNT_POSITION                0x00000008
#define _C1TRECL_TERRCNT_MASK                    0x0000FF00
#define _C1TRECL_TERRCNT_LENGTH                  0x00000008

#define _C1TRECL_RERRCNT0_POSITION               0x00000000
#define _C1TRECL_RERRCNT0_MASK                   0x00000001
#define _C1TRECL_RERRCNT0_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT1_POSITION               0x00000001
#define _C1TRECL_RERRCNT1_MASK                   0x00000002
#define _C1TRECL_RERRCNT1_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT2_POSITION               0x00000002
#define _C1TRECL_RERRCNT2_MASK                   0x00000004
#define _C1TRECL_RERRCNT2_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT3_POSITION               0x00000003
#define _C1TRECL_RERRCNT3_MASK                   0x00000008
#define _C1TRECL_RERRCNT3_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT4_POSITION               0x00000004
#define _C1TRECL_RERRCNT4_MASK                   0x00000010
#define _C1TRECL_RERRCNT4_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT5_POSITION               0x00000005
#define _C1TRECL_RERRCNT5_MASK                   0x00000020
#define _C1TRECL_RERRCNT5_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT6_POSITION               0x00000006
#define _C1TRECL_RERRCNT6_MASK                   0x00000040
#define _C1TRECL_RERRCNT6_LENGTH                 0x00000001

