wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1BDIAG0H_DTERRCNT_POSITION             0x00000008
#define _C1BDIAG0H_DTERRCNT_MASK                 0x0000FF00
#define _C1BDIAG0H_DTERRCNT_LENGTH               0x00000008

#define _C1BDIAG0H_DRERRCNT0_POSITION            0x00000000
#define _C1BDIAG0H_DRERRCNT0_MASK                0x00000001
#define _C1BDIAG0H_DRERRCNT0_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT1_POSITION            0x00000001
#define _C1BDIAG0H_DRERRCNT1_MASK                0x00000002
#define _C1BDIAG0H_DRERRCNT1_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT2_POSITION            0x00000002
#define _C1BDIAG0H_DRERRCNT2_MASK                0x00000004
#define _C1BDIAG0H_DRERRCNT2_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT3_POSITION            0x00000003
#define _C1BDIAG0H_DRERRCNT3_MASK                0x00000008
#define _C1BDIAG0H_DRERRCNT3_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT4_POSITION            0x00000004
#define _C1BDIAG0H_DRERRCNT4_MASK                0x00000010
#define _C1BDIAG0H_DRERRCNT4_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT5_POSITION            0x00000005
#define _C1BDIAG0H_DRERRCNT5_MASK                0x00000020
#define _C1BDIAG0H_DRERRCNT5_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT6_POSITION            0x00000006
#define _C1BDIAG0H_DRERRCNT6_MASK                0x00000040
#define _C1BDIAG0H_DRERRCNT6_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT7_POSITION            0x00000007
#define _C1BDIAG0H_DRERRCNT7_MASK                0x00000080
#define _C1BDIAG0H_DRERRCNT7_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT0_POSITION            0x00000008
#define _C1BDIAG0H_DTERRCNT0_MASK                0x00000100
#define _C1BDIAG0H_DTERRCNT0_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT1_POSITION            0x00000009
#define _C1BDIAG0H_DTERRCNT1_MASK                0x00000200
#define _C1BDIAG0H_DTERRCNT1_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT2_POSITION            0x0000000A
#define _C1BDIAG0H_DTERRCNT2_MASK                0x00000400
#define _C1BDIAG0H_DTERRCNT2_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT3_POSITION            0x0000000B
#define _C1BDIAG0H_DTERRCNT3_MASK                0x00000800
#define _C1BDIAG0H_DTERRCNT3_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT4_POSITION            0x0000000C
#define _C1BDIAG0H_DTERRCNT4_MASK                0x00001000
#define _C1BDIAG0H_DTERRCNT4_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT5_POSITION            0x0000000D
#define _C1BDIAG0H_DTERRCNT5_MASK                0x00002000
#define _C1BDIAG0H_DTERRCNT5_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT6_POSITION            0x0000000E
#define _C1BDIAG0H_DTERRCNT6_MASK                0x00004000
#define _C1BDIAG0H_DTERRCNT6_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT7_POSITION            0x0000000F
#define _C1BDIAG0H_DTERRCNT7_MASK                0x00008000
#define _C1BDIAG0H_DTERRCNT7_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT_POSITION             0x00000000
#define _C1BDIAG1L_EFMSGCNT_MASK                 0x0000FFFF
#define _C1BDIAG1L_EFMSGCNT_LENGTH               0x00000010

#define _C1BDIAG1L_EFMSGCNT0_POSITION            0x00000000
#define _C1BDIAG1L_EFMSGCNT0_MASK                0x00000001
#define _C1BDIAG1L_EFMSGCNT0_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT1_POSITION            0x00000001
#define _C1BDIAG1L_EFMSGCNT1_MASK                0x00000002
#define _C1BDIAG1L_EFMSGCNT1_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT2_POSITION            0x00000002
#define _C1BDIAG1L_EFMSGCNT2_MASK                0x00000004
#define _C1BDIAG1L_EFMSGCNT2_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT3_POSITION            0x00000003
#define _C1BDIAG1L_EFMSGCNT3_MASK                0x00000008
#define _C1BDIAG1L_EFMSGCNT3_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT4_POSITION            0x00000004
#define _C1BDIAG1L_EFMSGCNT4_MASK                0x00000010
#define _C1BDIAG1L_EFMSGCNT4_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT5_POSITION            0x00000005
#define _C1BDIAG1L_EFMSGCNT5_MASK                0x00000020
#define _C1BDIAG1L_EFMSGCNT5_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT6_POSITION            0x00000006
#define _C1BDIAG1L_EFMSGCNT6_MASK                0x00000040
#define _C1BDIAG1L_EFMSGCNT6_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT7_POSITION            0x00000007
#define _C1BDIAG1L_EFMSGCNT7_MASK                0x00000080
#define _C1BDIAG1L_EFMSGCNT7_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT8_POSITION            0x00000008
#define _C1BDIAG1L_EFMSGCNT8_MASK                0x00000100
#define _C1BDIAG1L_EFMSGCNT8_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT9_POSITION            0x00000009
#define _C1BDIAG1L_EFMSGCNT9_MASK                0x00000200
#define _C1BDIAG1L_EFMSGCNT9_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT10_POSITION           0x0000000A
#define _C1BDIAG1L_EFMSGCNT10_MASK               0x00000400
#define _C1BDIAG1L_EFMSGCNT10_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT11_POSITION           0x0000000B
#define _C1BDIAG1L_EFMSGCNT11_MASK               0x00000800
#define _C1BDIAG1L_EFMSGCNT11_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT12_POSITION           0x0000000C
#define _C1BDIAG1L_EFMSGCNT12_MASK               0x00001000
#define _C1BDIAG1L_EFMSGCNT12_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT13_POSITION           0x0000000D
#define _C1BDIAG1L_EFMSGCNT13_MASK               0x00002000
#define _C1BDIAG1L_EFMSGCNT13_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT14_POSITION           0x0000000E
#define _C1BDIAG1L_EFMSGCNT14_MASK               0x00004000
#define _C1BDIAG1L_EFMSGCNT14_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT15_POSITION           0x0000000F
#define _C1BDIAG1L_EFMSGCNT15_MASK               0x00008000
#define _C1BDIAG1L_EFMSGCNT15_LENGTH             0x00000001

#define _C1BDIAG1H_NBIT0ERR_POSITION             0x00000000
#define _C1BDIAG1H_NBIT0ERR_MASK                 0x00000001
#define _C1BDIAG1H_NBIT0ERR_LENGTH               0x00000001

#define _C1BDIAG1H_NBIT1ERR_POSITION             0x00000001
#define _C1BDIAG1H_NBIT1ERR_MASK                 0x00000002
#define _C1BDIAG1H_NBIT1ERR_LENGTH               0x00000001

#define _C1BDIAG1H_NACKERR_POSITION              0x00000002
#define _C1BDIAG1H_NACKERR_MASK                  0x00000004
#define _C1BDIAG1H_NACKERR_LENGTH                0x00000001

