wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1BDIAG1H_NFORMERR_POSITION             0x00000003
#define _C1BDIAG1H_NFORMERR_MASK                 0x00000008
#define _C1BDIAG1H_NFORMERR_LENGTH               0x00000001

#define _C1BDIAG1H_NSTUFERR_POSITION             0x00000004
#define _C1BDIAG1H_NSTUFERR_MASK                 0x00000010
#define _C1BDIAG1H_NSTUFERR_LENGTH               0x00000001

#define _C1BDIAG1H_NCRCERR_POSITION              0x00000005
#define _C1BDIAG1H_NCRCERR_MASK                  0x00000020
#define _C1BDIAG1H_NCRCERR_LENGTH                0x00000001

#define _C1BDIAG1H_TXBOERR_POSITION              0x00000007
#define _C1BDIAG1H_TXBOERR_MASK                  0x00000080
#define _C1BDIAG1H_TXBOERR_LENGTH                0x00000001

#define _C1BDIAG1H_DBIT0ERR_POSITION             0x00000008
#define _C1BDIAG1H_DBIT0ERR_MASK                 0x00000100
#define _C1BDIAG1H_DBIT0ERR_LENGTH               0x00000001

#define _C1BDIAG1H_DBIT1ERR_POSITION             0x00000009
#define _C1BDIAG1H_DBIT1ERR_MASK                 0x00000200
#define _C1BDIAG1H_DBIT1ERR_LENGTH               0x00000001

#define _C1BDIAG1H_DFORMERR_POSITION             0x0000000B
#define _C1BDIAG1H_DFORMERR_MASK                 0x00000800
#define _C1BDIAG1H_DFORMERR_LENGTH               0x00000001

#define _C1BDIAG1H_DSTUFERR_POSITION             0x0000000C
#define _C1BDIAG1H_DSTUFERR_MASK                 0x00001000
#define _C1BDIAG1H_DSTUFERR_LENGTH               0x00000001

#define _C1BDIAG1H_DCRCERR_POSITION              0x0000000D
#define _C1BDIAG1H_DCRCERR_MASK                  0x00002000
#define _C1BDIAG1H_DCRCERR_LENGTH                0x00000001

#define _C1BDIAG1H_ESI_POSITION                  0x0000000E
#define _C1BDIAG1H_ESI_MASK                      0x00004000
#define _C1BDIAG1H_ESI_LENGTH                    0x00000001

#define _C1BDIAG1H_DLCMM_POSITION                0x0000000F
#define _C1BDIAG1H_DLCMM_MASK                    0x00008000
#define _C1BDIAG1H_DLCMM_LENGTH                  0x00000001

#define _C1TEFCONL_TEFNEIE_POSITION              0x00000000
#define _C1TEFCONL_TEFNEIE_MASK                  0x00000001
#define _C1TEFCONL_TEFNEIE_LENGTH                0x00000001

#define _C1TEFCONL_TEFHIE_POSITION               0x00000001
#define _C1TEFCONL_TEFHIE_MASK                   0x00000002
#define _C1TEFCONL_TEFHIE_LENGTH                 0x00000001

#define _C1TEFCONL_TEFFIE_POSITION               0x00000002
#define _C1TEFCONL_TEFFIE_MASK                   0x00000004
#define _C1TEFCONL_TEFFIE_LENGTH                 0x00000001

#define _C1TEFCONL_TEFOVIE_POSITION              0x00000003
#define _C1TEFCONL_TEFOVIE_MASK                  0x00000008
#define _C1TEFCONL_TEFOVIE_LENGTH                0x00000001

#define _C1TEFCONL_TEFTSEN_POSITION              0x00000005
#define _C1TEFCONL_TEFTSEN_MASK                  0x00000020
#define _C1TEFCONL_TEFTSEN_LENGTH                0x00000001

#define _C1TEFCONL_UINC_POSITION                 0x00000008
#define _C1TEFCONL_UINC_MASK                     0x00000100
#define _C1TEFCONL_UINC_LENGTH                   0x00000001

#define _C1TEFCONL_FRESET_POSITION               0x0000000A
#define _C1TEFCONL_FRESET_MASK                   0x00000400
#define _C1TEFCONL_FRESET_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE_POSITION                0x00000008
#define _C1TEFCONH_FSIZE_MASK                    0x00001F00
#define _C1TEFCONH_FSIZE_LENGTH                  0x00000005

#define _C1TEFCONH_FSIZE0_POSITION               0x00000008
#define _C1TEFCONH_FSIZE0_MASK                   0x00000100
#define _C1TEFCONH_FSIZE0_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE1_POSITION               0x00000009
#define _C1TEFCONH_FSIZE1_MASK                   0x00000200
#define _C1TEFCONH_FSIZE1_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE2_POSITION               0x0000000A
#define _C1TEFCONH_FSIZE2_MASK                   0x00000400
#define _C1TEFCONH_FSIZE2_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE3_POSITION               0x0000000B
#define _C1TEFCONH_FSIZE3_MASK                   0x00000800
#define _C1TEFCONH_FSIZE3_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE4_POSITION               0x0000000C
#define _C1TEFCONH_FSIZE4_MASK                   0x00001000
#define _C1TEFCONH_FSIZE4_LENGTH                 0x00000001

#define _C1TEFSTA_TEFNEIF_POSITION               0x00000000
#define _C1TEFSTA_TEFNEIF_MASK                   0x00000001
#define _C1TEFSTA_TEFNEIF_LENGTH                 0x00000001

#define _C1TEFSTA_TEFHIF_POSITION                0x00000001
#define _C1TEFSTA_TEFHIF_MASK                    0x00000002
#define _C1TEFSTA_TEFHIF_LENGTH                  0x00000001

#define _C1TEFSTA_TEFFIF_POSITION                0x00000002
#define _C1TEFSTA_TEFFIF_MASK                    0x00000004
#define _C1TEFSTA_TEFFIF_LENGTH                  0x00000001

#define _C1TEFSTA_TEFOVIF_POSITION               0x00000003
#define _C1TEFSTA_TEFOVIF_MASK                   0x00000008
#define _C1TEFSTA_TEFOVIF_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA0_POSITION                0x00000000
#define _C1TEFUAL_TEFUA0_MASK                    0x00000001
#define _C1TEFUAL_TEFUA0_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA1_POSITION                0x00000001
#define _C1TEFUAL_TEFUA1_MASK                    0x00000002
#define _C1TEFUAL_TEFUA1_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA2_POSITION                0x00000002
#define _C1TEFUAL_TEFUA2_MASK                    0x00000004
#define _C1TEFUAL_TEFUA2_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA3_POSITION                0x00000003
#define _C1TEFUAL_TEFUA3_MASK                    0x00000008
#define _C1TEFUAL_TEFUA3_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA4_POSITION                0x00000004
#define _C1TEFUAL_TEFUA4_MASK                    0x00000010
#define _C1TEFUAL_TEFUA4_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA5_POSITION                0x00000005
#define _C1TEFUAL_TEFUA5_MASK                    0x00000020
#define _C1TEFUAL_TEFUA5_LENGTH                  0x00000001

