wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TEFUAL_TEFUA6_POSITION                0x00000006
#define _C1TEFUAL_TEFUA6_MASK                    0x00000040
#define _C1TEFUAL_TEFUA6_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA7_POSITION                0x00000007
#define _C1TEFUAL_TEFUA7_MASK                    0x00000080
#define _C1TEFUAL_TEFUA7_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA8_POSITION                0x00000008
#define _C1TEFUAL_TEFUA8_MASK                    0x00000100
#define _C1TEFUAL_TEFUA8_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA9_POSITION                0x00000009
#define _C1TEFUAL_TEFUA9_MASK                    0x00000200
#define _C1TEFUAL_TEFUA9_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA10_POSITION               0x0000000A
#define _C1TEFUAL_TEFUA10_MASK                   0x00000400
#define _C1TEFUAL_TEFUA10_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA11_POSITION               0x0000000B
#define _C1TEFUAL_TEFUA11_MASK                   0x00000800
#define _C1TEFUAL_TEFUA11_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA12_POSITION               0x0000000C
#define _C1TEFUAL_TEFUA12_MASK                   0x00001000
#define _C1TEFUAL_TEFUA12_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA13_POSITION               0x0000000D
#define _C1TEFUAL_TEFUA13_MASK                   0x00002000
#define _C1TEFUAL_TEFUA13_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA14_POSITION               0x0000000E
#define _C1TEFUAL_TEFUA14_MASK                   0x00004000
#define _C1TEFUAL_TEFUA14_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA15_POSITION               0x0000000F
#define _C1TEFUAL_TEFUA15_MASK                   0x00008000
#define _C1TEFUAL_TEFUA15_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA16_POSITION               0x00000000
#define _C1TEFUAH_TEFUA16_MASK                   0x00000001
#define _C1TEFUAH_TEFUA16_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA17_POSITION               0x00000001
#define _C1TEFUAH_TEFUA17_MASK                   0x00000002
#define _C1TEFUAH_TEFUA17_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA18_POSITION               0x00000002
#define _C1TEFUAH_TEFUA18_MASK                   0x00000004
#define _C1TEFUAH_TEFUA18_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA19_POSITION               0x00000003
#define _C1TEFUAH_TEFUA19_MASK                   0x00000008
#define _C1TEFUAH_TEFUA19_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA20_POSITION               0x00000004
#define _C1TEFUAH_TEFUA20_MASK                   0x00000010
#define _C1TEFUAH_TEFUA20_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA21_POSITION               0x00000005
#define _C1TEFUAH_TEFUA21_MASK                   0x00000020
#define _C1TEFUAH_TEFUA21_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA22_POSITION               0x00000006
#define _C1TEFUAH_TEFUA22_MASK                   0x00000040
#define _C1TEFUAH_TEFUA22_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA23_POSITION               0x00000007
#define _C1TEFUAH_TEFUA23_MASK                   0x00000080
#define _C1TEFUAH_TEFUA23_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA24_POSITION               0x00000008
#define _C1TEFUAH_TEFUA24_MASK                   0x00000100
#define _C1TEFUAH_TEFUA24_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA25_POSITION               0x00000009
#define _C1TEFUAH_TEFUA25_MASK                   0x00000200
#define _C1TEFUAH_TEFUA25_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA26_POSITION               0x0000000A
#define _C1TEFUAH_TEFUA26_MASK                   0x00000400
#define _C1TEFUAH_TEFUA26_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA27_POSITION               0x0000000B
#define _C1TEFUAH_TEFUA27_MASK                   0x00000800
#define _C1TEFUAH_TEFUA27_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA28_POSITION               0x0000000C
#define _C1TEFUAH_TEFUA28_MASK                   0x00001000
#define _C1TEFUAH_TEFUA28_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA29_POSITION               0x0000000D
#define _C1TEFUAH_TEFUA29_MASK                   0x00002000
#define _C1TEFUAH_TEFUA29_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA30_POSITION               0x0000000E
#define _C1TEFUAH_TEFUA30_MASK                   0x00004000
#define _C1TEFUAH_TEFUA30_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA31_POSITION               0x0000000F
#define _C1TEFUAH_TEFUA31_MASK                   0x00008000
#define _C1TEFUAH_TEFUA31_LENGTH                 0x00000001

#define _C1FIFOBAL_FIFOBA0_POSITION              0x00000000
#define _C1FIFOBAL_FIFOBA0_MASK                  0x00000001
#define _C1FIFOBAL_FIFOBA0_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA1_POSITION              0x00000001
#define _C1FIFOBAL_FIFOBA1_MASK                  0x00000002
#define _C1FIFOBAL_FIFOBA1_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA2_POSITION              0x00000002
#define _C1FIFOBAL_FIFOBA2_MASK                  0x00000004
#define _C1FIFOBAL_FIFOBA2_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA3_POSITION              0x00000003
#define _C1FIFOBAL_FIFOBA3_MASK                  0x00000008
#define _C1FIFOBAL_FIFOBA3_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA4_POSITION              0x00000004
#define _C1FIFOBAL_FIFOBA4_MASK                  0x00000010
#define _C1FIFOBAL_FIFOBA4_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA5_POSITION              0x00000005
#define _C1FIFOBAL_FIFOBA5_MASK                  0x00000020
#define _C1FIFOBAL_FIFOBA5_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA6_POSITION              0x00000006
#define _C1FIFOBAL_FIFOBA6_MASK                  0x00000040
#define _C1FIFOBAL_FIFOBA6_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA7_POSITION              0x00000007
#define _C1FIFOBAL_FIFOBA7_MASK                  0x00000080
#define _C1FIFOBAL_FIFOBA7_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA8_POSITION              0x00000008
#define _C1FIFOBAL_FIFOBA8_MASK                  0x00000100
#define _C1FIFOBAL_FIFOBA8_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA9_POSITION              0x00000009
#define _C1FIFOBAL_FIFOBA9_MASK                  0x00000200
#define _C1FIFOBAL_FIFOBA9_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA10_POSITION             0x0000000A
#define _C1FIFOBAL_FIFOBA10_MASK                 0x00000400
#define _C1FIFOBAL_FIFOBA10_LENGTH               0x00000001

