wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TXQCONH_FSIZE3_POSITION               0x0000000B
#define _C1TXQCONH_FSIZE3_MASK                   0x00000800
#define _C1TXQCONH_FSIZE3_LENGTH                 0x00000001

#define _C1TXQCONH_FSIZE4_POSITION               0x0000000C
#define _C1TXQCONH_FSIZE4_MASK                   0x00001000
#define _C1TXQCONH_FSIZE4_LENGTH                 0x00000001

#define _C1TXQCONH_PLSIZE0_POSITION              0x0000000D
#define _C1TXQCONH_PLSIZE0_MASK                  0x00002000
#define _C1TXQCONH_PLSIZE0_LENGTH                0x00000001

#define _C1TXQCONH_PLSIZE1_POSITION              0x0000000E
#define _C1TXQCONH_PLSIZE1_MASK                  0x00004000
#define _C1TXQCONH_PLSIZE1_LENGTH                0x00000001

#define _C1TXQCONH_PLSIZE2_POSITION              0x0000000F
#define _C1TXQCONH_PLSIZE2_MASK                  0x00008000
#define _C1TXQCONH_PLSIZE2_LENGTH                0x00000001

#define _C1TXQSTA_TXQNIF_POSITION                0x00000000
#define _C1TXQSTA_TXQNIF_MASK                    0x00000001
#define _C1TXQSTA_TXQNIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXQEIF_POSITION                0x00000002
#define _C1TXQSTA_TXQEIF_MASK                    0x00000004
#define _C1TXQSTA_TXQEIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXATIF_POSITION                0x00000004
#define _C1TXQSTA_TXATIF_MASK                    0x00000010
#define _C1TXQSTA_TXATIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXERR_POSITION                 0x00000005
#define _C1TXQSTA_TXERR_MASK                     0x00000020
#define _C1TXQSTA_TXERR_LENGTH                   0x00000001

#define _C1TXQSTA_TXLARB_POSITION                0x00000006
#define _C1TXQSTA_TXLARB_MASK                    0x00000040
#define _C1TXQSTA_TXLARB_LENGTH                  0x00000001

#define _C1TXQSTA_TXABT_POSITION                 0x00000007
#define _C1TXQSTA_TXABT_MASK                     0x00000080
#define _C1TXQSTA_TXABT_LENGTH                   0x00000001

#define _C1TXQSTA_TXQCI_POSITION                 0x00000008
#define _C1TXQSTA_TXQCI_MASK                     0x00001F00
#define _C1TXQSTA_TXQCI_LENGTH                   0x00000005

#define _C1TXQSTA_TXQCI0_POSITION                0x00000008
#define _C1TXQSTA_TXQCI0_MASK                    0x00000100
#define _C1TXQSTA_TXQCI0_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI1_POSITION                0x00000009
#define _C1TXQSTA_TXQCI1_MASK                    0x00000200
#define _C1TXQSTA_TXQCI1_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI2_POSITION                0x0000000A
#define _C1TXQSTA_TXQCI2_MASK                    0x00000400
#define _C1TXQSTA_TXQCI2_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI3_POSITION                0x0000000B
#define _C1TXQSTA_TXQCI3_MASK                    0x00000800
#define _C1TXQSTA_TXQCI3_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI4_POSITION                0x0000000C
#define _C1TXQSTA_TXQCI4_MASK                    0x00001000
#define _C1TXQSTA_TXQCI4_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA0_POSITION                0x00000000
#define _C1TXQUAL_TXQUA0_MASK                    0x00000001
#define _C1TXQUAL_TXQUA0_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA1_POSITION                0x00000001
#define _C1TXQUAL_TXQUA1_MASK                    0x00000002
#define _C1TXQUAL_TXQUA1_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA2_POSITION                0x00000002
#define _C1TXQUAL_TXQUA2_MASK                    0x00000004
#define _C1TXQUAL_TXQUA2_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA3_POSITION                0x00000003
#define _C1TXQUAL_TXQUA3_MASK                    0x00000008
#define _C1TXQUAL_TXQUA3_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA4_POSITION                0x00000004
#define _C1TXQUAL_TXQUA4_MASK                    0x00000010
#define _C1TXQUAL_TXQUA4_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA5_POSITION                0x00000005
#define _C1TXQUAL_TXQUA5_MASK                    0x00000020
#define _C1TXQUAL_TXQUA5_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA6_POSITION                0x00000006
#define _C1TXQUAL_TXQUA6_MASK                    0x00000040
#define _C1TXQUAL_TXQUA6_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA7_POSITION                0x00000007
#define _C1TXQUAL_TXQUA7_MASK                    0x00000080
#define _C1TXQUAL_TXQUA7_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA8_POSITION                0x00000008
#define _C1TXQUAL_TXQUA8_MASK                    0x00000100
#define _C1TXQUAL_TXQUA8_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA9_POSITION                0x00000009
#define _C1TXQUAL_TXQUA9_MASK                    0x00000200
#define _C1TXQUAL_TXQUA9_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA10_POSITION               0x0000000A
#define _C1TXQUAL_TXQUA10_MASK                   0x00000400
#define _C1TXQUAL_TXQUA10_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA11_POSITION               0x0000000B
#define _C1TXQUAL_TXQUA11_MASK                   0x00000800
#define _C1TXQUAL_TXQUA11_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA12_POSITION               0x0000000C
#define _C1TXQUAL_TXQUA12_MASK                   0x00001000
#define _C1TXQUAL_TXQUA12_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA13_POSITION               0x0000000D
#define _C1TXQUAL_TXQUA13_MASK                   0x00002000
#define _C1TXQUAL_TXQUA13_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA14_POSITION               0x0000000E
#define _C1TXQUAL_TXQUA14_MASK                   0x00004000
#define _C1TXQUAL_TXQUA14_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA15_POSITION               0x0000000F
#define _C1TXQUAL_TXQUA15_MASK                   0x00008000
#define _C1TXQUAL_TXQUA15_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA16_POSITION               0x00000000
#define _C1TXQUAH_TXQUA16_MASK                   0x00000001
#define _C1TXQUAH_TXQUA16_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA17_POSITION               0x00000001
#define _C1TXQUAH_TXQUA17_MASK                   0x00000002
#define _C1TXQUAH_TXQUA17_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA18_POSITION               0x00000002
#define _C1TXQUAH_TXQUA18_MASK                   0x00000004
#define _C1TXQUAH_TXQUA18_LENGTH                 0x00000001

