wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1TXQUAH_TXQUA19_POSITION               0x00000003
#define _C1TXQUAH_TXQUA19_MASK                   0x00000008
#define _C1TXQUAH_TXQUA19_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA20_POSITION               0x00000004
#define _C1TXQUAH_TXQUA20_MASK                   0x00000010
#define _C1TXQUAH_TXQUA20_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA21_POSITION               0x00000005
#define _C1TXQUAH_TXQUA21_MASK                   0x00000020
#define _C1TXQUAH_TXQUA21_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA22_POSITION               0x00000006
#define _C1TXQUAH_TXQUA22_MASK                   0x00000040
#define _C1TXQUAH_TXQUA22_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA23_POSITION               0x00000007
#define _C1TXQUAH_TXQUA23_MASK                   0x00000080
#define _C1TXQUAH_TXQUA23_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA24_POSITION               0x00000008
#define _C1TXQUAH_TXQUA24_MASK                   0x00000100
#define _C1TXQUAH_TXQUA24_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA25_POSITION               0x00000009
#define _C1TXQUAH_TXQUA25_MASK                   0x00000200
#define _C1TXQUAH_TXQUA25_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA26_POSITION               0x0000000A
#define _C1TXQUAH_TXQUA26_MASK                   0x00000400
#define _C1TXQUAH_TXQUA26_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA27_POSITION               0x0000000B
#define _C1TXQUAH_TXQUA27_MASK                   0x00000800
#define _C1TXQUAH_TXQUA27_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA28_POSITION               0x0000000C
#define _C1TXQUAH_TXQUA28_MASK                   0x00001000
#define _C1TXQUAH_TXQUA28_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA29_POSITION               0x0000000D
#define _C1TXQUAH_TXQUA29_MASK                   0x00002000
#define _C1TXQUAH_TXQUA29_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA30_POSITION               0x0000000E
#define _C1TXQUAH_TXQUA30_MASK                   0x00004000
#define _C1TXQUAH_TXQUA30_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA31_POSITION               0x0000000F
#define _C1TXQUAH_TXQUA31_MASK                   0x00008000
#define _C1TXQUAH_TXQUA31_LENGTH                 0x00000001

#define _C1FIFOCON1L_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON1L_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON1L_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON1L_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON1L_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON1L_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON1L_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON1L_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON1L_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON1L_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON1L_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON1L_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON1L_TXATIE_POSITION             0x00000004
#define _C1FIFOCON1L_TXATIE_MASK                 0x00000010
#define _C1FIFOCON1L_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON1L_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON1L_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON1L_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON1L_RTREN_POSITION              0x00000006
#define _C1FIFOCON1L_RTREN_MASK                  0x00000040
#define _C1FIFOCON1L_RTREN_LENGTH                0x00000001

#define _C1FIFOCON1L_TXEN_POSITION               0x00000007
#define _C1FIFOCON1L_TXEN_MASK                   0x00000080
#define _C1FIFOCON1L_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON1L_UINC_POSITION               0x00000008
#define _C1FIFOCON1L_UINC_MASK                   0x00000100
#define _C1FIFOCON1L_UINC_LENGTH                 0x00000001

#define _C1FIFOCON1L_TXREQ_POSITION              0x00000009
#define _C1FIFOCON1L_TXREQ_MASK                  0x00000200
#define _C1FIFOCON1L_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON1L_FRESET_POSITION             0x0000000A
#define _C1FIFOCON1L_FRESET_MASK                 0x00000400
#define _C1FIFOCON1L_FRESET_LENGTH               0x00000001

#define _C1FIFOCON1H_TXPRI_POSITION              0x00000000
#define _C1FIFOCON1H_TXPRI_MASK                  0x0000001F
#define _C1FIFOCON1H_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON1H_TXAT_POSITION               0x00000005
#define _C1FIFOCON1H_TXAT_MASK                   0x00000060
#define _C1FIFOCON1H_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON1H_FSIZE_POSITION              0x00000008
#define _C1FIFOCON1H_FSIZE_MASK                  0x00001F00
#define _C1FIFOCON1H_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON1H_PLSIZE_POSITION             0x0000000D
#define _C1FIFOCON1H_PLSIZE_MASK                 0x0000E000
#define _C1FIFOCON1H_PLSIZE_LENGTH               0x00000003

#define _C1FIFOCON1H_TXPRI0_POSITION             0x00000000
#define _C1FIFOCON1H_TXPRI0_MASK                 0x00000001
#define _C1FIFOCON1H_TXPRI0_LENGTH               0x00000001

#define _C1FIFOCON1H_TXPRI1_POSITION             0x00000001
#define _C1FIFOCON1H_TXPRI1_MASK                 0x00000002
#define _C1FIFOCON1H_TXPRI1_LENGTH               0x00000001

#define _C1FIFOCON1H_TXPRI2_POSITION             0x00000002
#define _C1FIFOCON1H_TXPRI2_MASK                 0x00000004
#define _C1FIFOCON1H_TXPRI2_LENGTH               0x00000001

#define _C1FIFOCON1H_TXPRI3_POSITION             0x00000003
#define _C1FIFOCON1H_TXPRI3_MASK                 0x00000008
#define _C1FIFOCON1H_TXPRI3_LENGTH               0x00000001

#define _C1FIFOCON1H_TXPRI4_POSITION             0x00000004
#define _C1FIFOCON1H_TXPRI4_MASK                 0x00000010
#define _C1FIFOCON1H_TXPRI4_LENGTH               0x00000001

#define _C1FIFOCON1H_TXAT0_POSITION              0x00000005
#define _C1FIFOCON1H_TXAT0_MASK                  0x00000020
#define _C1FIFOCON1H_TXAT0_LENGTH                0x00000001

#define _C1FIFOCON1H_TXAT1_POSITION              0x00000006
#define _C1FIFOCON1H_TXAT1_MASK                  0x00000040
#define _C1FIFOCON1H_TXAT1_LENGTH                0x00000001

#define _C1FIFOCON1H_FSIZE0_POSITION             0x00000008
#define _C1FIFOCON1H_FSIZE0_MASK                 0x00000100
#define _C1FIFOCON1H_FSIZE0_LENGTH               0x00000001

#define _C1FIFOCON1H_FSIZE1_POSITION             0x00000009
#define _C1FIFOCON1H_FSIZE1_MASK                 0x00000200
#define _C1FIFOCON1H_FSIZE1_LENGTH               0x00000001

