wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1FIFOCON2H_FSIZE4_POSITION             0x0000000C
#define _C1FIFOCON2H_FSIZE4_MASK                 0x00001000
#define _C1FIFOCON2H_FSIZE4_LENGTH               0x00000001

#define _C1FIFOCON2H_PLSIZE0_POSITION            0x0000000D
#define _C1FIFOCON2H_PLSIZE0_MASK                0x00002000
#define _C1FIFOCON2H_PLSIZE0_LENGTH              0x00000001

#define _C1FIFOCON2H_PLSIZE1_POSITION            0x0000000E
#define _C1FIFOCON2H_PLSIZE1_MASK                0x00004000
#define _C1FIFOCON2H_PLSIZE1_LENGTH              0x00000001

#define _C1FIFOCON2H_PLSIZE2_POSITION            0x0000000F
#define _C1FIFOCON2H_PLSIZE2_MASK                0x00008000
#define _C1FIFOCON2H_PLSIZE2_LENGTH              0x00000001

#define _C1FIFOSTA2_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA2_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA2_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA2_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA2_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA2_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA2_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA2_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA2_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA2_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA2_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA2_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA2_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA2_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA2_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA2_TXERR_POSITION               0x00000005
#define _C1FIFOSTA2_TXERR_MASK                   0x00000020
#define _C1FIFOSTA2_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA2_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA2_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA2_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA2_TXABT_POSITION               0x00000007
#define _C1FIFOSTA2_TXABT_MASK                   0x00000080
#define _C1FIFOSTA2_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA2_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA2_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA2_FIFOCI_LENGTH                0x00000005

#define _C1FIFOSTA2_FIFOCI0_POSITION             0x00000008
#define _C1FIFOSTA2_FIFOCI0_MASK                 0x00000100
#define _C1FIFOSTA2_FIFOCI0_LENGTH               0x00000001

#define _C1FIFOSTA2_FIFOCI1_POSITION             0x00000009
#define _C1FIFOSTA2_FIFOCI1_MASK                 0x00000200
#define _C1FIFOSTA2_FIFOCI1_LENGTH               0x00000001

#define _C1FIFOSTA2_FIFOCI2_POSITION             0x0000000A
#define _C1FIFOSTA2_FIFOCI2_MASK                 0x00000400
#define _C1FIFOSTA2_FIFOCI2_LENGTH               0x00000001

#define _C1FIFOSTA2_FIFOCI3_POSITION             0x0000000B
#define _C1FIFOSTA2_FIFOCI3_MASK                 0x00000800
#define _C1FIFOSTA2_FIFOCI3_LENGTH               0x00000001

#define _C1FIFOSTA2_FIFOCI4_POSITION             0x0000000C
#define _C1FIFOSTA2_FIFOCI4_MASK                 0x00001000
#define _C1FIFOSTA2_FIFOCI4_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA0_POSITION             0x00000000
#define _C1FIFOUA2L_FIFOUA0_MASK                 0x00000001
#define _C1FIFOUA2L_FIFOUA0_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA1_POSITION             0x00000001
#define _C1FIFOUA2L_FIFOUA1_MASK                 0x00000002
#define _C1FIFOUA2L_FIFOUA1_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA2_POSITION             0x00000002
#define _C1FIFOUA2L_FIFOUA2_MASK                 0x00000004
#define _C1FIFOUA2L_FIFOUA2_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA3_POSITION             0x00000003
#define _C1FIFOUA2L_FIFOUA3_MASK                 0x00000008
#define _C1FIFOUA2L_FIFOUA3_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA4_POSITION             0x00000004
#define _C1FIFOUA2L_FIFOUA4_MASK                 0x00000010
#define _C1FIFOUA2L_FIFOUA4_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA5_POSITION             0x00000005
#define _C1FIFOUA2L_FIFOUA5_MASK                 0x00000020
#define _C1FIFOUA2L_FIFOUA5_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA6_POSITION             0x00000006
#define _C1FIFOUA2L_FIFOUA6_MASK                 0x00000040
#define _C1FIFOUA2L_FIFOUA6_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA7_POSITION             0x00000007
#define _C1FIFOUA2L_FIFOUA7_MASK                 0x00000080
#define _C1FIFOUA2L_FIFOUA7_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA8_POSITION             0x00000008
#define _C1FIFOUA2L_FIFOUA8_MASK                 0x00000100
#define _C1FIFOUA2L_FIFOUA8_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA9_POSITION             0x00000009
#define _C1FIFOUA2L_FIFOUA9_MASK                 0x00000200
#define _C1FIFOUA2L_FIFOUA9_LENGTH               0x00000001

#define _C1FIFOUA2L_FIFOUA10_POSITION            0x0000000A
#define _C1FIFOUA2L_FIFOUA10_MASK                0x00000400
#define _C1FIFOUA2L_FIFOUA10_LENGTH              0x00000001

#define _C1FIFOUA2L_FIFOUA11_POSITION            0x0000000B
#define _C1FIFOUA2L_FIFOUA11_MASK                0x00000800
#define _C1FIFOUA2L_FIFOUA11_LENGTH              0x00000001

#define _C1FIFOUA2L_FIFOUA12_POSITION            0x0000000C
#define _C1FIFOUA2L_FIFOUA12_MASK                0x00001000
#define _C1FIFOUA2L_FIFOUA12_LENGTH              0x00000001

#define _C1FIFOUA2L_FIFOUA13_POSITION            0x0000000D
#define _C1FIFOUA2L_FIFOUA13_MASK                0x00002000
#define _C1FIFOUA2L_FIFOUA13_LENGTH              0x00000001

#define _C1FIFOUA2L_FIFOUA14_POSITION            0x0000000E
#define _C1FIFOUA2L_FIFOUA14_MASK                0x00004000
#define _C1FIFOUA2L_FIFOUA14_LENGTH              0x00000001

#define _C1FIFOUA2L_FIFOUA15_POSITION            0x0000000F
#define _C1FIFOUA2L_FIFOUA15_MASK                0x00008000
#define _C1FIFOUA2L_FIFOUA15_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA16_POSITION            0x00000000
#define _C1FIFOUA2H_FIFOUA16_MASK                0x00000001
#define _C1FIFOUA2H_FIFOUA16_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA17_POSITION            0x00000001
#define _C1FIFOUA2H_FIFOUA17_MASK                0x00000002
#define _C1FIFOUA2H_FIFOUA17_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA18_POSITION            0x00000002
#define _C1FIFOUA2H_FIFOUA18_MASK                0x00000004
#define _C1FIFOUA2H_FIFOUA18_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA19_POSITION            0x00000003
#define _C1FIFOUA2H_FIFOUA19_MASK                0x00000008
#define _C1FIFOUA2H_FIFOUA19_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA20_POSITION            0x00000004
#define _C1FIFOUA2H_FIFOUA20_MASK                0x00000010
#define _C1FIFOUA2H_FIFOUA20_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA21_POSITION            0x00000005
#define _C1FIFOUA2H_FIFOUA21_MASK                0x00000020
#define _C1FIFOUA2H_FIFOUA21_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA22_POSITION            0x00000006
#define _C1FIFOUA2H_FIFOUA22_MASK                0x00000040
#define _C1FIFOUA2H_FIFOUA22_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA23_POSITION            0x00000007
#define _C1FIFOUA2H_FIFOUA23_MASK                0x00000080
#define _C1FIFOUA2H_FIFOUA23_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA24_POSITION            0x00000008
#define _C1FIFOUA2H_FIFOUA24_MASK                0x00000100
#define _C1FIFOUA2H_FIFOUA24_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA25_POSITION            0x00000009
#define _C1FIFOUA2H_FIFOUA25_MASK                0x00000200
#define _C1FIFOUA2H_FIFOUA25_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA26_POSITION            0x0000000A
#define _C1FIFOUA2H_FIFOUA26_MASK                0x00000400
#define _C1FIFOUA2H_FIFOUA26_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA27_POSITION            0x0000000B
#define _C1FIFOUA2H_FIFOUA27_MASK                0x00000800
#define _C1FIFOUA2H_FIFOUA27_LENGTH              0x00000001

#define _C1FIFOUA2H_FIFOUA28_POSITION            0x0000000C
#define _C1FIFOUA2H_FIFOUA28_MASK                0x00001000
#define _C1FIFOUA2H_FIFOUA28_LENGTH              0x00000001

