wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1FIFOUA5H_FIFOUA29_POSITION            0x0000000D
#define _C1FIFOUA5H_FIFOUA29_MASK                0x00002000
#define _C1FIFOUA5H_FIFOUA29_LENGTH              0x00000001

#define _C1FIFOUA5H_FIFOUA30_POSITION            0x0000000E
#define _C1FIFOUA5H_FIFOUA30_MASK                0x00004000
#define _C1FIFOUA5H_FIFOUA30_LENGTH              0x00000001

#define _C1FIFOUA5H_FIFOUA31_POSITION            0x0000000F
#define _C1FIFOUA5H_FIFOUA31_MASK                0x00008000
#define _C1FIFOUA5H_FIFOUA31_LENGTH              0x00000001

#define _C1FIFOCON6L_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON6L_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON6L_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON6L_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON6L_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON6L_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON6L_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON6L_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON6L_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON6L_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON6L_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON6L_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON6L_TXATIE_POSITION             0x00000004
#define _C1FIFOCON6L_TXATIE_MASK                 0x00000010
#define _C1FIFOCON6L_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON6L_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON6L_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON6L_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON6L_RTREN_POSITION              0x00000006
#define _C1FIFOCON6L_RTREN_MASK                  0x00000040
#define _C1FIFOCON6L_RTREN_LENGTH                0x00000001

#define _C1FIFOCON6L_TXEN_POSITION               0x00000007
#define _C1FIFOCON6L_TXEN_MASK                   0x00000080
#define _C1FIFOCON6L_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON6L_UINC_POSITION               0x00000008
#define _C1FIFOCON6L_UINC_MASK                   0x00000100
#define _C1FIFOCON6L_UINC_LENGTH                 0x00000001

#define _C1FIFOCON6L_TXREQ_POSITION              0x00000009
#define _C1FIFOCON6L_TXREQ_MASK                  0x00000200
#define _C1FIFOCON6L_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON6L_FRESET_POSITION             0x0000000A
#define _C1FIFOCON6L_FRESET_MASK                 0x00000400
#define _C1FIFOCON6L_FRESET_LENGTH               0x00000001

#define _C1FIFOCON6H_TXPRI_POSITION              0x00000000
#define _C1FIFOCON6H_TXPRI_MASK                  0x0000001F
#define _C1FIFOCON6H_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON6H_TXAT_POSITION               0x00000005
#define _C1FIFOCON6H_TXAT_MASK                   0x00000060
#define _C1FIFOCON6H_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON6H_FSIZE_POSITION              0x00000008
#define _C1FIFOCON6H_FSIZE_MASK                  0x00001F00
#define _C1FIFOCON6H_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON6H_PLSIZE_POSITION             0x0000000D
#define _C1FIFOCON6H_PLSIZE_MASK                 0x0000E000
#define _C1FIFOCON6H_PLSIZE_LENGTH               0x00000003

#define _C1FIFOCON6H_TXPRI0_POSITION             0x00000000
#define _C1FIFOCON6H_TXPRI0_MASK                 0x00000001
#define _C1FIFOCON6H_TXPRI0_LENGTH               0x00000001

#define _C1FIFOCON6H_TXPRI1_POSITION             0x00000001
#define _C1FIFOCON6H_TXPRI1_MASK                 0x00000002
#define _C1FIFOCON6H_TXPRI1_LENGTH               0x00000001

#define _C1FIFOCON6H_TXPRI2_POSITION             0x00000002
#define _C1FIFOCON6H_TXPRI2_MASK                 0x00000004
#define _C1FIFOCON6H_TXPRI2_LENGTH               0x00000001

#define _C1FIFOCON6H_TXPRI3_POSITION             0x00000003
#define _C1FIFOCON6H_TXPRI3_MASK                 0x00000008
#define _C1FIFOCON6H_TXPRI3_LENGTH               0x00000001

#define _C1FIFOCON6H_TXPRI4_POSITION             0x00000004
#define _C1FIFOCON6H_TXPRI4_MASK                 0x00000010
#define _C1FIFOCON6H_TXPRI4_LENGTH               0x00000001

#define _C1FIFOCON6H_TXAT0_POSITION              0x00000005
#define _C1FIFOCON6H_TXAT0_MASK                  0x00000020
#define _C1FIFOCON6H_TXAT0_LENGTH                0x00000001

#define _C1FIFOCON6H_TXAT1_POSITION              0x00000006
#define _C1FIFOCON6H_TXAT1_MASK                  0x00000040
#define _C1FIFOCON6H_TXAT1_LENGTH                0x00000001

#define _C1FIFOCON6H_FSIZE0_POSITION             0x00000008
#define _C1FIFOCON6H_FSIZE0_MASK                 0x00000100
#define _C1FIFOCON6H_FSIZE0_LENGTH               0x00000001

#define _C1FIFOCON6H_FSIZE1_POSITION             0x00000009
#define _C1FIFOCON6H_FSIZE1_MASK                 0x00000200
#define _C1FIFOCON6H_FSIZE1_LENGTH               0x00000001

#define _C1FIFOCON6H_FSIZE2_POSITION             0x0000000A
#define _C1FIFOCON6H_FSIZE2_MASK                 0x00000400
#define _C1FIFOCON6H_FSIZE2_LENGTH               0x00000001

#define _C1FIFOCON6H_FSIZE3_POSITION             0x0000000B
#define _C1FIFOCON6H_FSIZE3_MASK                 0x00000800
#define _C1FIFOCON6H_FSIZE3_LENGTH               0x00000001

#define _C1FIFOCON6H_FSIZE4_POSITION             0x0000000C
#define _C1FIFOCON6H_FSIZE4_MASK                 0x00001000
#define _C1FIFOCON6H_FSIZE4_LENGTH               0x00000001

#define _C1FIFOCON6H_PLSIZE0_POSITION            0x0000000D
#define _C1FIFOCON6H_PLSIZE0_MASK                0x00002000
#define _C1FIFOCON6H_PLSIZE0_LENGTH              0x00000001

#define _C1FIFOCON6H_PLSIZE1_POSITION            0x0000000E
#define _C1FIFOCON6H_PLSIZE1_MASK                0x00004000
#define _C1FIFOCON6H_PLSIZE1_LENGTH              0x00000001

#define _C1FIFOCON6H_PLSIZE2_POSITION            0x0000000F
#define _C1FIFOCON6H_PLSIZE2_MASK                0x00008000
#define _C1FIFOCON6H_PLSIZE2_LENGTH              0x00000001

#define _C1FIFOSTA6_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA6_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA6_TFNRFNIF_LENGTH              0x00000001

