wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1FIFOCON7H_FSIZE3_POSITION             0x0000000B
#define _C1FIFOCON7H_FSIZE3_MASK                 0x00000800
#define _C1FIFOCON7H_FSIZE3_LENGTH               0x00000001

#define _C1FIFOCON7H_FSIZE4_POSITION             0x0000000C
#define _C1FIFOCON7H_FSIZE4_MASK                 0x00001000
#define _C1FIFOCON7H_FSIZE4_LENGTH               0x00000001

#define _C1FIFOCON7H_PLSIZE0_POSITION            0x0000000D
#define _C1FIFOCON7H_PLSIZE0_MASK                0x00002000
#define _C1FIFOCON7H_PLSIZE0_LENGTH              0x00000001

#define _C1FIFOCON7H_PLSIZE1_POSITION            0x0000000E
#define _C1FIFOCON7H_PLSIZE1_MASK                0x00004000
#define _C1FIFOCON7H_PLSIZE1_LENGTH              0x00000001

#define _C1FIFOCON7H_PLSIZE2_POSITION            0x0000000F
#define _C1FIFOCON7H_PLSIZE2_MASK                0x00008000
#define _C1FIFOCON7H_PLSIZE2_LENGTH              0x00000001

#define _C1FIFOSTA7_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA7_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA7_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA7_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA7_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA7_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA7_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA7_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA7_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA7_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA7_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA7_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA7_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA7_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA7_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA7_TXERR_POSITION               0x00000005
#define _C1FIFOSTA7_TXERR_MASK                   0x00000020
#define _C1FIFOSTA7_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA7_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA7_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA7_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA7_TXABT_POSITION               0x00000007
#define _C1FIFOSTA7_TXABT_MASK                   0x00000080
#define _C1FIFOSTA7_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA7_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA7_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA7_FIFOCI_LENGTH                0x00000005

#define _C1FIFOSTA7_FIFOCI0_POSITION             0x00000008
#define _C1FIFOSTA7_FIFOCI0_MASK                 0x00000100
#define _C1FIFOSTA7_FIFOCI0_LENGTH               0x00000001

#define _C1FIFOSTA7_FIFOCI1_POSITION             0x00000009
#define _C1FIFOSTA7_FIFOCI1_MASK                 0x00000200
#define _C1FIFOSTA7_FIFOCI1_LENGTH               0x00000001

#define _C1FIFOSTA7_FIFOCI2_POSITION             0x0000000A
#define _C1FIFOSTA7_FIFOCI2_MASK                 0x00000400
#define _C1FIFOSTA7_FIFOCI2_LENGTH               0x00000001

#define _C1FIFOSTA7_FIFOCI3_POSITION             0x0000000B
#define _C1FIFOSTA7_FIFOCI3_MASK                 0x00000800
#define _C1FIFOSTA7_FIFOCI3_LENGTH               0x00000001

#define _C1FIFOSTA7_FIFOCI4_POSITION             0x0000000C
#define _C1FIFOSTA7_FIFOCI4_MASK                 0x00001000
#define _C1FIFOSTA7_FIFOCI4_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA0_POSITION             0x00000000
#define _C1FIFOUA7L_FIFOUA0_MASK                 0x00000001
#define _C1FIFOUA7L_FIFOUA0_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA1_POSITION             0x00000001
#define _C1FIFOUA7L_FIFOUA1_MASK                 0x00000002
#define _C1FIFOUA7L_FIFOUA1_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA2_POSITION             0x00000002
#define _C1FIFOUA7L_FIFOUA2_MASK                 0x00000004
#define _C1FIFOUA7L_FIFOUA2_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA3_POSITION             0x00000003
#define _C1FIFOUA7L_FIFOUA3_MASK                 0x00000008
#define _C1FIFOUA7L_FIFOUA3_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA4_POSITION             0x00000004
#define _C1FIFOUA7L_FIFOUA4_MASK                 0x00000010
#define _C1FIFOUA7L_FIFOUA4_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA5_POSITION             0x00000005
#define _C1FIFOUA7L_FIFOUA5_MASK                 0x00000020
#define _C1FIFOUA7L_FIFOUA5_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA6_POSITION             0x00000006
#define _C1FIFOUA7L_FIFOUA6_MASK                 0x00000040
#define _C1FIFOUA7L_FIFOUA6_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA7_POSITION             0x00000007
#define _C1FIFOUA7L_FIFOUA7_MASK                 0x00000080
#define _C1FIFOUA7L_FIFOUA7_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA8_POSITION             0x00000008
#define _C1FIFOUA7L_FIFOUA8_MASK                 0x00000100
#define _C1FIFOUA7L_FIFOUA8_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA9_POSITION             0x00000009
#define _C1FIFOUA7L_FIFOUA9_MASK                 0x00000200
#define _C1FIFOUA7L_FIFOUA9_LENGTH               0x00000001

#define _C1FIFOUA7L_FIFOUA10_POSITION            0x0000000A
#define _C1FIFOUA7L_FIFOUA10_MASK                0x00000400
#define _C1FIFOUA7L_FIFOUA10_LENGTH              0x00000001

#define _C1FIFOUA7L_FIFOUA11_POSITION            0x0000000B
#define _C1FIFOUA7L_FIFOUA11_MASK                0x00000800
#define _C1FIFOUA7L_FIFOUA11_LENGTH              0x00000001

#define _C1FIFOUA7L_FIFOUA12_POSITION            0x0000000C
#define _C1FIFOUA7L_FIFOUA12_MASK                0x00001000
#define _C1FIFOUA7L_FIFOUA12_LENGTH              0x00000001

#define _C1FIFOUA7L_FIFOUA13_POSITION            0x0000000D
#define _C1FIFOUA7L_FIFOUA13_MASK                0x00002000
#define _C1FIFOUA7L_FIFOUA13_LENGTH              0x00000001

#define _C1FIFOUA7L_FIFOUA14_POSITION            0x0000000E
#define _C1FIFOUA7L_FIFOUA14_MASK                0x00004000
#define _C1FIFOUA7L_FIFOUA14_LENGTH              0x00000001

