wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1FIFOUA7L_FIFOUA15_POSITION            0x0000000F
#define _C1FIFOUA7L_FIFOUA15_MASK                0x00008000
#define _C1FIFOUA7L_FIFOUA15_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA16_POSITION            0x00000000
#define _C1FIFOUA7H_FIFOUA16_MASK                0x00000001
#define _C1FIFOUA7H_FIFOUA16_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA17_POSITION            0x00000001
#define _C1FIFOUA7H_FIFOUA17_MASK                0x00000002
#define _C1FIFOUA7H_FIFOUA17_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA18_POSITION            0x00000002
#define _C1FIFOUA7H_FIFOUA18_MASK                0x00000004
#define _C1FIFOUA7H_FIFOUA18_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA19_POSITION            0x00000003
#define _C1FIFOUA7H_FIFOUA19_MASK                0x00000008
#define _C1FIFOUA7H_FIFOUA19_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA20_POSITION            0x00000004
#define _C1FIFOUA7H_FIFOUA20_MASK                0x00000010
#define _C1FIFOUA7H_FIFOUA20_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA21_POSITION            0x00000005
#define _C1FIFOUA7H_FIFOUA21_MASK                0x00000020
#define _C1FIFOUA7H_FIFOUA21_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA22_POSITION            0x00000006
#define _C1FIFOUA7H_FIFOUA22_MASK                0x00000040
#define _C1FIFOUA7H_FIFOUA22_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA23_POSITION            0x00000007
#define _C1FIFOUA7H_FIFOUA23_MASK                0x00000080
#define _C1FIFOUA7H_FIFOUA23_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA24_POSITION            0x00000008
#define _C1FIFOUA7H_FIFOUA24_MASK                0x00000100
#define _C1FIFOUA7H_FIFOUA24_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA25_POSITION            0x00000009
#define _C1FIFOUA7H_FIFOUA25_MASK                0x00000200
#define _C1FIFOUA7H_FIFOUA25_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA26_POSITION            0x0000000A
#define _C1FIFOUA7H_FIFOUA26_MASK                0x00000400
#define _C1FIFOUA7H_FIFOUA26_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA27_POSITION            0x0000000B
#define _C1FIFOUA7H_FIFOUA27_MASK                0x00000800
#define _C1FIFOUA7H_FIFOUA27_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA28_POSITION            0x0000000C
#define _C1FIFOUA7H_FIFOUA28_MASK                0x00001000
#define _C1FIFOUA7H_FIFOUA28_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA29_POSITION            0x0000000D
#define _C1FIFOUA7H_FIFOUA29_MASK                0x00002000
#define _C1FIFOUA7H_FIFOUA29_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA30_POSITION            0x0000000E
#define _C1FIFOUA7H_FIFOUA30_MASK                0x00004000
#define _C1FIFOUA7H_FIFOUA30_LENGTH              0x00000001

#define _C1FIFOUA7H_FIFOUA31_POSITION            0x0000000F
#define _C1FIFOUA7H_FIFOUA31_MASK                0x00008000
#define _C1FIFOUA7H_FIFOUA31_LENGTH              0x00000001

#define _C1FLTCON0L_F0BP_POSITION                0x00000000
#define _C1FLTCON0L_F0BP_MASK                    0x0000001F
#define _C1FLTCON0L_F0BP_LENGTH                  0x00000005

#define _C1FLTCON0L_FLTEN0_POSITION              0x00000007
#define _C1FLTCON0L_FLTEN0_MASK                  0x00000080
#define _C1FLTCON0L_FLTEN0_LENGTH                0x00000001

#define _C1FLTCON0L_F1BP_POSITION                0x00000008
#define _C1FLTCON0L_F1BP_MASK                    0x00001F00
#define _C1FLTCON0L_F1BP_LENGTH                  0x00000005

#define _C1FLTCON0L_FLTEN1_POSITION              0x0000000F
#define _C1FLTCON0L_FLTEN1_MASK                  0x00008000
#define _C1FLTCON0L_FLTEN1_LENGTH                0x00000001

#define _C1FLTCON0H_F2BP_POSITION                0x00000000
#define _C1FLTCON0H_F2BP_MASK                    0x0000001F
#define _C1FLTCON0H_F2BP_LENGTH                  0x00000005

#define _C1FLTCON0H_FLTEN2_POSITION              0x00000007
#define _C1FLTCON0H_FLTEN2_MASK                  0x00000080
#define _C1FLTCON0H_FLTEN2_LENGTH                0x00000001

#define _C1FLTCON0H_F3BP_POSITION                0x00000008
#define _C1FLTCON0H_F3BP_MASK                    0x00001F00
#define _C1FLTCON0H_F3BP_LENGTH                  0x00000005

#define _C1FLTCON0H_FLTEN3_POSITION              0x0000000F
#define _C1FLTCON0H_FLTEN3_MASK                  0x00008000
#define _C1FLTCON0H_FLTEN3_LENGTH                0x00000001

#define _C1FLTCON1L_F4BP_POSITION                0x00000000
#define _C1FLTCON1L_F4BP_MASK                    0x0000001F
#define _C1FLTCON1L_F4BP_LENGTH                  0x00000005

#define _C1FLTCON1L_FLTEN4_POSITION              0x00000007
#define _C1FLTCON1L_FLTEN4_MASK                  0x00000080
#define _C1FLTCON1L_FLTEN4_LENGTH                0x00000001

#define _C1FLTCON1L_F5BP_POSITION                0x00000008
#define _C1FLTCON1L_F5BP_MASK                    0x00001F00
#define _C1FLTCON1L_F5BP_LENGTH                  0x00000005

#define _C1FLTCON1L_FLTEN5_POSITION              0x0000000F
#define _C1FLTCON1L_FLTEN5_MASK                  0x00008000
#define _C1FLTCON1L_FLTEN5_LENGTH                0x00000001

#define _C1FLTCON1H_F6BP_POSITION                0x00000000
#define _C1FLTCON1H_F6BP_MASK                    0x0000001F
#define _C1FLTCON1H_F6BP_LENGTH                  0x00000005

#define _C1FLTCON1H_FLTEN6_POSITION              0x00000007
#define _C1FLTCON1H_FLTEN6_MASK                  0x00000080
#define _C1FLTCON1H_FLTEN6_LENGTH                0x00000001

#define _C1FLTCON1H_F7BP_POSITION                0x00000008
#define _C1FLTCON1H_F7BP_MASK                    0x00001F00
#define _C1FLTCON1H_F7BP_LENGTH                  0x00000005

#define _C1FLTCON1H_FLTEN7_POSITION              0x0000000F
#define _C1FLTCON1H_FLTEN7_MASK                  0x00008000
#define _C1FLTCON1H_FLTEN7_LENGTH                0x00000001

#define _C1FLTCON2L_F8BP_POSITION                0x00000000
#define _C1FLTCON2L_F8BP_MASK                    0x0000001F
#define _C1FLTCON2L_F8BP_LENGTH                  0x00000005

#define _C1FLTCON2L_FLTEN8_POSITION              0x00000007
#define _C1FLTCON2L_FLTEN8_MASK                  0x00000080
#define _C1FLTCON2L_FLTEN8_LENGTH                0x00000001

#define _C1FLTCON2L_F9BP_POSITION                0x00000008
#define _C1FLTCON2L_F9BP_MASK                    0x00001F00
#define _C1FLTCON2L_F9BP_LENGTH                  0x00000005

#define _C1FLTCON2L_FLTEN9_POSITION              0x0000000F
#define _C1FLTCON2L_FLTEN9_MASK                  0x00008000
#define _C1FLTCON2L_FLTEN9_LENGTH                0x00000001

#define _C1FLTCON2H_F10BP_POSITION               0x00000000
#define _C1FLTCON2H_F10BP_MASK                   0x0000001F
#define _C1FLTCON2H_F10BP_LENGTH                 0x00000005

#define _C1FLTCON2H_FLTEN10_POSITION             0x00000007
#define _C1FLTCON2H_FLTEN10_MASK                 0x00000080
#define _C1FLTCON2H_FLTEN10_LENGTH               0x00000001

#define _C1FLTCON2H_F11BP_POSITION               0x00000008
#define _C1FLTCON2H_F11BP_MASK                   0x00001F00
#define _C1FLTCON2H_F11BP_LENGTH                 0x00000005

