wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1FLTOBJ9L_SID5_POSITION                0x00000005
#define _C1FLTOBJ9L_SID5_MASK                    0x00000020
#define _C1FLTOBJ9L_SID5_LENGTH                  0x00000001

#define _C1FLTOBJ9L_SID6_POSITION                0x00000006
#define _C1FLTOBJ9L_SID6_MASK                    0x00000040
#define _C1FLTOBJ9L_SID6_LENGTH                  0x00000001

#define _C1FLTOBJ9L_SID7_POSITION                0x00000007
#define _C1FLTOBJ9L_SID7_MASK                    0x00000080
#define _C1FLTOBJ9L_SID7_LENGTH                  0x00000001

#define _C1FLTOBJ9L_SID8_POSITION                0x00000008
#define _C1FLTOBJ9L_SID8_MASK                    0x00000100
#define _C1FLTOBJ9L_SID8_LENGTH                  0x00000001

#define _C1FLTOBJ9L_SID9_POSITION                0x00000009
#define _C1FLTOBJ9L_SID9_MASK                    0x00000200
#define _C1FLTOBJ9L_SID9_LENGTH                  0x00000001

#define _C1FLTOBJ9L_SID10_POSITION               0x0000000A
#define _C1FLTOBJ9L_SID10_MASK                   0x00000400
#define _C1FLTOBJ9L_SID10_LENGTH                 0x00000001

#define _C1FLTOBJ9L_EID0_POSITION                0x0000000B
#define _C1FLTOBJ9L_EID0_MASK                    0x00000800
#define _C1FLTOBJ9L_EID0_LENGTH                  0x00000001

#define _C1FLTOBJ9L_EID1_POSITION                0x0000000C
#define _C1FLTOBJ9L_EID1_MASK                    0x00001000
#define _C1FLTOBJ9L_EID1_LENGTH                  0x00000001

#define _C1FLTOBJ9L_EID2_POSITION                0x0000000D
#define _C1FLTOBJ9L_EID2_MASK                    0x00002000
#define _C1FLTOBJ9L_EID2_LENGTH                  0x00000001

#define _C1FLTOBJ9L_EID3_POSITION                0x0000000E
#define _C1FLTOBJ9L_EID3_MASK                    0x00004000
#define _C1FLTOBJ9L_EID3_LENGTH                  0x00000001

#define _C1FLTOBJ9L_EID4_POSITION                0x0000000F
#define _C1FLTOBJ9L_EID4_MASK                    0x00008000
#define _C1FLTOBJ9L_EID4_LENGTH                  0x00000001

#define _C1FLTOBJ9H_EID5_POSITION                0x00000000
#define _C1FLTOBJ9H_EID5_MASK                    0x00000001
#define _C1FLTOBJ9H_EID5_LENGTH                  0x00000001

#define _C1FLTOBJ9H_EID6_POSITION                0x00000001
#define _C1FLTOBJ9H_EID6_MASK                    0x00000002
#define _C1FLTOBJ9H_EID6_LENGTH                  0x00000001

#define _C1FLTOBJ9H_EID7_POSITION                0x00000002
#define _C1FLTOBJ9H_EID7_MASK                    0x00000004
#define _C1FLTOBJ9H_EID7_LENGTH                  0x00000001

#define _C1FLTOBJ9H_EID8_POSITION                0x00000003
#define _C1FLTOBJ9H_EID8_MASK                    0x00000008
#define _C1FLTOBJ9H_EID8_LENGTH                  0x00000001

#define _C1FLTOBJ9H_EID9_POSITION                0x00000004
#define _C1FLTOBJ9H_EID9_MASK                    0x00000010
#define _C1FLTOBJ9H_EID9_LENGTH                  0x00000001

#define _C1FLTOBJ9H_EID10_POSITION               0x00000005
#define _C1FLTOBJ9H_EID10_MASK                   0x00000020
#define _C1FLTOBJ9H_EID10_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID11_POSITION               0x00000006
#define _C1FLTOBJ9H_EID11_MASK                   0x00000040
#define _C1FLTOBJ9H_EID11_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID12_POSITION               0x00000007
#define _C1FLTOBJ9H_EID12_MASK                   0x00000080
#define _C1FLTOBJ9H_EID12_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID13_POSITION               0x00000008
#define _C1FLTOBJ9H_EID13_MASK                   0x00000100
#define _C1FLTOBJ9H_EID13_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID14_POSITION               0x00000009
#define _C1FLTOBJ9H_EID14_MASK                   0x00000200
#define _C1FLTOBJ9H_EID14_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID15_POSITION               0x0000000A
#define _C1FLTOBJ9H_EID15_MASK                   0x00000400
#define _C1FLTOBJ9H_EID15_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID16_POSITION               0x0000000B
#define _C1FLTOBJ9H_EID16_MASK                   0x00000800
#define _C1FLTOBJ9H_EID16_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EID17_POSITION               0x0000000C
#define _C1FLTOBJ9H_EID17_MASK                   0x00001000
#define _C1FLTOBJ9H_EID17_LENGTH                 0x00000001

#define _C1FLTOBJ9H_SID11_POSITION               0x0000000D
#define _C1FLTOBJ9H_SID11_MASK                   0x00002000
#define _C1FLTOBJ9H_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ9H_EXIDE_POSITION               0x0000000E
#define _C1FLTOBJ9H_EXIDE_MASK                   0x00004000
#define _C1FLTOBJ9H_EXIDE_LENGTH                 0x00000001

#define _C1MASK9L_MSID0_POSITION                 0x00000000
#define _C1MASK9L_MSID0_MASK                     0x00000001
#define _C1MASK9L_MSID0_LENGTH                   0x00000001

#define _C1MASK9L_MSID1_POSITION                 0x00000001
#define _C1MASK9L_MSID1_MASK                     0x00000002
#define _C1MASK9L_MSID1_LENGTH                   0x00000001

#define _C1MASK9L_MSID2_POSITION                 0x00000002
#define _C1MASK9L_MSID2_MASK                     0x00000004
#define _C1MASK9L_MSID2_LENGTH                   0x00000001

#define _C1MASK9L_MSID3_POSITION                 0x00000003
#define _C1MASK9L_MSID3_MASK                     0x00000008
#define _C1MASK9L_MSID3_LENGTH                   0x00000001

#define _C1MASK9L_MSID4_POSITION                 0x00000004
#define _C1MASK9L_MSID4_MASK                     0x00000010
#define _C1MASK9L_MSID4_LENGTH                   0x00000001

#define _C1MASK9L_MSID5_POSITION                 0x00000005
#define _C1MASK9L_MSID5_MASK                     0x00000020
#define _C1MASK9L_MSID5_LENGTH                   0x00000001

#define _C1MASK9L_MSID6_POSITION                 0x00000006
#define _C1MASK9L_MSID6_MASK                     0x00000040
#define _C1MASK9L_MSID6_LENGTH                   0x00000001

#define _C1MASK9L_MSID7_POSITION                 0x00000007
#define _C1MASK9L_MSID7_MASK                     0x00000080
#define _C1MASK9L_MSID7_LENGTH                   0x00000001

