wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1FLTOBJ11H_EID9_POSITION               0x00000004
#define _C1FLTOBJ11H_EID9_MASK                   0x00000010
#define _C1FLTOBJ11H_EID9_LENGTH                 0x00000001

#define _C1FLTOBJ11H_EID10_POSITION              0x00000005
#define _C1FLTOBJ11H_EID10_MASK                  0x00000020
#define _C1FLTOBJ11H_EID10_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID11_POSITION              0x00000006
#define _C1FLTOBJ11H_EID11_MASK                  0x00000040
#define _C1FLTOBJ11H_EID11_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID12_POSITION              0x00000007
#define _C1FLTOBJ11H_EID12_MASK                  0x00000080
#define _C1FLTOBJ11H_EID12_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID13_POSITION              0x00000008
#define _C1FLTOBJ11H_EID13_MASK                  0x00000100
#define _C1FLTOBJ11H_EID13_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID14_POSITION              0x00000009
#define _C1FLTOBJ11H_EID14_MASK                  0x00000200
#define _C1FLTOBJ11H_EID14_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID15_POSITION              0x0000000A
#define _C1FLTOBJ11H_EID15_MASK                  0x00000400
#define _C1FLTOBJ11H_EID15_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID16_POSITION              0x0000000B
#define _C1FLTOBJ11H_EID16_MASK                  0x00000800
#define _C1FLTOBJ11H_EID16_LENGTH                0x00000001

#define _C1FLTOBJ11H_EID17_POSITION              0x0000000C
#define _C1FLTOBJ11H_EID17_MASK                  0x00001000
#define _C1FLTOBJ11H_EID17_LENGTH                0x00000001

#define _C1FLTOBJ11H_SID11_POSITION              0x0000000D
#define _C1FLTOBJ11H_SID11_MASK                  0x00002000
#define _C1FLTOBJ11H_SID11_LENGTH                0x00000001

#define _C1FLTOBJ11H_EXIDE_POSITION              0x0000000E
#define _C1FLTOBJ11H_EXIDE_MASK                  0x00004000
#define _C1FLTOBJ11H_EXIDE_LENGTH                0x00000001

#define _C1MASK11L_MSID0_POSITION                0x00000000
#define _C1MASK11L_MSID0_MASK                    0x00000001
#define _C1MASK11L_MSID0_LENGTH                  0x00000001

#define _C1MASK11L_MSID1_POSITION                0x00000001
#define _C1MASK11L_MSID1_MASK                    0x00000002
#define _C1MASK11L_MSID1_LENGTH                  0x00000001

#define _C1MASK11L_MSID2_POSITION                0x00000002
#define _C1MASK11L_MSID2_MASK                    0x00000004
#define _C1MASK11L_MSID2_LENGTH                  0x00000001

#define _C1MASK11L_MSID3_POSITION                0x00000003
#define _C1MASK11L_MSID3_MASK                    0x00000008
#define _C1MASK11L_MSID3_LENGTH                  0x00000001

#define _C1MASK11L_MSID4_POSITION                0x00000004
#define _C1MASK11L_MSID4_MASK                    0x00000010
#define _C1MASK11L_MSID4_LENGTH                  0x00000001

#define _C1MASK11L_MSID5_POSITION                0x00000005
#define _C1MASK11L_MSID5_MASK                    0x00000020
#define _C1MASK11L_MSID5_LENGTH                  0x00000001

#define _C1MASK11L_MSID6_POSITION                0x00000006
#define _C1MASK11L_MSID6_MASK                    0x00000040
#define _C1MASK11L_MSID6_LENGTH                  0x00000001

#define _C1MASK11L_MSID7_POSITION                0x00000007
#define _C1MASK11L_MSID7_MASK                    0x00000080
#define _C1MASK11L_MSID7_LENGTH                  0x00000001

#define _C1MASK11L_MSID8_POSITION                0x00000008
#define _C1MASK11L_MSID8_MASK                    0x00000100
#define _C1MASK11L_MSID8_LENGTH                  0x00000001

#define _C1MASK11L_MSID9_POSITION                0x00000009
#define _C1MASK11L_MSID9_MASK                    0x00000200
#define _C1MASK11L_MSID9_LENGTH                  0x00000001

#define _C1MASK11L_MSID10_POSITION               0x0000000A
#define _C1MASK11L_MSID10_MASK                   0x00000400
#define _C1MASK11L_MSID10_LENGTH                 0x00000001

#define _C1MASK11L_MEID0_POSITION                0x0000000B
#define _C1MASK11L_MEID0_MASK                    0x00000800
#define _C1MASK11L_MEID0_LENGTH                  0x00000001

#define _C1MASK11L_MEID1_POSITION                0x0000000C
#define _C1MASK11L_MEID1_MASK                    0x00001000
#define _C1MASK11L_MEID1_LENGTH                  0x00000001

#define _C1MASK11L_MEID2_POSITION                0x0000000D
#define _C1MASK11L_MEID2_MASK                    0x00002000
#define _C1MASK11L_MEID2_LENGTH                  0x00000001

#define _C1MASK11L_MEID3_POSITION                0x0000000E
#define _C1MASK11L_MEID3_MASK                    0x00004000
#define _C1MASK11L_MEID3_LENGTH                  0x00000001

#define _C1MASK11L_MEID4_POSITION                0x0000000F
#define _C1MASK11L_MEID4_MASK                    0x00008000
#define _C1MASK11L_MEID4_LENGTH                  0x00000001

#define _C1MASK11H_MEID5_POSITION                0x00000000
#define _C1MASK11H_MEID5_MASK                    0x00000001
#define _C1MASK11H_MEID5_LENGTH                  0x00000001

#define _C1MASK11H_MEID6_POSITION                0x00000001
#define _C1MASK11H_MEID6_MASK                    0x00000002
#define _C1MASK11H_MEID6_LENGTH                  0x00000001

#define _C1MASK11H_MEID7_POSITION                0x00000002
#define _C1MASK11H_MEID7_MASK                    0x00000004
#define _C1MASK11H_MEID7_LENGTH                  0x00000001

#define _C1MASK11H_MEID8_POSITION                0x00000003
#define _C1MASK11H_MEID8_MASK                    0x00000008
#define _C1MASK11H_MEID8_LENGTH                  0x00000001

#define _C1MASK11H_MEID9_POSITION                0x00000004
#define _C1MASK11H_MEID9_MASK                    0x00000010
#define _C1MASK11H_MEID9_LENGTH                  0x00000001

#define _C1MASK11H_MEID10_POSITION               0x00000005
#define _C1MASK11H_MEID10_MASK                   0x00000020
#define _C1MASK11H_MEID10_LENGTH                 0x00000001

#define _C1MASK11H_MEID11_POSITION               0x00000006
#define _C1MASK11H_MEID11_MASK                   0x00000040
#define _C1MASK11H_MEID11_LENGTH                 0x00000001

#define _C1MASK11H_MEID12_POSITION               0x00000007
#define _C1MASK11H_MEID12_MASK                   0x00000080
#define _C1MASK11H_MEID12_LENGTH                 0x00000001

#define _C1MASK11H_MEID13_POSITION               0x00000008
#define _C1MASK11H_MEID13_MASK                   0x00000100
#define _C1MASK11H_MEID13_LENGTH                 0x00000001

#define _C1MASK11H_MEID14_POSITION               0x00000009
#define _C1MASK11H_MEID14_MASK                   0x00000200
#define _C1MASK11H_MEID14_LENGTH                 0x00000001

