wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _C1MASK15L_MSID4_POSITION                0x00000004
#define _C1MASK15L_MSID4_MASK                    0x00000010
#define _C1MASK15L_MSID4_LENGTH                  0x00000001

#define _C1MASK15L_MSID5_POSITION                0x00000005
#define _C1MASK15L_MSID5_MASK                    0x00000020
#define _C1MASK15L_MSID5_LENGTH                  0x00000001

#define _C1MASK15L_MSID6_POSITION                0x00000006
#define _C1MASK15L_MSID6_MASK                    0x00000040
#define _C1MASK15L_MSID6_LENGTH                  0x00000001

#define _C1MASK15L_MSID7_POSITION                0x00000007
#define _C1MASK15L_MSID7_MASK                    0x00000080
#define _C1MASK15L_MSID7_LENGTH                  0x00000001

#define _C1MASK15L_MSID8_POSITION                0x00000008
#define _C1MASK15L_MSID8_MASK                    0x00000100
#define _C1MASK15L_MSID8_LENGTH                  0x00000001

#define _C1MASK15L_MSID9_POSITION                0x00000009
#define _C1MASK15L_MSID9_MASK                    0x00000200
#define _C1MASK15L_MSID9_LENGTH                  0x00000001

#define _C1MASK15L_MSID10_POSITION               0x0000000A
#define _C1MASK15L_MSID10_MASK                   0x00000400
#define _C1MASK15L_MSID10_LENGTH                 0x00000001

#define _C1MASK15L_MEID0_POSITION                0x0000000B
#define _C1MASK15L_MEID0_MASK                    0x00000800
#define _C1MASK15L_MEID0_LENGTH                  0x00000001

#define _C1MASK15L_MEID1_POSITION                0x0000000C
#define _C1MASK15L_MEID1_MASK                    0x00001000
#define _C1MASK15L_MEID1_LENGTH                  0x00000001

#define _C1MASK15L_MEID2_POSITION                0x0000000D
#define _C1MASK15L_MEID2_MASK                    0x00002000
#define _C1MASK15L_MEID2_LENGTH                  0x00000001

#define _C1MASK15L_MEID3_POSITION                0x0000000E
#define _C1MASK15L_MEID3_MASK                    0x00004000
#define _C1MASK15L_MEID3_LENGTH                  0x00000001

#define _C1MASK15L_MEID4_POSITION                0x0000000F
#define _C1MASK15L_MEID4_MASK                    0x00008000
#define _C1MASK15L_MEID4_LENGTH                  0x00000001

#define _C1MASK15H_MEID5_POSITION                0x00000000
#define _C1MASK15H_MEID5_MASK                    0x00000001
#define _C1MASK15H_MEID5_LENGTH                  0x00000001

#define _C1MASK15H_MEID6_POSITION                0x00000001
#define _C1MASK15H_MEID6_MASK                    0x00000002
#define _C1MASK15H_MEID6_LENGTH                  0x00000001

#define _C1MASK15H_MEID7_POSITION                0x00000002
#define _C1MASK15H_MEID7_MASK                    0x00000004
#define _C1MASK15H_MEID7_LENGTH                  0x00000001

#define _C1MASK15H_MEID8_POSITION                0x00000003
#define _C1MASK15H_MEID8_MASK                    0x00000008
#define _C1MASK15H_MEID8_LENGTH                  0x00000001

#define _C1MASK15H_MEID9_POSITION                0x00000004
#define _C1MASK15H_MEID9_MASK                    0x00000010
#define _C1MASK15H_MEID9_LENGTH                  0x00000001

#define _C1MASK15H_MEID10_POSITION               0x00000005
#define _C1MASK15H_MEID10_MASK                   0x00000020
#define _C1MASK15H_MEID10_LENGTH                 0x00000001

#define _C1MASK15H_MEID11_POSITION               0x00000006
#define _C1MASK15H_MEID11_MASK                   0x00000040
#define _C1MASK15H_MEID11_LENGTH                 0x00000001

#define _C1MASK15H_MEID12_POSITION               0x00000007
#define _C1MASK15H_MEID12_MASK                   0x00000080
#define _C1MASK15H_MEID12_LENGTH                 0x00000001

#define _C1MASK15H_MEID13_POSITION               0x00000008
#define _C1MASK15H_MEID13_MASK                   0x00000100
#define _C1MASK15H_MEID13_LENGTH                 0x00000001

#define _C1MASK15H_MEID14_POSITION               0x00000009
#define _C1MASK15H_MEID14_MASK                   0x00000200
#define _C1MASK15H_MEID14_LENGTH                 0x00000001

#define _C1MASK15H_MEID15_POSITION               0x0000000A
#define _C1MASK15H_MEID15_MASK                   0x00000400
#define _C1MASK15H_MEID15_LENGTH                 0x00000001

#define _C1MASK15H_MEID16_POSITION               0x0000000B
#define _C1MASK15H_MEID16_MASK                   0x00000800
#define _C1MASK15H_MEID16_LENGTH                 0x00000001

#define _C1MASK15H_MEID17_POSITION               0x0000000C
#define _C1MASK15H_MEID17_MASK                   0x00001000
#define _C1MASK15H_MEID17_LENGTH                 0x00000001

#define _C1MASK15H_MSID11_POSITION               0x0000000D
#define _C1MASK15H_MSID11_MASK                   0x00002000
#define _C1MASK15H_MSID11_LENGTH                 0x00000001

#define _C1MASK15H_MIDE_POSITION                 0x0000000E
#define _C1MASK15H_MIDE_MASK                     0x00004000
#define _C1MASK15H_MIDE_LENGTH                   0x00000001

#define _IFS0_INT0IF_POSITION                    0x00000000
#define _IFS0_INT0IF_MASK                        0x00000001
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_T1IF_POSITION                      0x00000001
#define _IFS0_T1IF_MASK                          0x00000002
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_CNAIF_POSITION                     0x00000002
#define _IFS0_CNAIF_MASK                         0x00000004
#define _IFS0_CNAIF_LENGTH                       0x00000001

#define _IFS0_CNBIF_POSITION                     0x00000003
#define _IFS0_CNBIF_MASK                         0x00000008
#define _IFS0_CNBIF_LENGTH                       0x00000001

#define _IFS0_DMA0IF_POSITION                    0x00000004
#define _IFS0_DMA0IF_MASK                        0x00000010
#define _IFS0_DMA0IF_LENGTH                      0x00000001

#define _IFS0_CCP1IF_POSITION                    0x00000006
#define _IFS0_CCP1IF_MASK                        0x00000040
#define _IFS0_CCP1IF_LENGTH                      0x00000001

#define _IFS0_CCT1IF_POSITION                    0x00000007
#define _IFS0_CCT1IF_MASK                        0x00000080
#define _IFS0_CCT1IF_LENGTH                      0x00000001

#define _IFS0_DMA1IF_POSITION                    0x00000008
#define _IFS0_DMA1IF_MASK                        0x00000100
#define _IFS0_DMA1IF_LENGTH                      0x00000001

#define _IFS0_SPI1RXIF_POSITION                  0x00000009
#define _IFS0_SPI1RXIF_MASK                      0x00000200
#define _IFS0_SPI1RXIF_LENGTH                    0x00000001

#define _IFS0_SPI1TXIF_POSITION                  0x0000000A
#define _IFS0_SPI1TXIF_MASK                      0x00000400
#define _IFS0_SPI1TXIF_LENGTH                    0x00000001

#define _IFS0_U1RXIF_POSITION                    0x0000000B
#define _IFS0_U1RXIF_MASK                        0x00000800
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x0000000C
#define _IFS0_U1TXIF_MASK                        0x00001000
#define _IFS0_U1TXIF_LENGTH                      0x00000001

#define _IFS0_ECCSBEIF_POSITION                  0x0000000D
#define _IFS0_ECCSBEIF_MASK                      0x00002000
#define _IFS0_ECCSBEIF_LENGTH                    0x00000001

#define _IFS0_NVMIF_POSITION                     0x0000000E
#define _IFS0_NVMIF_MASK                         0x00004000
#define _IFS0_NVMIF_LENGTH                       0x00000001

#define _IFS0_INT1IF_POSITION                    0x0000000F
#define _IFS0_INT1IF_MASK                        0x00008000
#define _IFS0_INT1IF_LENGTH                      0x00000001

