wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _IFS6_ADCAN15IF_POSITION                 0x0000000A
#define _IFS6_ADCAN15IF_MASK                     0x00000400
#define _IFS6_ADCAN15IF_LENGTH                   0x00000001

#define _IFS6_ADCAN16IF_POSITION                 0x0000000B
#define _IFS6_ADCAN16IF_MASK                     0x00000800
#define _IFS6_ADCAN16IF_LENGTH                   0x00000001

#define _IFS6_ADCAN17IF_POSITION                 0x0000000C
#define _IFS6_ADCAN17IF_MASK                     0x00001000
#define _IFS6_ADCAN17IF_LENGTH                   0x00000001

#define _IFS6_ADCAN18IF_POSITION                 0x0000000D
#define _IFS6_ADCAN18IF_MASK                     0x00002000
#define _IFS6_ADCAN18IF_LENGTH                   0x00000001

#define _IFS6_ADCAN19IF_POSITION                 0x0000000E
#define _IFS6_ADCAN19IF_MASK                     0x00004000
#define _IFS6_ADCAN19IF_LENGTH                   0x00000001

#define _IFS7_ADFLTIF_POSITION                   0x00000003
#define _IFS7_ADFLTIF_MASK                       0x00000008
#define _IFS7_ADFLTIF_LENGTH                     0x00000001

#define _IFS7_ADCMP0IF_POSITION                  0x00000004
#define _IFS7_ADCMP0IF_MASK                      0x00000010
#define _IFS7_ADCMP0IF_LENGTH                    0x00000001

#define _IFS7_ADCMP1IF_POSITION                  0x00000005
#define _IFS7_ADCMP1IF_MASK                      0x00000020
#define _IFS7_ADCMP1IF_LENGTH                    0x00000001

#define _IFS7_ADCMP2IF_POSITION                  0x00000006
#define _IFS7_ADCMP2IF_MASK                      0x00000040
#define _IFS7_ADCMP2IF_LENGTH                    0x00000001

#define _IFS7_ADCMP3IF_POSITION                  0x00000007
#define _IFS7_ADCMP3IF_MASK                      0x00000080
#define _IFS7_ADCMP3IF_LENGTH                    0x00000001

#define _IFS7_ADFLTR0IF_POSITION                 0x00000008
#define _IFS7_ADFLTR0IF_MASK                     0x00000100
#define _IFS7_ADFLTR0IF_LENGTH                   0x00000001

#define _IFS7_ADFLTR1IF_POSITION                 0x00000009
#define _IFS7_ADFLTR1IF_MASK                     0x00000200
#define _IFS7_ADFLTR1IF_LENGTH                   0x00000001

#define _IFS7_ADFLTR2IF_POSITION                 0x0000000A
#define _IFS7_ADFLTR2IF_MASK                     0x00000400
#define _IFS7_ADFLTR2IF_LENGTH                   0x00000001

#define _IFS7_ADFLTR3IF_POSITION                 0x0000000B
#define _IFS7_ADFLTR3IF_MASK                     0x00000800
#define _IFS7_ADFLTR3IF_LENGTH                   0x00000001

#define _IFS7_CLC1PIF_POSITION                   0x0000000C
#define _IFS7_CLC1PIF_MASK                       0x00001000
#define _IFS7_CLC1PIF_LENGTH                     0x00000001

#define _IFS7_CLC2PIF_POSITION                   0x0000000D
#define _IFS7_CLC2PIF_MASK                       0x00002000
#define _IFS7_CLC2PIF_LENGTH                     0x00000001

#define _IFS7_SPI1IF_POSITION                    0x0000000E
#define _IFS7_SPI1IF_MASK                        0x00004000
#define _IFS7_SPI1IF_LENGTH                      0x00000001

#define _IFS7_SPI2IF_POSITION                    0x0000000F
#define _IFS7_SPI2IF_MASK                        0x00008000
#define _IFS7_SPI2IF_LENGTH                      0x00000001

#define _IFS8_SPI3IF_POSITION                    0x00000000
#define _IFS8_SPI3IF_MASK                        0x00000001
#define _IFS8_SPI3IF_LENGTH                      0x00000001

#define _IFS8_SI2C3IF_POSITION                   0x0000000E
#define _IFS8_SI2C3IF_MASK                       0x00004000
#define _IFS8_SI2C3IF_LENGTH                     0x00000001

#define _IFS8_MI2C3IF_POSITION                   0x0000000F
#define _IFS8_MI2C3IF_MASK                       0x00008000
#define _IFS8_MI2C3IF_LENGTH                     0x00000001

#define _IFS9_I2C3BCIF_POSITION                  0x00000000
#define _IFS9_I2C3BCIF_MASK                      0x00000001
#define _IFS9_I2C3BCIF_LENGTH                    0x00000001

#define _IFS9_CCP7IF_POSITION                    0x00000005
#define _IFS9_CCP7IF_MASK                        0x00000020
#define _IFS9_CCP7IF_LENGTH                      0x00000001

#define _IFS9_CCT7IF_POSITION                    0x00000006
#define _IFS9_CCT7IF_MASK                        0x00000040
#define _IFS9_CCT7IF_LENGTH                      0x00000001

#define _IFS9_CCP8IF_POSITION                    0x00000008
#define _IFS9_CCP8IF_MASK                        0x00000100
#define _IFS9_CCP8IF_LENGTH                      0x00000001

#define _IFS9_CCT8IF_POSITION                    0x00000009
#define _IFS9_CCT8IF_MASK                        0x00000200
#define _IFS9_CCT8IF_LENGTH                      0x00000001

#define _IFS10_ADC0EIF_POSITION                  0x00000000
#define _IFS10_ADC0EIF_MASK                      0x00000001
#define _IFS10_ADC0EIF_LENGTH                    0x00000001

#define _IFS10_ADC1EIF_POSITION                  0x00000001
#define _IFS10_ADC1EIF_MASK                      0x00000002
#define _IFS10_ADC1EIF_LENGTH                    0x00000001

#define _IFS10_ADFIFOIF_POSITION                 0x00000008
#define _IFS10_ADFIFOIF_MASK                     0x00000100
#define _IFS10_ADFIFOIF_LENGTH                   0x00000001

#define _IFS10_PEVTAIF_POSITION                  0x00000009
#define _IFS10_PEVTAIF_MASK                      0x00000200
#define _IFS10_PEVTAIF_LENGTH                    0x00000001

#define _IFS10_PEVTBIF_POSITION                  0x0000000A
#define _IFS10_PEVTBIF_MASK                      0x00000400
#define _IFS10_PEVTBIF_LENGTH                    0x00000001

#define _IFS10_PEVTCIF_POSITION                  0x0000000B
#define _IFS10_PEVTCIF_MASK                      0x00000800
#define _IFS10_PEVTCIF_LENGTH                    0x00000001

#define _IFS10_PEVTDIF_POSITION                  0x0000000C
#define _IFS10_PEVTDIF_MASK                      0x00001000
#define _IFS10_PEVTDIF_LENGTH                    0x00000001

#define _IFS10_PEVTEIF_POSITION                  0x0000000D
#define _IFS10_PEVTEIF_MASK                      0x00002000
#define _IFS10_PEVTEIF_LENGTH                    0x00000001

#define _IFS10_PEVTFIF_POSITION                  0x0000000E
#define _IFS10_PEVTFIF_MASK                      0x00004000
#define _IFS10_PEVTFIF_LENGTH                    0x00000001

#define _IFS10_CLC3PIF_POSITION                  0x0000000F
#define _IFS10_CLC3PIF_MASK                      0x00008000
#define _IFS10_CLC3PIF_LENGTH                    0x00000001

#define _IFS11_CLC4PIF_POSITION                  0x00000000
#define _IFS11_CLC4PIF_MASK                      0x00000001
#define _IFS11_CLC4PIF_LENGTH                    0x00000001

#define _IFS11_CLC1NIF_POSITION                  0x00000001
#define _IFS11_CLC1NIF_MASK                      0x00000002
#define _IFS11_CLC1NIF_LENGTH                    0x00000001

#define _IFS11_CLC2NIF_POSITION                  0x00000002
#define _IFS11_CLC2NIF_MASK                      0x00000004
#define _IFS11_CLC2NIF_LENGTH                    0x00000001

