wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _IFS11_CLC3NIF_POSITION                  0x00000003
#define _IFS11_CLC3NIF_MASK                      0x00000008
#define _IFS11_CLC3NIF_LENGTH                    0x00000001

#define _IFS11_CLC4NIF_POSITION                  0x00000004
#define _IFS11_CLC4NIF_MASK                      0x00000010
#define _IFS11_CLC4NIF_LENGTH                    0x00000001

#define _IFS11_CCP9IF_POSITION                   0x00000005
#define _IFS11_CCP9IF_MASK                       0x00000020
#define _IFS11_CCP9IF_LENGTH                     0x00000001

#define _IFS11_CCT9IF_POSITION                   0x00000006
#define _IFS11_CCT9IF_MASK                       0x00000040
#define _IFS11_CCT9IF_LENGTH                     0x00000001

#define _IFS11_U1EVTIF_POSITION                  0x0000000D
#define _IFS11_U1EVTIF_MASK                      0x00002000
#define _IFS11_U1EVTIF_LENGTH                    0x00000001

#define _IFS11_U2EVTIF_POSITION                  0x0000000E
#define _IFS11_U2EVTIF_MASK                      0x00004000
#define _IFS11_U2EVTIF_LENGTH                    0x00000001

#define _IFS11_U3EVTIF_POSITION                  0x0000000F
#define _IFS11_U3EVTIF_MASK                      0x00008000
#define _IFS11_U3EVTIF_LENGTH                    0x00000001

#define _IFS12_ADCAN24IF_POSITION                0x00000000
#define _IFS12_ADCAN24IF_MASK                    0x00000001
#define _IFS12_ADCAN24IF_LENGTH                  0x00000001

#define _IFS12_ADCAN25IF_POSITION                0x00000001
#define _IFS12_ADCAN25IF_MASK                    0x00000002
#define _IFS12_ADCAN25IF_LENGTH                  0x00000001

#define _IFS12_PMPIF_POSITION                    0x00000002
#define _IFS12_PMPIF_MASK                        0x00000004
#define _IFS12_PMPIF_LENGTH                      0x00000001

#define _IFS12_PMPEIF_POSITION                   0x00000003
#define _IFS12_PMPEIF_MASK                       0x00000008
#define _IFS12_PMPEIF_LENGTH                     0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000001
#define _IEC0_T1IE_MASK                          0x00000002
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_CNAIE_POSITION                     0x00000002
#define _IEC0_CNAIE_MASK                         0x00000004
#define _IEC0_CNAIE_LENGTH                       0x00000001

#define _IEC0_CNBIE_POSITION                     0x00000003
#define _IEC0_CNBIE_MASK                         0x00000008
#define _IEC0_CNBIE_LENGTH                       0x00000001

#define _IEC0_DMA0IE_POSITION                    0x00000004
#define _IEC0_DMA0IE_MASK                        0x00000010
#define _IEC0_DMA0IE_LENGTH                      0x00000001

#define _IEC0_CCP1IE_POSITION                    0x00000006
#define _IEC0_CCP1IE_MASK                        0x00000040
#define _IEC0_CCP1IE_LENGTH                      0x00000001

#define _IEC0_CCT1IE_POSITION                    0x00000007
#define _IEC0_CCT1IE_MASK                        0x00000080
#define _IEC0_CCT1IE_LENGTH                      0x00000001

#define _IEC0_DMA1IE_POSITION                    0x00000008
#define _IEC0_DMA1IE_MASK                        0x00000100
#define _IEC0_DMA1IE_LENGTH                      0x00000001

#define _IEC0_SPI1RXIE_POSITION                  0x00000009
#define _IEC0_SPI1RXIE_MASK                      0x00000200
#define _IEC0_SPI1RXIE_LENGTH                    0x00000001

#define _IEC0_SPI1TXIE_POSITION                  0x0000000A
#define _IEC0_SPI1TXIE_MASK                      0x00000400
#define _IEC0_SPI1TXIE_LENGTH                    0x00000001

#define _IEC0_U1RXIE_POSITION                    0x0000000B
#define _IEC0_U1RXIE_MASK                        0x00000800
#define _IEC0_U1RXIE_LENGTH                      0x00000001

#define _IEC0_U1TXIE_POSITION                    0x0000000C
#define _IEC0_U1TXIE_MASK                        0x00001000
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_ECCSBEIE_POSITION                  0x0000000D
#define _IEC0_ECCSBEIE_MASK                      0x00002000
#define _IEC0_ECCSBEIE_LENGTH                    0x00000001

#define _IEC0_NVMIE_POSITION                     0x0000000E
#define _IEC0_NVMIE_MASK                         0x00004000
#define _IEC0_NVMIE_LENGTH                       0x00000001

#define _IEC0_INT1IE_POSITION                    0x0000000F
#define _IEC0_INT1IE_MASK                        0x00008000
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC1_SI2C1IE_POSITION                   0x00000000
#define _IEC1_SI2C1IE_MASK                       0x00000001
#define _IEC1_SI2C1IE_LENGTH                     0x00000001

#define _IEC1_MI2C1IE_POSITION                   0x00000001
#define _IEC1_MI2C1IE_MASK                       0x00000002
#define _IEC1_MI2C1IE_LENGTH                     0x00000001

#define _IEC1_DMA2IE_POSITION                    0x00000002
#define _IEC1_DMA2IE_MASK                        0x00000004
#define _IEC1_DMA2IE_LENGTH                      0x00000001

#define _IEC1_CNCIE_POSITION                     0x00000003
#define _IEC1_CNCIE_MASK                         0x00000008
#define _IEC1_CNCIE_LENGTH                       0x00000001

#define _IEC1_INT2IE_POSITION                    0x00000004
#define _IEC1_INT2IE_MASK                        0x00000010
#define _IEC1_INT2IE_LENGTH                      0x00000001

#define _IEC1_DMA3IE_POSITION                    0x00000005
#define _IEC1_DMA3IE_MASK                        0x00000020
#define _IEC1_DMA3IE_LENGTH                      0x00000001

#define _IEC1_CCP2IE_POSITION                    0x00000007
#define _IEC1_CCP2IE_MASK                        0x00000080
#define _IEC1_CCP2IE_LENGTH                      0x00000001

#define _IEC1_CCT2IE_POSITION                    0x00000008
#define _IEC1_CCT2IE_MASK                        0x00000100
#define _IEC1_CCT2IE_LENGTH                      0x00000001

