wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _IEC11_U3EVTIE_POSITION                  0x0000000F
#define _IEC11_U3EVTIE_MASK                      0x00008000
#define _IEC11_U3EVTIE_LENGTH                    0x00000001

#define _IEC12_ADCAN24IE_POSITION                0x00000000
#define _IEC12_ADCAN24IE_MASK                    0x00000001
#define _IEC12_ADCAN24IE_LENGTH                  0x00000001

#define _IEC12_ADCAN25IE_POSITION                0x00000001
#define _IEC12_ADCAN25IE_MASK                    0x00000002
#define _IEC12_ADCAN25IE_LENGTH                  0x00000001

#define _IEC12_PMPIE_POSITION                    0x00000002
#define _IEC12_PMPIE_MASK                        0x00000004
#define _IEC12_PMPIE_LENGTH                      0x00000001

#define _IEC12_PMPEIE_POSITION                   0x00000003
#define _IEC12_PMPEIE_MASK                       0x00000008
#define _IEC12_PMPEIE_LENGTH                     0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_T1IP_POSITION                      0x00000004
#define _IPC0_T1IP_MASK                          0x00000070
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_CNAIP_POSITION                     0x00000008
#define _IPC0_CNAIP_MASK                         0x00000700
#define _IPC0_CNAIP_LENGTH                       0x00000003

#define _IPC0_CNBIP_POSITION                     0x0000000C
#define _IPC0_CNBIP_MASK                         0x00007000
#define _IPC0_CNBIP_LENGTH                       0x00000003

#define _IPC1_DMA0IP_POSITION                    0x00000000
#define _IPC1_DMA0IP_MASK                        0x00000007
#define _IPC1_DMA0IP_LENGTH                      0x00000003

#define _IPC1_CCP1IP_POSITION                    0x00000008
#define _IPC1_CCP1IP_MASK                        0x00000700
#define _IPC1_CCP1IP_LENGTH                      0x00000003

#define _IPC1_CCT1IP_POSITION                    0x0000000C
#define _IPC1_CCT1IP_MASK                        0x00007000
#define _IPC1_CCT1IP_LENGTH                      0x00000003

#define _IPC2_DMA1IP_POSITION                    0x00000000
#define _IPC2_DMA1IP_MASK                        0x00000007
#define _IPC2_DMA1IP_LENGTH                      0x00000003

#define _IPC2_SPI1RXIP_POSITION                  0x00000004
#define _IPC2_SPI1RXIP_MASK                      0x00000070
#define _IPC2_SPI1RXIP_LENGTH                    0x00000003

#define _IPC2_SPI1TXIP_POSITION                  0x00000008
#define _IPC2_SPI1TXIP_MASK                      0x00000700
#define _IPC2_SPI1TXIP_LENGTH                    0x00000003

#define _IPC2_U1RXIP_POSITION                    0x0000000C
#define _IPC2_U1RXIP_MASK                        0x00007000
#define _IPC2_U1RXIP_LENGTH                      0x00000003

#define _IPC3_U1TXIP_POSITION                    0x00000000
#define _IPC3_U1TXIP_MASK                        0x00000007
#define _IPC3_U1TXIP_LENGTH                      0x00000003

#define _IPC3_ECCSBEIP_POSITION                  0x00000004
#define _IPC3_ECCSBEIP_MASK                      0x00000070
#define _IPC3_ECCSBEIP_LENGTH                    0x00000003

#define _IPC3_NVMIP_POSITION                     0x00000008
#define _IPC3_NVMIP_MASK                         0x00000700
#define _IPC3_NVMIP_LENGTH                       0x00000003

#define _IPC3_INT1IP_POSITION                    0x0000000C
#define _IPC3_INT1IP_MASK                        0x00007000
#define _IPC3_INT1IP_LENGTH                      0x00000003

#define _IPC4_SI2C1IP_POSITION                   0x00000000
#define _IPC4_SI2C1IP_MASK                       0x00000007
#define _IPC4_SI2C1IP_LENGTH                     0x00000003

#define _IPC4_MI2C1IP_POSITION                   0x00000004
#define _IPC4_MI2C1IP_MASK                       0x00000070
#define _IPC4_MI2C1IP_LENGTH                     0x00000003

#define _IPC4_DMA2IP_POSITION                    0x00000008
#define _IPC4_DMA2IP_MASK                        0x00000700
#define _IPC4_DMA2IP_LENGTH                      0x00000003

#define _IPC4_CNCIP_POSITION                     0x0000000C
#define _IPC4_CNCIP_MASK                         0x00007000
#define _IPC4_CNCIP_LENGTH                       0x00000003

#define _IPC5_INT2IP_POSITION                    0x00000000
#define _IPC5_INT2IP_MASK                        0x00000007
#define _IPC5_INT2IP_LENGTH                      0x00000003

#define _IPC5_DMA3IP_POSITION                    0x00000004
#define _IPC5_DMA3IP_MASK                        0x00000070
#define _IPC5_DMA3IP_LENGTH                      0x00000003

#define _IPC5_CCP2IP_POSITION                    0x0000000C
#define _IPC5_CCP2IP_MASK                        0x00007000
#define _IPC5_CCP2IP_LENGTH                      0x00000003

#define _IPC6_CCT2IP_POSITION                    0x00000000
#define _IPC6_CCT2IP_MASK                        0x00000007
#define _IPC6_CCT2IP_LENGTH                      0x00000003

#define _IPC6_C1IP_POSITION                      0x00000004
#define _IPC6_C1IP_MASK                          0x00000070
#define _IPC6_C1IP_LENGTH                        0x00000003

#define _IPC6_INT3IP_POSITION                    0x00000008
#define _IPC6_INT3IP_MASK                        0x00000700
#define _IPC6_INT3IP_LENGTH                      0x00000003

#define _IPC6_U2RXIP_POSITION                    0x0000000C
#define _IPC6_U2RXIP_MASK                        0x00007000
#define _IPC6_U2RXIP_LENGTH                      0x00000003

#define _IPC7_U2TXIP_POSITION                    0x00000000
#define _IPC7_U2TXIP_MASK                        0x00000007
#define _IPC7_U2TXIP_LENGTH                      0x00000003

#define _IPC7_SPI2RXIP_POSITION                  0x00000004
#define _IPC7_SPI2RXIP_MASK                      0x00000070
#define _IPC7_SPI2RXIP_LENGTH                    0x00000003

#define _IPC7_SPI2TXIP_POSITION                  0x00000008
#define _IPC7_SPI2TXIP_MASK                      0x00000700
#define _IPC7_SPI2TXIP_LENGTH                    0x00000003

#define _IPC7_C1RXIP_POSITION                    0x0000000C
#define _IPC7_C1RXIP_MASK                        0x00007000
#define _IPC7_C1RXIP_LENGTH                      0x00000003

#define _IPC8_CCP3IP_POSITION                    0x0000000C
#define _IPC8_CCP3IP_MASK                        0x00007000
#define _IPC8_CCP3IP_LENGTH                      0x00000003

