wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _IPC9_CCT3IP_POSITION                    0x00000000
#define _IPC9_CCT3IP_MASK                        0x00000007
#define _IPC9_CCT3IP_LENGTH                      0x00000003

#define _IPC9_SI2C2IP_POSITION                   0x00000004
#define _IPC9_SI2C2IP_MASK                       0x00000070
#define _IPC9_SI2C2IP_LENGTH                     0x00000003

#define _IPC9_MI2C2IP_POSITION                   0x00000008
#define _IPC9_MI2C2IP_MASK                       0x00000700
#define _IPC9_MI2C2IP_LENGTH                     0x00000003

#define _IPC10_CCP4IP_POSITION                   0x00000000
#define _IPC10_CCP4IP_MASK                       0x00000007
#define _IPC10_CCP4IP_LENGTH                     0x00000003

#define _IPC10_CCT4IP_POSITION                   0x00000004
#define _IPC10_CCT4IP_MASK                       0x00000070
#define _IPC10_CCT4IP_LENGTH                     0x00000003

#define _IPC10_CCP5IP_POSITION                   0x0000000C
#define _IPC10_CCP5IP_MASK                       0x00007000
#define _IPC10_CCP5IP_LENGTH                     0x00000003

#define _IPC11_CCT5IP_POSITION                   0x00000000
#define _IPC11_CCT5IP_MASK                       0x00000007
#define _IPC11_CCT5IP_LENGTH                     0x00000003

#define _IPC11_DMTIP_POSITION                    0x00000004
#define _IPC11_DMTIP_MASK                        0x00000070
#define _IPC11_DMTIP_LENGTH                      0x00000003

#define _IPC11_CCP6IP_POSITION                   0x00000008
#define _IPC11_CCP6IP_MASK                       0x00000700
#define _IPC11_CCP6IP_LENGTH                     0x00000003

#define _IPC11_CCT6IP_POSITION                   0x0000000C
#define _IPC11_CCT6IP_MASK                       0x00007000
#define _IPC11_CCT6IP_LENGTH                     0x00000003

#define _IPC12_QEI1IP_POSITION                   0x00000000
#define _IPC12_QEI1IP_MASK                       0x00000007
#define _IPC12_QEI1IP_LENGTH                     0x00000003

#define _IPC12_U1EIP_POSITION                    0x00000004
#define _IPC12_U1EIP_MASK                        0x00000070
#define _IPC12_U1EIP_LENGTH                      0x00000003

#define _IPC12_U2EIP_POSITION                    0x00000008
#define _IPC12_U2EIP_MASK                        0x00000700
#define _IPC12_U2EIP_LENGTH                      0x00000003

#define _IPC12_CRCIP_POSITION                    0x0000000C
#define _IPC12_CRCIP_MASK                        0x00007000
#define _IPC12_CRCIP_LENGTH                      0x00000003

#define _IPC13_C1TXIP_POSITION                   0x00000000
#define _IPC13_C1TXIP_MASK                       0x00000007
#define _IPC13_C1TXIP_LENGTH                     0x00000003

#define _IPC13_QEI2IP_POSITION                   0x00000008
#define _IPC13_QEI2IP_MASK                       0x00000700
#define _IPC13_QEI2IP_LENGTH                     0x00000003

#define _IPC14_U3EIP_POSITION                    0x00000000
#define _IPC14_U3EIP_MASK                        0x00000007
#define _IPC14_U3EIP_LENGTH                      0x00000003

#define _IPC14_U3RXIP_POSITION                   0x00000004
#define _IPC14_U3RXIP_MASK                       0x00000070
#define _IPC14_U3RXIP_LENGTH                     0x00000003

#define _IPC14_U3TXIP_POSITION                   0x00000008
#define _IPC14_U3TXIP_MASK                       0x00000700
#define _IPC14_U3TXIP_LENGTH                     0x00000003

#define _IPC14_SPI3RXIP_POSITION                 0x0000000C
#define _IPC14_SPI3RXIP_MASK                     0x00007000
#define _IPC14_SPI3RXIP_LENGTH                   0x00000003

#define _IPC15_SPI3TXIP_POSITION                 0x00000000
#define _IPC15_SPI3TXIP_MASK                     0x00000007
#define _IPC15_SPI3TXIP_LENGTH                   0x00000003

#define _IPC15_ICDIP_POSITION                    0x00000004
#define _IPC15_ICDIP_MASK                        0x00000070
#define _IPC15_ICDIP_LENGTH                      0x00000003

#define _IPC15_JTAGIP_POSITION                   0x00000008
#define _IPC15_JTAGIP_MASK                       0x00000700
#define _IPC15_JTAGIP_LENGTH                     0x00000003

#define _IPC15_PTGSTEPIP_POSITION                0x0000000C
#define _IPC15_PTGSTEPIP_MASK                    0x00007000
#define _IPC15_PTGSTEPIP_LENGTH                  0x00000003

#define _IPC16_I2C1BCIP_POSITION                 0x00000000
#define _IPC16_I2C1BCIP_MASK                     0x00000007
#define _IPC16_I2C1BCIP_LENGTH                   0x00000003

#define _IPC16_I2C2BCIP_POSITION                 0x00000004
#define _IPC16_I2C2BCIP_MASK                     0x00000070
#define _IPC16_I2C2BCIP_LENGTH                   0x00000003

#define _IPC16_PWM1IP_POSITION                   0x0000000C
#define _IPC16_PWM1IP_MASK                       0x00007000
#define _IPC16_PWM1IP_LENGTH                     0x00000003

#define _IPC17_PWM2IP_POSITION                   0x00000000
#define _IPC17_PWM2IP_MASK                       0x00000007
#define _IPC17_PWM2IP_LENGTH                     0x00000003

#define _IPC17_PWM3IP_POSITION                   0x00000004
#define _IPC17_PWM3IP_MASK                       0x00000070
#define _IPC17_PWM3IP_LENGTH                     0x00000003

#define _IPC17_PWM4IP_POSITION                   0x00000008
#define _IPC17_PWM4IP_MASK                       0x00000700
#define _IPC17_PWM4IP_LENGTH                     0x00000003

#define _IPC17_PWM5IP_POSITION                   0x0000000C
#define _IPC17_PWM5IP_MASK                       0x00007000
#define _IPC17_PWM5IP_LENGTH                     0x00000003

#define _IPC18_PWM6IP_POSITION                   0x00000000
#define _IPC18_PWM6IP_MASK                       0x00000007
#define _IPC18_PWM6IP_LENGTH                     0x00000003

#define _IPC18_PWM7IP_POSITION                   0x00000004
#define _IPC18_PWM7IP_MASK                       0x00000070
#define _IPC18_PWM7IP_LENGTH                     0x00000003

#define _IPC18_PWM8IP_POSITION                   0x00000008
#define _IPC18_PWM8IP_MASK                       0x00000700
#define _IPC18_PWM8IP_LENGTH                     0x00000003

#define _IPC18_CNDIP_POSITION                    0x0000000C
#define _IPC18_CNDIP_MASK                        0x00007000
#define _IPC18_CNDIP_LENGTH                      0x00000003

#define _IPC19_CMP1IP_POSITION                   0x00000004
#define _IPC19_CMP1IP_MASK                       0x00000070
#define _IPC19_CMP1IP_LENGTH                     0x00000003

