wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _IPC30_ADFLTR0IP_POSITION                0x00000000
#define _IPC30_ADFLTR0IP_MASK                    0x00000007
#define _IPC30_ADFLTR0IP_LENGTH                  0x00000003

#define _IPC30_ADFLTR1IP_POSITION                0x00000004
#define _IPC30_ADFLTR1IP_MASK                    0x00000070
#define _IPC30_ADFLTR1IP_LENGTH                  0x00000003

#define _IPC30_ADFLTR2IP_POSITION                0x00000008
#define _IPC30_ADFLTR2IP_MASK                    0x00000700
#define _IPC30_ADFLTR2IP_LENGTH                  0x00000003

#define _IPC30_ADFLTR3IP_POSITION                0x0000000C
#define _IPC30_ADFLTR3IP_MASK                    0x00007000
#define _IPC30_ADFLTR3IP_LENGTH                  0x00000003

#define _IPC31_CLC1PEIP_POSITION                 0x00000000
#define _IPC31_CLC1PEIP_MASK                     0x00000007
#define _IPC31_CLC1PEIP_LENGTH                   0x00000003

#define _IPC31_CLC2PEIP_POSITION                 0x00000004
#define _IPC31_CLC2PEIP_MASK                     0x00000070
#define _IPC31_CLC2PEIP_LENGTH                   0x00000003

#define _IPC31_SPI1IP_POSITION                   0x00000008
#define _IPC31_SPI1IP_MASK                       0x00000700
#define _IPC31_SPI1IP_LENGTH                     0x00000003

#define _IPC31_SPI2IP_POSITION                   0x0000000C
#define _IPC31_SPI2IP_MASK                       0x00007000
#define _IPC31_SPI2IP_LENGTH                     0x00000003

#define _IPC32_SPI3IP_POSITION                   0x00000000
#define _IPC32_SPI3IP_MASK                       0x00000007
#define _IPC32_SPI3IP_LENGTH                     0x00000003

#define _IPC35_SI2C3IP_POSITION                  0x00000008
#define _IPC35_SI2C3IP_MASK                      0x00000700
#define _IPC35_SI2C3IP_LENGTH                    0x00000003

#define _IPC35_MI2C3IP_POSITION                  0x0000000C
#define _IPC35_MI2C3IP_MASK                      0x00007000
#define _IPC35_MI2C3IP_LENGTH                    0x00000003

#define _IPC36_I2C3BCIP_POSITION                 0x00000000
#define _IPC36_I2C3BCIP_MASK                     0x00000007
#define _IPC36_I2C3BCIP_LENGTH                   0x00000003

#define _IPC37_CCP7IP_POSITION                   0x00000004
#define _IPC37_CCP7IP_MASK                       0x00000070
#define _IPC37_CCP7IP_LENGTH                     0x00000003

#define _IPC37_CCT7IP_POSITION                   0x00000008
#define _IPC37_CCT7IP_MASK                       0x00000700
#define _IPC37_CCT7IP_LENGTH                     0x00000003

#define _IPC38_CCP8IP_POSITION                   0x00000000
#define _IPC38_CCP8IP_MASK                       0x00000007
#define _IPC38_CCP8IP_LENGTH                     0x00000003

#define _IPC38_CCT8IP_POSITION                   0x00000004
#define _IPC38_CCT8IP_MASK                       0x00000070
#define _IPC38_CCT8IP_LENGTH                     0x00000003

#define _IPC40_ADC0EIP_POSITION                  0x00000000
#define _IPC40_ADC0EIP_MASK                      0x00000007
#define _IPC40_ADC0EIP_LENGTH                    0x00000003

#define _IPC40_ADC1EIP_POSITION                  0x00000004
#define _IPC40_ADC1EIP_MASK                      0x00000070
#define _IPC40_ADC1EIP_LENGTH                    0x00000003

#define _IPC42_ADFIFOIP_POSITION                 0x00000000
#define _IPC42_ADFIFOIP_MASK                     0x00000007
#define _IPC42_ADFIFOIP_LENGTH                   0x00000003

#define _IPC42_PEVTAIP_POSITION                  0x00000004
#define _IPC42_PEVTAIP_MASK                      0x00000070
#define _IPC42_PEVTAIP_LENGTH                    0x00000003

#define _IPC42_PEVTBIP_POSITION                  0x00000008
#define _IPC42_PEVTBIP_MASK                      0x00000700
#define _IPC42_PEVTBIP_LENGTH                    0x00000003

#define _IPC42_PEVTCIP_POSITION                  0x0000000C
#define _IPC42_PEVTCIP_MASK                      0x00007000
#define _IPC42_PEVTCIP_LENGTH                    0x00000003

#define _IPC43_PEVTDIP_POSITION                  0x00000000
#define _IPC43_PEVTDIP_MASK                      0x00000007
#define _IPC43_PEVTDIP_LENGTH                    0x00000003

#define _IPC43_PEVTEIP_POSITION                  0x00000004
#define _IPC43_PEVTEIP_MASK                      0x00000070
#define _IPC43_PEVTEIP_LENGTH                    0x00000003

#define _IPC43_PEVTFIP_POSITION                  0x00000008
#define _IPC43_PEVTFIP_MASK                      0x00000700
#define _IPC43_PEVTFIP_LENGTH                    0x00000003

#define _IPC43_CLC3PEIP_POSITION                 0x0000000C
#define _IPC43_CLC3PEIP_MASK                     0x00007000
#define _IPC43_CLC3PEIP_LENGTH                   0x00000003

#define _IPC44_CLC4PEIP_POSITION                 0x00000000
#define _IPC44_CLC4PEIP_MASK                     0x00000007
#define _IPC44_CLC4PEIP_LENGTH                   0x00000003

#define _IPC44_CLC1NEIP_POSITION                 0x00000004
#define _IPC44_CLC1NEIP_MASK                     0x00000070
#define _IPC44_CLC1NEIP_LENGTH                   0x00000003

#define _IPC44_CLC2NEIP_POSITION                 0x00000008
#define _IPC44_CLC2NEIP_MASK                     0x00000700
#define _IPC44_CLC2NEIP_LENGTH                   0x00000003

#define _IPC44_CLC3NEIP_POSITION                 0x0000000C
#define _IPC44_CLC3NEIP_MASK                     0x00007000
#define _IPC44_CLC3NEIP_LENGTH                   0x00000003

#define _IPC45_CLC4NEIP_POSITION                 0x00000000
#define _IPC45_CLC4NEIP_MASK                     0x00000007
#define _IPC45_CLC4NEIP_LENGTH                   0x00000003

#define _IPC45_CCP9IP_POSITION                   0x00000004
#define _IPC45_CCP9IP_MASK                       0x00000070
#define _IPC45_CCP9IP_LENGTH                     0x00000003

#define _IPC45_CCT9IP_POSITION                   0x00000008
#define _IPC45_CCT9IP_MASK                       0x00000700
#define _IPC45_CCT9IP_LENGTH                     0x00000003

#define _IPC47_U1EVTIP_POSITION                  0x00000004
#define _IPC47_U1EVTIP_MASK                      0x00000070
#define _IPC47_U1EVTIP_LENGTH                    0x00000003

#define _IPC47_U2EVTIP_POSITION                  0x00000008
#define _IPC47_U2EVTIP_MASK                      0x00000700
#define _IPC47_U2EVTIP_LENGTH                    0x00000003

#define _IPC47_U3EVTIP_POSITION                  0x0000000C
#define _IPC47_U3EVTIP_MASK                      0x00007000
#define _IPC47_U3EVTIP_LENGTH                    0x00000003

#define _IPC48_ADCAN24IP_POSITION                0x00000000
#define _IPC48_ADCAN24IP_MASK                    0x00000007
#define _IPC48_ADCAN24IP_LENGTH                  0x00000003

