wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _NVMSRCADRL_NVMSRCADRL_POSITION          0x00000001
#define _NVMSRCADRL_NVMSRCADRL_MASK              0x0000FFFE
#define _NVMSRCADRL_NVMSRCADRL_LENGTH            0x0000000F

#define _NVMSRCADRH_NVMSRCADRH_POSITION          0x00000000
#define _NVMSRCADRH_NVMSRCADRH_MASK              0x000000FF
#define _NVMSRCADRH_NVMSRCADRH_LENGTH            0x00000008

#define _AMPCON1L_AMPEN1_POSITION                0x00000000
#define _AMPCON1L_AMPEN1_MASK                    0x00000001
#define _AMPCON1L_AMPEN1_LENGTH                  0x00000001

#define _AMPCON1L_AMPEN2_POSITION                0x00000001
#define _AMPCON1L_AMPEN2_MASK                    0x00000002
#define _AMPCON1L_AMPEN2_LENGTH                  0x00000001

#define _AMPCON1L_AMPEN3_POSITION                0x00000002
#define _AMPCON1L_AMPEN3_MASK                    0x00000004
#define _AMPCON1L_AMPEN3_LENGTH                  0x00000001

#define _AMPCON1L_AMPON_POSITION                 0x0000000F
#define _AMPCON1L_AMPON_MASK                     0x00008000
#define _AMPCON1L_AMPON_LENGTH                   0x00000001

#define _AMPCON1H_NCHDIS1_POSITION               0x00000000
#define _AMPCON1H_NCHDIS1_MASK                   0x00000001
#define _AMPCON1H_NCHDIS1_LENGTH                 0x00000001

#define _AMPCON1H_NCHDIS2_POSITION               0x00000001
#define _AMPCON1H_NCHDIS2_MASK                   0x00000002
#define _AMPCON1H_NCHDIS2_LENGTH                 0x00000001

#define _AMPCON1H_NCHDIS3_POSITION               0x00000002
#define _AMPCON1H_NCHDIS3_MASK                   0x00000004
#define _AMPCON1H_NCHDIS3_LENGTH                 0x00000001

#define _BIASCON_I10EN0_POSITION                 0x00000000
#define _BIASCON_I10EN0_MASK                     0x00000001
#define _BIASCON_I10EN0_LENGTH                   0x00000001

#define _BIASCON_I10EN1_POSITION                 0x00000001
#define _BIASCON_I10EN1_MASK                     0x00000002
#define _BIASCON_I10EN1_LENGTH                   0x00000001

#define _BIASCON_I10EN2_POSITION                 0x00000002
#define _BIASCON_I10EN2_MASK                     0x00000004
#define _BIASCON_I10EN2_LENGTH                   0x00000001

#define _BIASCON_I10EN3_POSITION                 0x00000003
#define _BIASCON_I10EN3_MASK                     0x00000008
#define _BIASCON_I10EN3_LENGTH                   0x00000001

#define _BIASCON_ON_POSITION                     0x0000000F
#define _BIASCON_ON_MASK                         0x00008000
#define _BIASCON_ON_LENGTH                       0x00000001

#define _IBIASCONL_SNKEN0_POSITION               0x00000000
#define _IBIASCONL_SNKEN0_MASK                   0x00000001
#define _IBIASCONL_SNKEN0_LENGTH                 0x00000001

#define _IBIASCONL_SRCEN0_POSITION               0x00000001
#define _IBIASCONL_SRCEN0_MASK                   0x00000002
#define _IBIASCONL_SRCEN0_LENGTH                 0x00000001

#define _IBIASCONL_GENSNKEN0_POSITION            0x00000002
#define _IBIASCONL_GENSNKEN0_MASK                0x00000004
#define _IBIASCONL_GENSNKEN0_LENGTH              0x00000001

#define _IBIASCONL_GENSRCEN0_POSITION            0x00000003
#define _IBIASCONL_GENSRCEN0_MASK                0x00000008
#define _IBIASCONL_GENSRCEN0_LENGTH              0x00000001

#define _IBIASCONL_SHRSNKEN0_POSITION            0x00000004
#define _IBIASCONL_SHRSNKEN0_MASK                0x00000010
#define _IBIASCONL_SHRSNKEN0_LENGTH              0x00000001

#define _IBIASCONL_SHRSRCEN0_POSITION            0x00000005
#define _IBIASCONL_SHRSRCEN0_MASK                0x00000020
#define _IBIASCONL_SHRSRCEN0_LENGTH              0x00000001

#define _IBIASCONL_SNKEN1_POSITION               0x00000008
#define _IBIASCONL_SNKEN1_MASK                   0x00000100
#define _IBIASCONL_SNKEN1_LENGTH                 0x00000001

#define _IBIASCONL_SRCEN1_POSITION               0x00000009
#define _IBIASCONL_SRCEN1_MASK                   0x00000200
#define _IBIASCONL_SRCEN1_LENGTH                 0x00000001

#define _IBIASCONL_GENSNKEN1_POSITION            0x0000000A
#define _IBIASCONL_GENSNKEN1_MASK                0x00000400
#define _IBIASCONL_GENSNKEN1_LENGTH              0x00000001

#define _IBIASCONL_GENSRCEN1_POSITION            0x0000000B
#define _IBIASCONL_GENSRCEN1_MASK                0x00000800
#define _IBIASCONL_GENSRCEN1_LENGTH              0x00000001

#define _IBIASCONL_SHRSNKEN1_POSITION            0x0000000C
#define _IBIASCONL_SHRSNKEN1_MASK                0x00001000
#define _IBIASCONL_SHRSNKEN1_LENGTH              0x00000001

#define _IBIASCONL_SHRSRCEN1_POSITION            0x0000000D
#define _IBIASCONL_SHRSRCEN1_MASK                0x00002000
#define _IBIASCONL_SHRSRCEN1_LENGTH              0x00000001

#define _IBIASCONH_SNKEN2_POSITION               0x00000000
#define _IBIASCONH_SNKEN2_MASK                   0x00000001
#define _IBIASCONH_SNKEN2_LENGTH                 0x00000001

#define _IBIASCONH_SRCEN2_POSITION               0x00000001
#define _IBIASCONH_SRCEN2_MASK                   0x00000002
#define _IBIASCONH_SRCEN2_LENGTH                 0x00000001

#define _IBIASCONH_GENSNKEN2_POSITION            0x00000002
#define _IBIASCONH_GENSNKEN2_MASK                0x00000004
#define _IBIASCONH_GENSNKEN2_LENGTH              0x00000001

#define _IBIASCONH_GENSRCEN2_POSITION            0x00000003
#define _IBIASCONH_GENSRCEN2_MASK                0x00000008
#define _IBIASCONH_GENSRCEN2_LENGTH              0x00000001

#define _IBIASCONH_SHRSNKEN2_POSITION            0x00000004
#define _IBIASCONH_SHRSNKEN2_MASK                0x00000010
#define _IBIASCONH_SHRSNKEN2_LENGTH              0x00000001

#define _IBIASCONH_SHRSRCEN2_POSITION            0x00000005
#define _IBIASCONH_SHRSRCEN2_MASK                0x00000020
#define _IBIASCONH_SHRSRCEN2_LENGTH              0x00000001

#define _IBIASCONH_SNKEN3_POSITION               0x00000008
#define _IBIASCONH_SNKEN3_MASK                   0x00000100
#define _IBIASCONH_SNKEN3_LENGTH                 0x00000001

#define _IBIASCONH_SRCEN3_POSITION               0x00000009
#define _IBIASCONH_SRCEN3_MASK                   0x00000200
#define _IBIASCONH_SRCEN3_LENGTH                 0x00000001

#define _IBIASCONH_GENSNKEN3_POSITION            0x0000000A
#define _IBIASCONH_GENSNKEN3_MASK                0x00000400
#define _IBIASCONH_GENSNKEN3_LENGTH              0x00000001

#define _IBIASCONH_GENSRCEN3_POSITION            0x0000000B
#define _IBIASCONH_GENSRCEN3_MASK                0x00000800
#define _IBIASCONH_GENSRCEN3_LENGTH              0x00000001

#define _IBIASCONH_SHRSNKEN3_POSITION            0x0000000C
#define _IBIASCONH_SHRSNKEN3_MASK                0x00001000
#define _IBIASCONH_SHRSNKEN3_LENGTH              0x00000001

