wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _CCP8CON2L_SSDG_POSITION                 0x0000000C
#define _CCP8CON2L_SSDG_MASK                     0x00001000
#define _CCP8CON2L_SSDG_LENGTH                   0x00000001

#define _CCP8CON2L_ASDGM_POSITION                0x0000000E
#define _CCP8CON2L_ASDGM_MASK                    0x00004000
#define _CCP8CON2L_ASDGM_LENGTH                  0x00000001

#define _CCP8CON2L_PWMRSEN_POSITION              0x0000000F
#define _CCP8CON2L_PWMRSEN_MASK                  0x00008000
#define _CCP8CON2L_PWMRSEN_LENGTH                0x00000001

#define _CCP8CON2L_ASDG0_POSITION                0x00000000
#define _CCP8CON2L_ASDG0_MASK                    0x00000001
#define _CCP8CON2L_ASDG0_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG1_POSITION                0x00000001
#define _CCP8CON2L_ASDG1_MASK                    0x00000002
#define _CCP8CON2L_ASDG1_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG2_POSITION                0x00000002
#define _CCP8CON2L_ASDG2_MASK                    0x00000004
#define _CCP8CON2L_ASDG2_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG3_POSITION                0x00000003
#define _CCP8CON2L_ASDG3_MASK                    0x00000008
#define _CCP8CON2L_ASDG3_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG4_POSITION                0x00000004
#define _CCP8CON2L_ASDG4_MASK                    0x00000010
#define _CCP8CON2L_ASDG4_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG5_POSITION                0x00000005
#define _CCP8CON2L_ASDG5_MASK                    0x00000020
#define _CCP8CON2L_ASDG5_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG6_POSITION                0x00000006
#define _CCP8CON2L_ASDG6_MASK                    0x00000040
#define _CCP8CON2L_ASDG6_LENGTH                  0x00000001

#define _CCP8CON2L_ASDG7_POSITION                0x00000007
#define _CCP8CON2L_ASDG7_MASK                    0x00000080
#define _CCP8CON2L_ASDG7_LENGTH                  0x00000001

#define _CCP8CON2H_ICS_POSITION                  0x00000000
#define _CCP8CON2H_ICS_MASK                      0x00000007
#define _CCP8CON2H_ICS_LENGTH                    0x00000003

#define _CCP8CON2H_AUXOUT_POSITION               0x00000003
#define _CCP8CON2H_AUXOUT_MASK                   0x00000018
#define _CCP8CON2H_AUXOUT_LENGTH                 0x00000002

#define _CCP8CON2H_ICGSM_POSITION                0x00000006
#define _CCP8CON2H_ICGSM_MASK                    0x000000C0
#define _CCP8CON2H_ICGSM_LENGTH                  0x00000002

#define _CCP8CON2H_OCAEN_POSITION                0x00000008
#define _CCP8CON2H_OCAEN_MASK                    0x00000100
#define _CCP8CON2H_OCAEN_LENGTH                  0x00000001

#define _CCP8CON2H_OENSYNC_POSITION              0x0000000F
#define _CCP8CON2H_OENSYNC_MASK                  0x00008000
#define _CCP8CON2H_OENSYNC_LENGTH                0x00000001

#define _CCP8CON2H_ICS0_POSITION                 0x00000000
#define _CCP8CON2H_ICS0_MASK                     0x00000001
#define _CCP8CON2H_ICS0_LENGTH                   0x00000001

#define _CCP8CON2H_ICS1_POSITION                 0x00000001
#define _CCP8CON2H_ICS1_MASK                     0x00000002
#define _CCP8CON2H_ICS1_LENGTH                   0x00000001

#define _CCP8CON2H_ICS2_POSITION                 0x00000002
#define _CCP8CON2H_ICS2_MASK                     0x00000004
#define _CCP8CON2H_ICS2_LENGTH                   0x00000001

#define _CCP8CON2H_AUXOUT0_POSITION              0x00000003
#define _CCP8CON2H_AUXOUT0_MASK                  0x00000008
#define _CCP8CON2H_AUXOUT0_LENGTH                0x00000001

#define _CCP8CON2H_AUXOUT1_POSITION              0x00000004
#define _CCP8CON2H_AUXOUT1_MASK                  0x00000010
#define _CCP8CON2H_AUXOUT1_LENGTH                0x00000001

#define _CCP8CON2H_ICGSM0_POSITION               0x00000006
#define _CCP8CON2H_ICGSM0_MASK                   0x00000040
#define _CCP8CON2H_ICGSM0_LENGTH                 0x00000001

#define _CCP8CON2H_ICGSM1_POSITION               0x00000007
#define _CCP8CON2H_ICGSM1_MASK                   0x00000080
#define _CCP8CON2H_ICGSM1_LENGTH                 0x00000001

#define _CCP8CON2H_ICSEL_POSITION                0x00000000
#define _CCP8CON2H_ICSEL_MASK                    0x00000007
#define _CCP8CON2H_ICSEL_LENGTH                  0x00000003

#define _CCP8CON2H_ICSEL0_POSITION               0x00000000
#define _CCP8CON2H_ICSEL0_MASK                   0x00000001
#define _CCP8CON2H_ICSEL0_LENGTH                 0x00000001

#define _CCP8CON2H_ICSEL1_POSITION               0x00000001
#define _CCP8CON2H_ICSEL1_MASK                   0x00000002
#define _CCP8CON2H_ICSEL1_LENGTH                 0x00000001

#define _CCP8CON2H_ICSEL2_POSITION               0x00000002
#define _CCP8CON2H_ICSEL2_MASK                   0x00000004
#define _CCP8CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP8CON3H_PSSACE_POSITION               0x00000002
#define _CCP8CON3H_PSSACE_MASK                   0x0000000C
#define _CCP8CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP8CON3H_POLACE_POSITION               0x00000005
#define _CCP8CON3H_POLACE_MASK                   0x00000020
#define _CCP8CON3H_POLACE_LENGTH                 0x00000001

#define _CCP8CON3H_OSCNT_POSITION                0x0000000C
#define _CCP8CON3H_OSCNT_MASK                    0x00007000
#define _CCP8CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP8CON3H_OETRIG_POSITION               0x0000000F
#define _CCP8CON3H_OETRIG_MASK                   0x00008000
#define _CCP8CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP8CON3H_PSSACE0_POSITION              0x00000002
#define _CCP8CON3H_PSSACE0_MASK                  0x00000004
#define _CCP8CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP8CON3H_PSSACE1_POSITION              0x00000003
#define _CCP8CON3H_PSSACE1_MASK                  0x00000008
#define _CCP8CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP8CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP8CON3H_OSCNT0_MASK                   0x00001000
#define _CCP8CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP8CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP8CON3H_OSCNT1_MASK                   0x00002000
#define _CCP8CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP8CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP8CON3H_OSCNT2_MASK                   0x00004000
#define _CCP8CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP8STAT_ICBNE_POSITION                 0x00000000
#define _CCP8STAT_ICBNE_MASK                     0x00000001
#define _CCP8STAT_ICBNE_LENGTH                   0x00000001

