wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADCON3L_SHRSAMP_POSITION                0x00000009
#define _ADCON3L_SHRSAMP_MASK                    0x00000200
#define _ADCON3L_SHRSAMP_LENGTH                  0x00000001

#define _ADCON3L_SUSPRDY_POSITION                0x0000000A
#define _ADCON3L_SUSPRDY_MASK                    0x00000400
#define _ADCON3L_SUSPRDY_LENGTH                  0x00000001

#define _ADCON3L_SUSPCIE_POSITION                0x0000000B
#define _ADCON3L_SUSPCIE_MASK                    0x00000800
#define _ADCON3L_SUSPCIE_LENGTH                  0x00000001

#define _ADCON3L_SUSPEND_POSITION                0x0000000C
#define _ADCON3L_SUSPEND_MASK                    0x00001000
#define _ADCON3L_SUSPEND_LENGTH                  0x00000001

#define _ADCON3L_REFSEL_POSITION                 0x0000000D
#define _ADCON3L_REFSEL_MASK                     0x0000E000
#define _ADCON3L_REFSEL_LENGTH                   0x00000003

#define _ADCON3L_CNVCHSEL0_POSITION              0x00000000
#define _ADCON3L_CNVCHSEL0_MASK                  0x00000001
#define _ADCON3L_CNVCHSEL0_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL1_POSITION              0x00000001
#define _ADCON3L_CNVCHSEL1_MASK                  0x00000002
#define _ADCON3L_CNVCHSEL1_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL2_POSITION              0x00000002
#define _ADCON3L_CNVCHSEL2_MASK                  0x00000004
#define _ADCON3L_CNVCHSEL2_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL3_POSITION              0x00000003
#define _ADCON3L_CNVCHSEL3_MASK                  0x00000008
#define _ADCON3L_CNVCHSEL3_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL4_POSITION              0x00000004
#define _ADCON3L_CNVCHSEL4_MASK                  0x00000010
#define _ADCON3L_CNVCHSEL4_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL5_POSITION              0x00000005
#define _ADCON3L_CNVCHSEL5_MASK                  0x00000020
#define _ADCON3L_CNVCHSEL5_LENGTH                0x00000001

#define _ADCON3L_REFSEL0_POSITION                0x0000000D
#define _ADCON3L_REFSEL0_MASK                    0x00002000
#define _ADCON3L_REFSEL0_LENGTH                  0x00000001

#define _ADCON3L_REFSEL1_POSITION                0x0000000E
#define _ADCON3L_REFSEL1_MASK                    0x00004000
#define _ADCON3L_REFSEL1_LENGTH                  0x00000001

#define _ADCON3L_REFSEL2_POSITION                0x0000000F
#define _ADCON3L_REFSEL2_MASK                    0x00008000
#define _ADCON3L_REFSEL2_LENGTH                  0x00000001

#define _ADCON3H_C0EN_POSITION                   0x00000000
#define _ADCON3H_C0EN_MASK                       0x00000001
#define _ADCON3H_C0EN_LENGTH                     0x00000001

#define _ADCON3H_C1EN_POSITION                   0x00000001
#define _ADCON3H_C1EN_MASK                       0x00000002
#define _ADCON3H_C1EN_LENGTH                     0x00000001

#define _ADCON3H_SHREN_POSITION                  0x00000007
#define _ADCON3H_SHREN_MASK                      0x00000080
#define _ADCON3H_SHREN_LENGTH                    0x00000001

#define _ADCON3H_CLKDIV_POSITION                 0x00000008
#define _ADCON3H_CLKDIV_MASK                     0x00003F00
#define _ADCON3H_CLKDIV_LENGTH                   0x00000006

#define _ADCON3H_CLKSEL_POSITION                 0x0000000E
#define _ADCON3H_CLKSEL_MASK                     0x0000C000
#define _ADCON3H_CLKSEL_LENGTH                   0x00000002

#define _ADCON3H_CLKDIV0_POSITION                0x00000008
#define _ADCON3H_CLKDIV0_MASK                    0x00000100
#define _ADCON3H_CLKDIV0_LENGTH                  0x00000001

#define _ADCON3H_CLKDIV1_POSITION                0x00000009
#define _ADCON3H_CLKDIV1_MASK                    0x00000200
#define _ADCON3H_CLKDIV1_LENGTH                  0x00000001

#define _ADCON3H_CLKDIV2_POSITION                0x0000000A
#define _ADCON3H_CLKDIV2_MASK                    0x00000400
#define _ADCON3H_CLKDIV2_LENGTH                  0x00000001

#define _ADCON3H_CLKDIV3_POSITION                0x0000000B
#define _ADCON3H_CLKDIV3_MASK                    0x00000800
#define _ADCON3H_CLKDIV3_LENGTH                  0x00000001

#define _ADCON3H_CLKDIV4_POSITION                0x0000000C
#define _ADCON3H_CLKDIV4_MASK                    0x00001000
#define _ADCON3H_CLKDIV4_LENGTH                  0x00000001

#define _ADCON3H_CLKDIV5_POSITION                0x0000000D
#define _ADCON3H_CLKDIV5_MASK                    0x00002000
#define _ADCON3H_CLKDIV5_LENGTH                  0x00000001

#define _ADCON3H_CLKSEL0_POSITION                0x0000000E
#define _ADCON3H_CLKSEL0_MASK                    0x00004000
#define _ADCON3H_CLKSEL0_LENGTH                  0x00000001

#define _ADCON3H_CLKSEL1_POSITION                0x0000000F
#define _ADCON3H_CLKSEL1_MASK                    0x00008000
#define _ADCON3H_CLKSEL1_LENGTH                  0x00000001

#define _ADCON4L_SAMC0EN_POSITION                0x00000000
#define _ADCON4L_SAMC0EN_MASK                    0x00000001
#define _ADCON4L_SAMC0EN_LENGTH                  0x00000001

#define _ADCON4L_SAMC1EN_POSITION                0x00000001
#define _ADCON4L_SAMC1EN_MASK                    0x00000002
#define _ADCON4L_SAMC1EN_LENGTH                  0x00000001

#define _ADCON4H_C0CHS_POSITION                  0x00000000
#define _ADCON4H_C0CHS_MASK                      0x00000003
#define _ADCON4H_C0CHS_LENGTH                    0x00000002

#define _ADCON4H_C1CHS_POSITION                  0x00000002
#define _ADCON4H_C1CHS_MASK                      0x0000000C
#define _ADCON4H_C1CHS_LENGTH                    0x00000002

#define _ADCON4H_C0CHS0_POSITION                 0x00000000
#define _ADCON4H_C0CHS0_MASK                     0x00000001
#define _ADCON4H_C0CHS0_LENGTH                   0x00000001

#define _ADCON4H_C0CHS1_POSITION                 0x00000001
#define _ADCON4H_C0CHS1_MASK                     0x00000002
#define _ADCON4H_C0CHS1_LENGTH                   0x00000001

#define _ADCON4H_C1CHS0_POSITION                 0x00000002
#define _ADCON4H_C1CHS0_MASK                     0x00000004
#define _ADCON4H_C1CHS0_LENGTH                   0x00000001

