wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADSTATH_AN19RDY_POSITION                0x00000003
#define _ADSTATH_AN19RDY_MASK                    0x00000008
#define _ADSTATH_AN19RDY_LENGTH                  0x00000001

#define _ADSTATH_AN24RDY_POSITION                0x00000008
#define _ADSTATH_AN24RDY_MASK                    0x00000100
#define _ADSTATH_AN24RDY_LENGTH                  0x00000001

#define _ADSTATH_AN25RDY_POSITION                0x00000009
#define _ADSTATH_AN25RDY_MASK                    0x00000200
#define _ADSTATH_AN25RDY_LENGTH                  0x00000001

#define _ADCMP0ENL_CMPEN0_POSITION               0x00000000
#define _ADCMP0ENL_CMPEN0_MASK                   0x00000001
#define _ADCMP0ENL_CMPEN0_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN1_POSITION               0x00000001
#define _ADCMP0ENL_CMPEN1_MASK                   0x00000002
#define _ADCMP0ENL_CMPEN1_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN2_POSITION               0x00000002
#define _ADCMP0ENL_CMPEN2_MASK                   0x00000004
#define _ADCMP0ENL_CMPEN2_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN3_POSITION               0x00000003
#define _ADCMP0ENL_CMPEN3_MASK                   0x00000008
#define _ADCMP0ENL_CMPEN3_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN4_POSITION               0x00000004
#define _ADCMP0ENL_CMPEN4_MASK                   0x00000010
#define _ADCMP0ENL_CMPEN4_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN5_POSITION               0x00000005
#define _ADCMP0ENL_CMPEN5_MASK                   0x00000020
#define _ADCMP0ENL_CMPEN5_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN6_POSITION               0x00000006
#define _ADCMP0ENL_CMPEN6_MASK                   0x00000040
#define _ADCMP0ENL_CMPEN6_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN7_POSITION               0x00000007
#define _ADCMP0ENL_CMPEN7_MASK                   0x00000080
#define _ADCMP0ENL_CMPEN7_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN8_POSITION               0x00000008
#define _ADCMP0ENL_CMPEN8_MASK                   0x00000100
#define _ADCMP0ENL_CMPEN8_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN9_POSITION               0x00000009
#define _ADCMP0ENL_CMPEN9_MASK                   0x00000200
#define _ADCMP0ENL_CMPEN9_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN10_POSITION              0x0000000A
#define _ADCMP0ENL_CMPEN10_MASK                  0x00000400
#define _ADCMP0ENL_CMPEN10_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN11_POSITION              0x0000000B
#define _ADCMP0ENL_CMPEN11_MASK                  0x00000800
#define _ADCMP0ENL_CMPEN11_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN12_POSITION              0x0000000C
#define _ADCMP0ENL_CMPEN12_MASK                  0x00001000
#define _ADCMP0ENL_CMPEN12_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN13_POSITION              0x0000000D
#define _ADCMP0ENL_CMPEN13_MASK                  0x00002000
#define _ADCMP0ENL_CMPEN13_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN14_POSITION              0x0000000E
#define _ADCMP0ENL_CMPEN14_MASK                  0x00004000
#define _ADCMP0ENL_CMPEN14_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN15_POSITION              0x0000000F
#define _ADCMP0ENL_CMPEN15_MASK                  0x00008000
#define _ADCMP0ENL_CMPEN15_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN16_POSITION              0x00000000
#define _ADCMP0ENH_CMPEN16_MASK                  0x00000001
#define _ADCMP0ENH_CMPEN16_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN17_POSITION              0x00000001
#define _ADCMP0ENH_CMPEN17_MASK                  0x00000002
#define _ADCMP0ENH_CMPEN17_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN18_POSITION              0x00000002
#define _ADCMP0ENH_CMPEN18_MASK                  0x00000004
#define _ADCMP0ENH_CMPEN18_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN19_POSITION              0x00000003
#define _ADCMP0ENH_CMPEN19_MASK                  0x00000008
#define _ADCMP0ENH_CMPEN19_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN24_POSITION              0x00000008
#define _ADCMP0ENH_CMPEN24_MASK                  0x00000100
#define _ADCMP0ENH_CMPEN24_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN25_POSITION              0x00000009
#define _ADCMP0ENH_CMPEN25_MASK                  0x00000200
#define _ADCMP0ENH_CMPEN25_LENGTH                0x00000001

#define _ADCMP1ENL_CMPEN0_POSITION               0x00000000
#define _ADCMP1ENL_CMPEN0_MASK                   0x00000001
#define _ADCMP1ENL_CMPEN0_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN1_POSITION               0x00000001
#define _ADCMP1ENL_CMPEN1_MASK                   0x00000002
#define _ADCMP1ENL_CMPEN1_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN2_POSITION               0x00000002
#define _ADCMP1ENL_CMPEN2_MASK                   0x00000004
#define _ADCMP1ENL_CMPEN2_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN3_POSITION               0x00000003
#define _ADCMP1ENL_CMPEN3_MASK                   0x00000008
#define _ADCMP1ENL_CMPEN3_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN4_POSITION               0x00000004
#define _ADCMP1ENL_CMPEN4_MASK                   0x00000010
#define _ADCMP1ENL_CMPEN4_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN5_POSITION               0x00000005
#define _ADCMP1ENL_CMPEN5_MASK                   0x00000020
#define _ADCMP1ENL_CMPEN5_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN6_POSITION               0x00000006
#define _ADCMP1ENL_CMPEN6_MASK                   0x00000040
#define _ADCMP1ENL_CMPEN6_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN7_POSITION               0x00000007
#define _ADCMP1ENL_CMPEN7_MASK                   0x00000080
#define _ADCMP1ENL_CMPEN7_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN8_POSITION               0x00000008
#define _ADCMP1ENL_CMPEN8_MASK                   0x00000100
#define _ADCMP1ENL_CMPEN8_LENGTH                 0x00000001

