wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADFL3CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL3CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL3CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL3CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL3CON_OVRSAM0_MASK                   0x00000400
#define _ADFL3CON_OVRSAM0_LENGTH                 0x00000001

#define _ADFL3CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL3CON_OVRSAM1_MASK                   0x00000800
#define _ADFL3CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL3CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL3CON_OVRSAM2_MASK                   0x00001000
#define _ADFL3CON_OVRSAM2_LENGTH                 0x00000001

#define _ADTRIG0L_TRGSRC0_POSITION               0x00000000
#define _ADTRIG0L_TRGSRC0_MASK                   0x0000001F
#define _ADTRIG0L_TRGSRC0_LENGTH                 0x00000005

#define _ADTRIG0L_TRGSRC1_POSITION               0x00000008
#define _ADTRIG0L_TRGSRC1_MASK                   0x00001F00
#define _ADTRIG0L_TRGSRC1_LENGTH                 0x00000005

#define _ADTRIG0L_TRIGSRC00_POSITION             0x00000000
#define _ADTRIG0L_TRIGSRC00_MASK                 0x00000001
#define _ADTRIG0L_TRIGSRC00_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC01_POSITION             0x00000001
#define _ADTRIG0L_TRIGSRC01_MASK                 0x00000002
#define _ADTRIG0L_TRIGSRC01_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC02_POSITION             0x00000002
#define _ADTRIG0L_TRIGSRC02_MASK                 0x00000004
#define _ADTRIG0L_TRIGSRC02_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC03_POSITION             0x00000003
#define _ADTRIG0L_TRIGSRC03_MASK                 0x00000008
#define _ADTRIG0L_TRIGSRC03_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC04_POSITION             0x00000004
#define _ADTRIG0L_TRIGSRC04_MASK                 0x00000010
#define _ADTRIG0L_TRIGSRC04_LENGTH               0x00000001

#define _ADTRIG0L_TRGSRC10_POSITION              0x00000008
#define _ADTRIG0L_TRGSRC10_MASK                  0x00000100
#define _ADTRIG0L_TRGSRC10_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC11_POSITION              0x00000009
#define _ADTRIG0L_TRGSRC11_MASK                  0x00000200
#define _ADTRIG0L_TRGSRC11_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC12_POSITION              0x0000000A
#define _ADTRIG0L_TRGSRC12_MASK                  0x00000400
#define _ADTRIG0L_TRGSRC12_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC13_POSITION              0x0000000B
#define _ADTRIG0L_TRGSRC13_MASK                  0x00000800
#define _ADTRIG0L_TRGSRC13_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC14_POSITION              0x0000000C
#define _ADTRIG0L_TRGSRC14_MASK                  0x00001000
#define _ADTRIG0L_TRGSRC14_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC00_POSITION              0x00000000
#define _ADTRIG0L_TRGSRC00_MASK                  0x00000001
#define _ADTRIG0L_TRGSRC00_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC01_POSITION              0x00000001
#define _ADTRIG0L_TRGSRC01_MASK                  0x00000002
#define _ADTRIG0L_TRGSRC01_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC02_POSITION              0x00000002
#define _ADTRIG0L_TRGSRC02_MASK                  0x00000004
#define _ADTRIG0L_TRGSRC02_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC03_POSITION              0x00000003
#define _ADTRIG0L_TRGSRC03_MASK                  0x00000008
#define _ADTRIG0L_TRGSRC03_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC04_POSITION              0x00000004
#define _ADTRIG0L_TRGSRC04_MASK                  0x00000010
#define _ADTRIG0L_TRGSRC04_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC2_POSITION               0x00000000
#define _ADTRIG0H_TRGSRC2_MASK                   0x0000001F
#define _ADTRIG0H_TRGSRC2_LENGTH                 0x00000005

#define _ADTRIG0H_TRGSRC3_POSITION               0x00000008
#define _ADTRIG0H_TRGSRC3_MASK                   0x00001F00
#define _ADTRIG0H_TRGSRC3_LENGTH                 0x00000005

#define _ADTRIG0H_TRIGSRC20_POSITION             0x00000000
#define _ADTRIG0H_TRIGSRC20_MASK                 0x00000001
#define _ADTRIG0H_TRIGSRC20_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC21_POSITION             0x00000001
#define _ADTRIG0H_TRIGSRC21_MASK                 0x00000002
#define _ADTRIG0H_TRIGSRC21_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC22_POSITION             0x00000002
#define _ADTRIG0H_TRIGSRC22_MASK                 0x00000004
#define _ADTRIG0H_TRIGSRC22_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC23_POSITION             0x00000003
#define _ADTRIG0H_TRIGSRC23_MASK                 0x00000008
#define _ADTRIG0H_TRIGSRC23_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC24_POSITION             0x00000004
#define _ADTRIG0H_TRIGSRC24_MASK                 0x00000010
#define _ADTRIG0H_TRIGSRC24_LENGTH               0x00000001

#define _ADTRIG0H_TRGSRC30_POSITION              0x00000008
#define _ADTRIG0H_TRGSRC30_MASK                  0x00000100
#define _ADTRIG0H_TRGSRC30_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC31_POSITION              0x00000009
#define _ADTRIG0H_TRGSRC31_MASK                  0x00000200
#define _ADTRIG0H_TRGSRC31_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC32_POSITION              0x0000000A
#define _ADTRIG0H_TRGSRC32_MASK                  0x00000400
#define _ADTRIG0H_TRGSRC32_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC33_POSITION              0x0000000B
#define _ADTRIG0H_TRGSRC33_MASK                  0x00000800
#define _ADTRIG0H_TRGSRC33_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC34_POSITION              0x0000000C
#define _ADTRIG0H_TRGSRC34_MASK                  0x00001000
#define _ADTRIG0H_TRGSRC34_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC20_POSITION              0x00000000
#define _ADTRIG0H_TRGSRC20_MASK                  0x00000001
#define _ADTRIG0H_TRGSRC20_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC21_POSITION              0x00000001
#define _ADTRIG0H_TRGSRC21_MASK                  0x00000002
#define _ADTRIG0H_TRGSRC21_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC22_POSITION              0x00000002
#define _ADTRIG0H_TRGSRC22_MASK                  0x00000004
#define _ADTRIG0H_TRGSRC22_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC23_POSITION              0x00000003
#define _ADTRIG0H_TRGSRC23_MASK                  0x00000008
#define _ADTRIG0H_TRGSRC23_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC24_POSITION              0x00000004
#define _ADTRIG0H_TRGSRC24_MASK                  0x00000010
#define _ADTRIG0H_TRGSRC24_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC4_POSITION               0x00000000
#define _ADTRIG1L_TRGSRC4_MASK                   0x0000001F
#define _ADTRIG1L_TRGSRC4_LENGTH                 0x00000005

#define _ADTRIG1L_TRGSRC5_POSITION               0x00000008
#define _ADTRIG1L_TRGSRC5_MASK                   0x00001F00
#define _ADTRIG1L_TRGSRC5_LENGTH                 0x00000005

