wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADTRIG2L_TRIGSRC83_POSITION             0x00000003
#define _ADTRIG2L_TRIGSRC83_MASK                 0x00000008
#define _ADTRIG2L_TRIGSRC83_LENGTH               0x00000001

#define _ADTRIG2L_TRIGSRC84_POSITION             0x00000004
#define _ADTRIG2L_TRIGSRC84_MASK                 0x00000010
#define _ADTRIG2L_TRIGSRC84_LENGTH               0x00000001

#define _ADTRIG2L_TRGSRC90_POSITION              0x00000008
#define _ADTRIG2L_TRGSRC90_MASK                  0x00000100
#define _ADTRIG2L_TRGSRC90_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC91_POSITION              0x00000009
#define _ADTRIG2L_TRGSRC91_MASK                  0x00000200
#define _ADTRIG2L_TRGSRC91_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC92_POSITION              0x0000000A
#define _ADTRIG2L_TRGSRC92_MASK                  0x00000400
#define _ADTRIG2L_TRGSRC92_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC93_POSITION              0x0000000B
#define _ADTRIG2L_TRGSRC93_MASK                  0x00000800
#define _ADTRIG2L_TRGSRC93_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC94_POSITION              0x0000000C
#define _ADTRIG2L_TRGSRC94_MASK                  0x00001000
#define _ADTRIG2L_TRGSRC94_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC80_POSITION              0x00000000
#define _ADTRIG2L_TRGSRC80_MASK                  0x00000001
#define _ADTRIG2L_TRGSRC80_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC81_POSITION              0x00000001
#define _ADTRIG2L_TRGSRC81_MASK                  0x00000002
#define _ADTRIG2L_TRGSRC81_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC82_POSITION              0x00000002
#define _ADTRIG2L_TRGSRC82_MASK                  0x00000004
#define _ADTRIG2L_TRGSRC82_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC83_POSITION              0x00000003
#define _ADTRIG2L_TRGSRC83_MASK                  0x00000008
#define _ADTRIG2L_TRGSRC83_LENGTH                0x00000001

#define _ADTRIG2L_TRGSRC84_POSITION              0x00000004
#define _ADTRIG2L_TRGSRC84_MASK                  0x00000010
#define _ADTRIG2L_TRGSRC84_LENGTH                0x00000001

#define _ADTRIG2H_TRGSRC10_POSITION              0x00000000
#define _ADTRIG2H_TRGSRC10_MASK                  0x0000001F
#define _ADTRIG2H_TRGSRC10_LENGTH                0x00000005

#define _ADTRIG2H_TRGSRC11_POSITION              0x00000008
#define _ADTRIG2H_TRGSRC11_MASK                  0x00001F00
#define _ADTRIG2H_TRGSRC11_LENGTH                0x00000005

#define _ADTRIG2H_TRIGSRC100_POSITION            0x00000000
#define _ADTRIG2H_TRIGSRC100_MASK                0x00000001
#define _ADTRIG2H_TRIGSRC100_LENGTH              0x00000001

#define _ADTRIG2H_TRIGSRC101_POSITION            0x00000001
#define _ADTRIG2H_TRIGSRC101_MASK                0x00000002
#define _ADTRIG2H_TRIGSRC101_LENGTH              0x00000001

#define _ADTRIG2H_TRIGSRC102_POSITION            0x00000002
#define _ADTRIG2H_TRIGSRC102_MASK                0x00000004
#define _ADTRIG2H_TRIGSRC102_LENGTH              0x00000001

#define _ADTRIG2H_TRIGSRC103_POSITION            0x00000003
#define _ADTRIG2H_TRIGSRC103_MASK                0x00000008
#define _ADTRIG2H_TRIGSRC103_LENGTH              0x00000001

#define _ADTRIG2H_TRIGSRC104_POSITION            0x00000004
#define _ADTRIG2H_TRIGSRC104_MASK                0x00000010
#define _ADTRIG2H_TRIGSRC104_LENGTH              0x00000001

#define _ADTRIG2H_TRGSRC110_POSITION             0x00000008
#define _ADTRIG2H_TRGSRC110_MASK                 0x00000100
#define _ADTRIG2H_TRGSRC110_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC111_POSITION             0x00000009
#define _ADTRIG2H_TRGSRC111_MASK                 0x00000200
#define _ADTRIG2H_TRGSRC111_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC112_POSITION             0x0000000A
#define _ADTRIG2H_TRGSRC112_MASK                 0x00000400
#define _ADTRIG2H_TRGSRC112_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC113_POSITION             0x0000000B
#define _ADTRIG2H_TRGSRC113_MASK                 0x00000800
#define _ADTRIG2H_TRGSRC113_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC114_POSITION             0x0000000C
#define _ADTRIG2H_TRGSRC114_MASK                 0x00001000
#define _ADTRIG2H_TRGSRC114_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC100_POSITION             0x00000000
#define _ADTRIG2H_TRGSRC100_MASK                 0x00000001
#define _ADTRIG2H_TRGSRC100_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC101_POSITION             0x00000001
#define _ADTRIG2H_TRGSRC101_MASK                 0x00000002
#define _ADTRIG2H_TRGSRC101_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC102_POSITION             0x00000002
#define _ADTRIG2H_TRGSRC102_MASK                 0x00000004
#define _ADTRIG2H_TRGSRC102_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC103_POSITION             0x00000003
#define _ADTRIG2H_TRGSRC103_MASK                 0x00000008
#define _ADTRIG2H_TRGSRC103_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC104_POSITION             0x00000004
#define _ADTRIG2H_TRGSRC104_MASK                 0x00000010
#define _ADTRIG2H_TRGSRC104_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC12_POSITION              0x00000000
#define _ADTRIG3L_TRGSRC12_MASK                  0x0000001F
#define _ADTRIG3L_TRGSRC12_LENGTH                0x00000005

#define _ADTRIG3L_TRGSRC13_POSITION              0x00000008
#define _ADTRIG3L_TRGSRC13_MASK                  0x00001F00
#define _ADTRIG3L_TRGSRC13_LENGTH                0x00000005

#define _ADTRIG3L_TRIGSRC120_POSITION            0x00000000
#define _ADTRIG3L_TRIGSRC120_MASK                0x00000001
#define _ADTRIG3L_TRIGSRC120_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC121_POSITION            0x00000001
#define _ADTRIG3L_TRIGSRC121_MASK                0x00000002
#define _ADTRIG3L_TRIGSRC121_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC122_POSITION            0x00000002
#define _ADTRIG3L_TRIGSRC122_MASK                0x00000004
#define _ADTRIG3L_TRIGSRC122_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC123_POSITION            0x00000003
#define _ADTRIG3L_TRIGSRC123_MASK                0x00000008
#define _ADTRIG3L_TRIGSRC123_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC124_POSITION            0x00000004
#define _ADTRIG3L_TRIGSRC124_MASK                0x00000010
#define _ADTRIG3L_TRIGSRC124_LENGTH              0x00000001

#define _ADTRIG3L_TRGSRC130_POSITION             0x00000008
#define _ADTRIG3L_TRGSRC130_MASK                 0x00000100
#define _ADTRIG3L_TRGSRC130_LENGTH               0x00000001

