wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADTRIG3L_TRGSRC131_POSITION             0x00000009
#define _ADTRIG3L_TRGSRC131_MASK                 0x00000200
#define _ADTRIG3L_TRGSRC131_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC132_POSITION             0x0000000A
#define _ADTRIG3L_TRGSRC132_MASK                 0x00000400
#define _ADTRIG3L_TRGSRC132_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC133_POSITION             0x0000000B
#define _ADTRIG3L_TRGSRC133_MASK                 0x00000800
#define _ADTRIG3L_TRGSRC133_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC134_POSITION             0x0000000C
#define _ADTRIG3L_TRGSRC134_MASK                 0x00001000
#define _ADTRIG3L_TRGSRC134_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC120_POSITION             0x00000000
#define _ADTRIG3L_TRGSRC120_MASK                 0x00000001
#define _ADTRIG3L_TRGSRC120_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC121_POSITION             0x00000001
#define _ADTRIG3L_TRGSRC121_MASK                 0x00000002
#define _ADTRIG3L_TRGSRC121_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC122_POSITION             0x00000002
#define _ADTRIG3L_TRGSRC122_MASK                 0x00000004
#define _ADTRIG3L_TRGSRC122_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC123_POSITION             0x00000003
#define _ADTRIG3L_TRGSRC123_MASK                 0x00000008
#define _ADTRIG3L_TRGSRC123_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC124_POSITION             0x00000004
#define _ADTRIG3L_TRGSRC124_MASK                 0x00000010
#define _ADTRIG3L_TRGSRC124_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC14_POSITION              0x00000000
#define _ADTRIG3H_TRGSRC14_MASK                  0x0000001F
#define _ADTRIG3H_TRGSRC14_LENGTH                0x00000005

#define _ADTRIG3H_TRGSRC15_POSITION              0x00000008
#define _ADTRIG3H_TRGSRC15_MASK                  0x00001F00
#define _ADTRIG3H_TRGSRC15_LENGTH                0x00000005

#define _ADTRIG3H_TRIGSRC140_POSITION            0x00000000
#define _ADTRIG3H_TRIGSRC140_MASK                0x00000001
#define _ADTRIG3H_TRIGSRC140_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC141_POSITION            0x00000001
#define _ADTRIG3H_TRIGSRC141_MASK                0x00000002
#define _ADTRIG3H_TRIGSRC141_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC142_POSITION            0x00000002
#define _ADTRIG3H_TRIGSRC142_MASK                0x00000004
#define _ADTRIG3H_TRIGSRC142_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC143_POSITION            0x00000003
#define _ADTRIG3H_TRIGSRC143_MASK                0x00000008
#define _ADTRIG3H_TRIGSRC143_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC144_POSITION            0x00000004
#define _ADTRIG3H_TRIGSRC144_MASK                0x00000010
#define _ADTRIG3H_TRIGSRC144_LENGTH              0x00000001

#define _ADTRIG3H_TRGSRC150_POSITION             0x00000008
#define _ADTRIG3H_TRGSRC150_MASK                 0x00000100
#define _ADTRIG3H_TRGSRC150_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC151_POSITION             0x00000009
#define _ADTRIG3H_TRGSRC151_MASK                 0x00000200
#define _ADTRIG3H_TRGSRC151_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC152_POSITION             0x0000000A
#define _ADTRIG3H_TRGSRC152_MASK                 0x00000400
#define _ADTRIG3H_TRGSRC152_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC153_POSITION             0x0000000B
#define _ADTRIG3H_TRGSRC153_MASK                 0x00000800
#define _ADTRIG3H_TRGSRC153_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC154_POSITION             0x0000000C
#define _ADTRIG3H_TRGSRC154_MASK                 0x00001000
#define _ADTRIG3H_TRGSRC154_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC140_POSITION             0x00000000
#define _ADTRIG3H_TRGSRC140_MASK                 0x00000001
#define _ADTRIG3H_TRGSRC140_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC141_POSITION             0x00000001
#define _ADTRIG3H_TRGSRC141_MASK                 0x00000002
#define _ADTRIG3H_TRGSRC141_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC142_POSITION             0x00000002
#define _ADTRIG3H_TRGSRC142_MASK                 0x00000004
#define _ADTRIG3H_TRGSRC142_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC143_POSITION             0x00000003
#define _ADTRIG3H_TRGSRC143_MASK                 0x00000008
#define _ADTRIG3H_TRGSRC143_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC144_POSITION             0x00000004
#define _ADTRIG3H_TRGSRC144_MASK                 0x00000010
#define _ADTRIG3H_TRGSRC144_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC16_POSITION              0x00000000
#define _ADTRIG4L_TRGSRC16_MASK                  0x0000001F
#define _ADTRIG4L_TRGSRC16_LENGTH                0x00000005

#define _ADTRIG4L_TRGSRC17_POSITION              0x00000008
#define _ADTRIG4L_TRGSRC17_MASK                  0x00001F00
#define _ADTRIG4L_TRGSRC17_LENGTH                0x00000005

#define _ADTRIG4L_TRIGSRC160_POSITION            0x00000000
#define _ADTRIG4L_TRIGSRC160_MASK                0x00000001
#define _ADTRIG4L_TRIGSRC160_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC161_POSITION            0x00000001
#define _ADTRIG4L_TRIGSRC161_MASK                0x00000002
#define _ADTRIG4L_TRIGSRC161_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC162_POSITION            0x00000002
#define _ADTRIG4L_TRIGSRC162_MASK                0x00000004
#define _ADTRIG4L_TRIGSRC162_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC163_POSITION            0x00000003
#define _ADTRIG4L_TRIGSRC163_MASK                0x00000008
#define _ADTRIG4L_TRIGSRC163_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC164_POSITION            0x00000004
#define _ADTRIG4L_TRIGSRC164_MASK                0x00000010
#define _ADTRIG4L_TRIGSRC164_LENGTH              0x00000001

#define _ADTRIG4L_TRGSRC170_POSITION             0x00000008
#define _ADTRIG4L_TRGSRC170_MASK                 0x00000100
#define _ADTRIG4L_TRGSRC170_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC171_POSITION             0x00000009
#define _ADTRIG4L_TRGSRC171_MASK                 0x00000200
#define _ADTRIG4L_TRGSRC171_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC172_POSITION             0x0000000A
#define _ADTRIG4L_TRGSRC172_MASK                 0x00000400
#define _ADTRIG4L_TRGSRC172_LENGTH               0x00000001

