wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADTRIG6L_TRGSRC242_POSITION             0x00000002
#define _ADTRIG6L_TRGSRC242_MASK                 0x00000004
#define _ADTRIG6L_TRGSRC242_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC243_POSITION             0x00000003
#define _ADTRIG6L_TRGSRC243_MASK                 0x00000008
#define _ADTRIG6L_TRGSRC243_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC244_POSITION             0x00000004
#define _ADTRIG6L_TRGSRC244_MASK                 0x00000010
#define _ADTRIG6L_TRGSRC244_LENGTH               0x00000001

#define _ADCMP0CON_LOLO_POSITION                 0x00000000
#define _ADCMP0CON_LOLO_MASK                     0x00000001
#define _ADCMP0CON_LOLO_LENGTH                   0x00000001

#define _ADCMP0CON_LOHI_POSITION                 0x00000001
#define _ADCMP0CON_LOHI_MASK                     0x00000002
#define _ADCMP0CON_LOHI_LENGTH                   0x00000001

#define _ADCMP0CON_HILO_POSITION                 0x00000002
#define _ADCMP0CON_HILO_MASK                     0x00000004
#define _ADCMP0CON_HILO_LENGTH                   0x00000001

#define _ADCMP0CON_HIHI_POSITION                 0x00000003
#define _ADCMP0CON_HIHI_MASK                     0x00000008
#define _ADCMP0CON_HIHI_LENGTH                   0x00000001

#define _ADCMP0CON_BTWN_POSITION                 0x00000004
#define _ADCMP0CON_BTWN_MASK                     0x00000010
#define _ADCMP0CON_BTWN_LENGTH                   0x00000001

#define _ADCMP0CON_STAT_POSITION                 0x00000005
#define _ADCMP0CON_STAT_MASK                     0x00000020
#define _ADCMP0CON_STAT_LENGTH                   0x00000001

#define _ADCMP0CON_IE_POSITION                   0x00000006
#define _ADCMP0CON_IE_MASK                       0x00000040
#define _ADCMP0CON_IE_LENGTH                     0x00000001

#define _ADCMP0CON_CMPEN_POSITION                0x00000007
#define _ADCMP0CON_CMPEN_MASK                    0x00000080
#define _ADCMP0CON_CMPEN_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL_POSITION                 0x00000008
#define _ADCMP0CON_CHNL_MASK                     0x00001F00
#define _ADCMP0CON_CHNL_LENGTH                   0x00000005

#define _ADCMP0CON_CHNL0_POSITION                0x00000008
#define _ADCMP0CON_CHNL0_MASK                    0x00000100
#define _ADCMP0CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL1_POSITION                0x00000009
#define _ADCMP0CON_CHNL1_MASK                    0x00000200
#define _ADCMP0CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL2_POSITION                0x0000000A
#define _ADCMP0CON_CHNL2_MASK                    0x00000400
#define _ADCMP0CON_CHNL2_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL3_POSITION                0x0000000B
#define _ADCMP0CON_CHNL3_MASK                    0x00000800
#define _ADCMP0CON_CHNL3_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL4_POSITION                0x0000000C
#define _ADCMP0CON_CHNL4_MASK                    0x00001000
#define _ADCMP0CON_CHNL4_LENGTH                  0x00000001

#define _ADCMP1CON_LOLO_POSITION                 0x00000000
#define _ADCMP1CON_LOLO_MASK                     0x00000001
#define _ADCMP1CON_LOLO_LENGTH                   0x00000001

#define _ADCMP1CON_LOHI_POSITION                 0x00000001
#define _ADCMP1CON_LOHI_MASK                     0x00000002
#define _ADCMP1CON_LOHI_LENGTH                   0x00000001

#define _ADCMP1CON_HILO_POSITION                 0x00000002
#define _ADCMP1CON_HILO_MASK                     0x00000004
#define _ADCMP1CON_HILO_LENGTH                   0x00000001

#define _ADCMP1CON_HIHI_POSITION                 0x00000003
#define _ADCMP1CON_HIHI_MASK                     0x00000008
#define _ADCMP1CON_HIHI_LENGTH                   0x00000001

#define _ADCMP1CON_BTWN_POSITION                 0x00000004
#define _ADCMP1CON_BTWN_MASK                     0x00000010
#define _ADCMP1CON_BTWN_LENGTH                   0x00000001

#define _ADCMP1CON_STAT_POSITION                 0x00000005
#define _ADCMP1CON_STAT_MASK                     0x00000020
#define _ADCMP1CON_STAT_LENGTH                   0x00000001

#define _ADCMP1CON_IE_POSITION                   0x00000006
#define _ADCMP1CON_IE_MASK                       0x00000040
#define _ADCMP1CON_IE_LENGTH                     0x00000001

#define _ADCMP1CON_CMPEN_POSITION                0x00000007
#define _ADCMP1CON_CMPEN_MASK                    0x00000080
#define _ADCMP1CON_CMPEN_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL_POSITION                 0x00000008
#define _ADCMP1CON_CHNL_MASK                     0x00001F00
#define _ADCMP1CON_CHNL_LENGTH                   0x00000005

#define _ADCMP1CON_CHNL0_POSITION                0x00000008
#define _ADCMP1CON_CHNL0_MASK                    0x00000100
#define _ADCMP1CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL1_POSITION                0x00000009
#define _ADCMP1CON_CHNL1_MASK                    0x00000200
#define _ADCMP1CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL2_POSITION                0x0000000A
#define _ADCMP1CON_CHNL2_MASK                    0x00000400
#define _ADCMP1CON_CHNL2_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL3_POSITION                0x0000000B
#define _ADCMP1CON_CHNL3_MASK                    0x00000800
#define _ADCMP1CON_CHNL3_LENGTH                  0x00000001

#define _ADCMP1CON_CHNL4_POSITION                0x0000000C
#define _ADCMP1CON_CHNL4_MASK                    0x00001000
#define _ADCMP1CON_CHNL4_LENGTH                  0x00000001

#define _ADCMP2CON_LOLO_POSITION                 0x00000000
#define _ADCMP2CON_LOLO_MASK                     0x00000001
#define _ADCMP2CON_LOLO_LENGTH                   0x00000001

#define _ADCMP2CON_LOHI_POSITION                 0x00000001
#define _ADCMP2CON_LOHI_MASK                     0x00000002
#define _ADCMP2CON_LOHI_LENGTH                   0x00000001

#define _ADCMP2CON_HILO_POSITION                 0x00000002
#define _ADCMP2CON_HILO_MASK                     0x00000004
#define _ADCMP2CON_HILO_LENGTH                   0x00000001

