wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADLVLTRGL_LVLEN10_POSITION              0x0000000A
#define _ADLVLTRGL_LVLEN10_MASK                  0x00000400
#define _ADLVLTRGL_LVLEN10_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN11_POSITION              0x0000000B
#define _ADLVLTRGL_LVLEN11_MASK                  0x00000800
#define _ADLVLTRGL_LVLEN11_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN12_POSITION              0x0000000C
#define _ADLVLTRGL_LVLEN12_MASK                  0x00001000
#define _ADLVLTRGL_LVLEN12_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN13_POSITION              0x0000000D
#define _ADLVLTRGL_LVLEN13_MASK                  0x00002000
#define _ADLVLTRGL_LVLEN13_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN14_POSITION              0x0000000E
#define _ADLVLTRGL_LVLEN14_MASK                  0x00004000
#define _ADLVLTRGL_LVLEN14_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN15_POSITION              0x0000000F
#define _ADLVLTRGL_LVLEN15_MASK                  0x00008000
#define _ADLVLTRGL_LVLEN15_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN16_POSITION              0x00000000
#define _ADLVLTRGH_LVLEN16_MASK                  0x00000001
#define _ADLVLTRGH_LVLEN16_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN17_POSITION              0x00000001
#define _ADLVLTRGH_LVLEN17_MASK                  0x00000002
#define _ADLVLTRGH_LVLEN17_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN18_POSITION              0x00000002
#define _ADLVLTRGH_LVLEN18_MASK                  0x00000004
#define _ADLVLTRGH_LVLEN18_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN19_POSITION              0x00000003
#define _ADLVLTRGH_LVLEN19_MASK                  0x00000008
#define _ADLVLTRGH_LVLEN19_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN24_POSITION              0x00000008
#define _ADLVLTRGH_LVLEN24_MASK                  0x00000100
#define _ADLVLTRGH_LVLEN24_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN25_POSITION              0x00000009
#define _ADLVLTRGH_LVLEN25_MASK                  0x00000200
#define _ADLVLTRGH_LVLEN25_LENGTH                0x00000001

#define _ADCORE0L_SAMC_POSITION                  0x00000000
#define _ADCORE0L_SAMC_MASK                      0x000003FF
#define _ADCORE0L_SAMC_LENGTH                    0x0000000A

#define _ADCORE0L_SAMC0_POSITION                 0x00000000
#define _ADCORE0L_SAMC0_MASK                     0x00000001
#define _ADCORE0L_SAMC0_LENGTH                   0x00000001

#define _ADCORE0L_SAMC1_POSITION                 0x00000001
#define _ADCORE0L_SAMC1_MASK                     0x00000002
#define _ADCORE0L_SAMC1_LENGTH                   0x00000001

#define _ADCORE0L_SAMC2_POSITION                 0x00000002
#define _ADCORE0L_SAMC2_MASK                     0x00000004
#define _ADCORE0L_SAMC2_LENGTH                   0x00000001

#define _ADCORE0L_SAMC3_POSITION                 0x00000003
#define _ADCORE0L_SAMC3_MASK                     0x00000008
#define _ADCORE0L_SAMC3_LENGTH                   0x00000001

#define _ADCORE0L_SAMC4_POSITION                 0x00000004
#define _ADCORE0L_SAMC4_MASK                     0x00000010
#define _ADCORE0L_SAMC4_LENGTH                   0x00000001

#define _ADCORE0L_SAMC5_POSITION                 0x00000005
#define _ADCORE0L_SAMC5_MASK                     0x00000020
#define _ADCORE0L_SAMC5_LENGTH                   0x00000001

#define _ADCORE0L_SAMC6_POSITION                 0x00000006
#define _ADCORE0L_SAMC6_MASK                     0x00000040
#define _ADCORE0L_SAMC6_LENGTH                   0x00000001

#define _ADCORE0L_SAMC7_POSITION                 0x00000007
#define _ADCORE0L_SAMC7_MASK                     0x00000080
#define _ADCORE0L_SAMC7_LENGTH                   0x00000001

#define _ADCORE0L_SAMC8_POSITION                 0x00000008
#define _ADCORE0L_SAMC8_MASK                     0x00000100
#define _ADCORE0L_SAMC8_LENGTH                   0x00000001

#define _ADCORE0L_SAMC9_POSITION                 0x00000009
#define _ADCORE0L_SAMC9_MASK                     0x00000200
#define _ADCORE0L_SAMC9_LENGTH                   0x00000001

#define _ADCORE0H_ADCS_POSITION                  0x00000000
#define _ADCORE0H_ADCS_MASK                      0x0000007F
#define _ADCORE0H_ADCS_LENGTH                    0x00000007

#define _ADCORE0H_RES_POSITION                   0x00000008
#define _ADCORE0H_RES_MASK                       0x00000300
#define _ADCORE0H_RES_LENGTH                     0x00000002

#define _ADCORE0H_EISEL_POSITION                 0x0000000A
#define _ADCORE0H_EISEL_MASK                     0x00001C00
#define _ADCORE0H_EISEL_LENGTH                   0x00000003

#define _ADCORE0H_ADCS0_POSITION                 0x00000000
#define _ADCORE0H_ADCS0_MASK                     0x00000001
#define _ADCORE0H_ADCS0_LENGTH                   0x00000001

#define _ADCORE0H_ADCS1_POSITION                 0x00000001
#define _ADCORE0H_ADCS1_MASK                     0x00000002
#define _ADCORE0H_ADCS1_LENGTH                   0x00000001

#define _ADCORE0H_ADCS2_POSITION                 0x00000002
#define _ADCORE0H_ADCS2_MASK                     0x00000004
#define _ADCORE0H_ADCS2_LENGTH                   0x00000001

#define _ADCORE0H_ADCS3_POSITION                 0x00000003
#define _ADCORE0H_ADCS3_MASK                     0x00000008
#define _ADCORE0H_ADCS3_LENGTH                   0x00000001

#define _ADCORE0H_ADCS4_POSITION                 0x00000004
#define _ADCORE0H_ADCS4_MASK                     0x00000010
#define _ADCORE0H_ADCS4_LENGTH                   0x00000001

#define _ADCORE0H_ADCS5_POSITION                 0x00000005
#define _ADCORE0H_ADCS5_MASK                     0x00000020
#define _ADCORE0H_ADCS5_LENGTH                   0x00000001

#define _ADCORE0H_ADCS6_POSITION                 0x00000006
#define _ADCORE0H_ADCS6_MASK                     0x00000040
#define _ADCORE0H_ADCS6_LENGTH                   0x00000001

#define _ADCORE0H_RES0_POSITION                  0x00000008
#define _ADCORE0H_RES0_MASK                      0x00000100
#define _ADCORE0H_RES0_LENGTH                    0x00000001

#define _ADCORE0H_RES1_POSITION                  0x00000009
#define _ADCORE0H_RES1_MASK                      0x00000200
#define _ADCORE0H_RES1_LENGTH                    0x00000001

#define _ADCORE0H_EISEL0_POSITION                0x0000000A
#define _ADCORE0H_EISEL0_MASK                    0x00000400
#define _ADCORE0H_EISEL0_LENGTH                  0x00000001

#define _ADCORE0H_EISEL1_POSITION                0x0000000B
#define _ADCORE0H_EISEL1_MASK                    0x00000800
#define _ADCORE0H_EISEL1_LENGTH                  0x00000001

#define _ADCORE0H_EISEL2_POSITION                0x0000000C
#define _ADCORE0H_EISEL2_MASK                    0x00001000
#define _ADCORE0H_EISEL2_LENGTH                  0x00000001

#define _ADCORE1L_SAMC_POSITION                  0x00000000
#define _ADCORE1L_SAMC_MASK                      0x000003FF
#define _ADCORE1L_SAMC_LENGTH                    0x0000000A

