wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _ADCON5L_C1RDY_POSITION                  0x00000009
#define _ADCON5L_C1RDY_MASK                      0x00000200
#define _ADCON5L_C1RDY_LENGTH                    0x00000001

#define _ADCON5L_SHRRDY_POSITION                 0x0000000F
#define _ADCON5L_SHRRDY_MASK                     0x00008000
#define _ADCON5L_SHRRDY_LENGTH                   0x00000001

#define _ADCON5H_C0CIE_POSITION                  0x00000000
#define _ADCON5H_C0CIE_MASK                      0x00000001
#define _ADCON5H_C0CIE_LENGTH                    0x00000001

#define _ADCON5H_C1CIE_POSITION                  0x00000001
#define _ADCON5H_C1CIE_MASK                      0x00000002
#define _ADCON5H_C1CIE_LENGTH                    0x00000001

#define _ADCON5H_SHRCIE_POSITION                 0x00000007
#define _ADCON5H_SHRCIE_MASK                     0x00000080
#define _ADCON5H_SHRCIE_LENGTH                   0x00000001

#define _ADCON5H_WARMTIME_POSITION               0x00000008
#define _ADCON5H_WARMTIME_MASK                   0x00000F00
#define _ADCON5H_WARMTIME_LENGTH                 0x00000004

#define _ADCON5H_C0C1E_POSITION                  0x00000000
#define _ADCON5H_C0C1E_MASK                      0x00000001
#define _ADCON5H_C0C1E_LENGTH                    0x00000001

#define _ADCON5H_C1C1E_POSITION                  0x00000001
#define _ADCON5H_C1C1E_MASK                      0x00000002
#define _ADCON5H_C1C1E_LENGTH                    0x00000001

#define _DACCTRL1L_FCLKDIV_POSITION              0x00000000
#define _DACCTRL1L_FCLKDIV_MASK                  0x00000007
#define _DACCTRL1L_FCLKDIV_LENGTH                0x00000003

#define _DACCTRL1L_CLKDIV_POSITION               0x00000004
#define _DACCTRL1L_CLKDIV_MASK                   0x00000030
#define _DACCTRL1L_CLKDIV_LENGTH                 0x00000002

#define _DACCTRL1L_CLKSEL_POSITION               0x00000006
#define _DACCTRL1L_CLKSEL_MASK                   0x000000C0
#define _DACCTRL1L_CLKSEL_LENGTH                 0x00000002

#define _DACCTRL1L_DACSIDL_POSITION              0x0000000D
#define _DACCTRL1L_DACSIDL_MASK                  0x00002000
#define _DACCTRL1L_DACSIDL_LENGTH                0x00000001

#define _DACCTRL1L_DACON_POSITION                0x0000000F
#define _DACCTRL1L_DACON_MASK                    0x00008000
#define _DACCTRL1L_DACON_LENGTH                  0x00000001

#define _DACCTRL1L_FCLKDIV0_POSITION             0x00000000
#define _DACCTRL1L_FCLKDIV0_MASK                 0x00000001
#define _DACCTRL1L_FCLKDIV0_LENGTH               0x00000001

#define _DACCTRL1L_FCLKDIV1_POSITION             0x00000001
#define _DACCTRL1L_FCLKDIV1_MASK                 0x00000002
#define _DACCTRL1L_FCLKDIV1_LENGTH               0x00000001

#define _DACCTRL1L_FCLKDIV2_POSITION             0x00000002
#define _DACCTRL1L_FCLKDIV2_MASK                 0x00000004
#define _DACCTRL1L_FCLKDIV2_LENGTH               0x00000001

#define _DACCTRL1L_CLKDIV0_POSITION              0x00000004
#define _DACCTRL1L_CLKDIV0_MASK                  0x00000010
#define _DACCTRL1L_CLKDIV0_LENGTH                0x00000001

#define _DACCTRL1L_CLKDIV1_POSITION              0x00000005
#define _DACCTRL1L_CLKDIV1_MASK                  0x00000020
#define _DACCTRL1L_CLKDIV1_LENGTH                0x00000001

#define _DACCTRL1L_CLKSEL0_POSITION              0x00000006
#define _DACCTRL1L_CLKSEL0_MASK                  0x00000040
#define _DACCTRL1L_CLKSEL0_LENGTH                0x00000001

#define _DACCTRL1L_CLKSEL1_POSITION              0x00000007
#define _DACCTRL1L_CLKSEL1_MASK                  0x00000080
#define _DACCTRL1L_CLKSEL1_LENGTH                0x00000001

#define _DACCTRL2L_TMODTIME_POSITION             0x00000000
#define _DACCTRL2L_TMODTIME_MASK                 0x000003FF
#define _DACCTRL2L_TMODTIME_LENGTH               0x0000000A

#define _DACCTRL2L_TMODTIME0_POSITION            0x00000000
#define _DACCTRL2L_TMODTIME0_MASK                0x00000001
#define _DACCTRL2L_TMODTIME0_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME1_POSITION            0x00000001
#define _DACCTRL2L_TMODTIME1_MASK                0x00000002
#define _DACCTRL2L_TMODTIME1_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME2_POSITION            0x00000002
#define _DACCTRL2L_TMODTIME2_MASK                0x00000004
#define _DACCTRL2L_TMODTIME2_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME3_POSITION            0x00000003
#define _DACCTRL2L_TMODTIME3_MASK                0x00000008
#define _DACCTRL2L_TMODTIME3_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME4_POSITION            0x00000004
#define _DACCTRL2L_TMODTIME4_MASK                0x00000010
#define _DACCTRL2L_TMODTIME4_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME5_POSITION            0x00000005
#define _DACCTRL2L_TMODTIME5_MASK                0x00000020
#define _DACCTRL2L_TMODTIME5_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME6_POSITION            0x00000006
#define _DACCTRL2L_TMODTIME6_MASK                0x00000040
#define _DACCTRL2L_TMODTIME6_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME7_POSITION            0x00000007
#define _DACCTRL2L_TMODTIME7_MASK                0x00000080
#define _DACCTRL2L_TMODTIME7_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME8_POSITION            0x00000008
#define _DACCTRL2L_TMODTIME8_MASK                0x00000100
#define _DACCTRL2L_TMODTIME8_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME9_POSITION            0x00000009
#define _DACCTRL2L_TMODTIME9_MASK                0x00000200
#define _DACCTRL2L_TMODTIME9_LENGTH              0x00000001

#define _DACCTRL2H_SSTIME_POSITION               0x00000000
#define _DACCTRL2H_SSTIME_MASK                   0x000003FF
#define _DACCTRL2H_SSTIME_LENGTH                 0x0000000A

#define _DACCTRL2H_SSTIME0_POSITION              0x00000000
#define _DACCTRL2H_SSTIME0_MASK                  0x00000001
#define _DACCTRL2H_SSTIME0_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME1_POSITION              0x00000001
#define _DACCTRL2H_SSTIME1_MASK                  0x00000002
#define _DACCTRL2H_SSTIME1_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME2_POSITION              0x00000002
#define _DACCTRL2H_SSTIME2_MASK                  0x00000004
#define _DACCTRL2H_SSTIME2_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME3_POSITION              0x00000003
#define _DACCTRL2H_SSTIME3_MASK                  0x00000008
#define _DACCTRL2H_SSTIME3_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME4_POSITION              0x00000004
#define _DACCTRL2H_SSTIME4_MASK                  0x00000010
#define _DACCTRL2H_SSTIME4_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME5_POSITION              0x00000005
#define _DACCTRL2H_SSTIME5_MASK                  0x00000020
#define _DACCTRL2H_SSTIME5_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME6_POSITION              0x00000006
#define _DACCTRL2H_SSTIME6_MASK                  0x00000040
#define _DACCTRL2H_SSTIME6_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME7_POSITION              0x00000007
#define _DACCTRL2H_SSTIME7_MASK                  0x00000080
#define _DACCTRL2H_SSTIME7_LENGTH                0x00000001

