wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _DACCTRL2H_SSTIME8_POSITION              0x00000008
#define _DACCTRL2H_SSTIME8_MASK                  0x00000100
#define _DACCTRL2H_SSTIME8_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME9_POSITION              0x00000009
#define _DACCTRL2H_SSTIME9_MASK                  0x00000200
#define _DACCTRL2H_SSTIME9_LENGTH                0x00000001

#define _DAC1CONL_HYSSEL_POSITION                0x00000000
#define _DAC1CONL_HYSSEL_MASK                    0x00000003
#define _DAC1CONL_HYSSEL_LENGTH                  0x00000002

#define _DAC1CONL_HYSPOL_POSITION                0x00000002
#define _DAC1CONL_HYSPOL_MASK                    0x00000004
#define _DAC1CONL_HYSPOL_LENGTH                  0x00000001

#define _DAC1CONL_INSEL_POSITION                 0x00000003
#define _DAC1CONL_INSEL_MASK                     0x00000038
#define _DAC1CONL_INSEL_LENGTH                   0x00000003

#define _DAC1CONL_CMPPOL_POSITION                0x00000006
#define _DAC1CONL_CMPPOL_MASK                    0x00000040
#define _DAC1CONL_CMPPOL_LENGTH                  0x00000001

#define _DAC1CONL_CMPSTAT_POSITION               0x00000007
#define _DAC1CONL_CMPSTAT_MASK                   0x00000080
#define _DAC1CONL_CMPSTAT_LENGTH                 0x00000001

#define _DAC1CONL_FLTREN_POSITION                0x00000008
#define _DAC1CONL_FLTREN_MASK                    0x00000100
#define _DAC1CONL_FLTREN_LENGTH                  0x00000001

#define _DAC1CONL_DACOEN_POSITION                0x00000009
#define _DAC1CONL_DACOEN_MASK                    0x00000200
#define _DAC1CONL_DACOEN_LENGTH                  0x00000001

#define _DAC1CONL_CBE_POSITION                   0x0000000A
#define _DAC1CONL_CBE_MASK                       0x00000400
#define _DAC1CONL_CBE_LENGTH                     0x00000001

#define _DAC1CONL_IRQM_POSITION                  0x0000000D
#define _DAC1CONL_IRQM_MASK                      0x00006000
#define _DAC1CONL_IRQM_LENGTH                    0x00000002

#define _DAC1CONL_DACEN_POSITION                 0x0000000F
#define _DAC1CONL_DACEN_MASK                     0x00008000
#define _DAC1CONL_DACEN_LENGTH                   0x00000001

#define _DAC1CONL_HYSSEL0_POSITION               0x00000000
#define _DAC1CONL_HYSSEL0_MASK                   0x00000001
#define _DAC1CONL_HYSSEL0_LENGTH                 0x00000001

#define _DAC1CONL_HYSSEL1_POSITION               0x00000001
#define _DAC1CONL_HYSSEL1_MASK                   0x00000002
#define _DAC1CONL_HYSSEL1_LENGTH                 0x00000001

#define _DAC1CONL_IRQM0_POSITION                 0x0000000D
#define _DAC1CONL_IRQM0_MASK                     0x00002000
#define _DAC1CONL_IRQM0_LENGTH                   0x00000001

#define _DAC1CONL_IRQM1_POSITION                 0x0000000E
#define _DAC1CONL_IRQM1_MASK                     0x00004000
#define _DAC1CONL_IRQM1_LENGTH                   0x00000001

#define _DAC1CONH_TMCB_POSITION                  0x00000000
#define _DAC1CONH_TMCB_MASK                      0x000003FF
#define _DAC1CONH_TMCB_LENGTH                    0x0000000A

#define _DAC1CONH_TMCB0_POSITION                 0x00000000
#define _DAC1CONH_TMCB0_MASK                     0x00000001
#define _DAC1CONH_TMCB0_LENGTH                   0x00000001

#define _DAC1CONH_TMCB1_POSITION                 0x00000001
#define _DAC1CONH_TMCB1_MASK                     0x00000002
#define _DAC1CONH_TMCB1_LENGTH                   0x00000001

#define _DAC1CONH_TMCB2_POSITION                 0x00000002
#define _DAC1CONH_TMCB2_MASK                     0x00000004
#define _DAC1CONH_TMCB2_LENGTH                   0x00000001

#define _DAC1CONH_TMCB3_POSITION                 0x00000003
#define _DAC1CONH_TMCB3_MASK                     0x00000008
#define _DAC1CONH_TMCB3_LENGTH                   0x00000001

#define _DAC1CONH_TMCB4_POSITION                 0x00000004
#define _DAC1CONH_TMCB4_MASK                     0x00000010
#define _DAC1CONH_TMCB4_LENGTH                   0x00000001

#define _DAC1CONH_TMCB5_POSITION                 0x00000005
#define _DAC1CONH_TMCB5_MASK                     0x00000020
#define _DAC1CONH_TMCB5_LENGTH                   0x00000001

#define _DAC1CONH_TMCB6_POSITION                 0x00000006
#define _DAC1CONH_TMCB6_MASK                     0x00000040
#define _DAC1CONH_TMCB6_LENGTH                   0x00000001

#define _DAC1CONH_TMCB7_POSITION                 0x00000007
#define _DAC1CONH_TMCB7_MASK                     0x00000080
#define _DAC1CONH_TMCB7_LENGTH                   0x00000001

#define _DAC1CONH_TMCB8_POSITION                 0x00000008
#define _DAC1CONH_TMCB8_MASK                     0x00000100
#define _DAC1CONH_TMCB8_LENGTH                   0x00000001

#define _DAC1CONH_TMCB9_POSITION                 0x00000009
#define _DAC1CONH_TMCB9_MASK                     0x00000200
#define _DAC1CONH_TMCB9_LENGTH                   0x00000001

#define _DAC1DATL_DACDATL_POSITION               0x00000000
#define _DAC1DATL_DACDATL_MASK                   0x0000FFFF
#define _DAC1DATL_DACDATL_LENGTH                 0x00000010

#define _DAC1DATL_DACDATL0_POSITION              0x00000000
#define _DAC1DATL_DACDATL0_MASK                  0x00000001
#define _DAC1DATL_DACDATL0_LENGTH                0x00000001

#define _DAC1DATL_DACDATL1_POSITION              0x00000001
#define _DAC1DATL_DACDATL1_MASK                  0x00000002
#define _DAC1DATL_DACDATL1_LENGTH                0x00000001

#define _DAC1DATL_DACDATL2_POSITION              0x00000002
#define _DAC1DATL_DACDATL2_MASK                  0x00000004
#define _DAC1DATL_DACDATL2_LENGTH                0x00000001

#define _DAC1DATL_DACDATL3_POSITION              0x00000003
#define _DAC1DATL_DACDATL3_MASK                  0x00000008
#define _DAC1DATL_DACDATL3_LENGTH                0x00000001

#define _DAC1DATL_DACDATL4_POSITION              0x00000004
#define _DAC1DATL_DACDATL4_MASK                  0x00000010
#define _DAC1DATL_DACDATL4_LENGTH                0x00000001

#define _DAC1DATL_DACDATL5_POSITION              0x00000005
#define _DAC1DATL_DACDATL5_MASK                  0x00000020
#define _DAC1DATL_DACDATL5_LENGTH                0x00000001

