wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _DAC1DATL_DACDATL6_POSITION              0x00000006
#define _DAC1DATL_DACDATL6_MASK                  0x00000040
#define _DAC1DATL_DACDATL6_LENGTH                0x00000001

#define _DAC1DATL_DACDATL7_POSITION              0x00000007
#define _DAC1DATL_DACDATL7_MASK                  0x00000080
#define _DAC1DATL_DACDATL7_LENGTH                0x00000001

#define _DAC1DATL_DACDATL8_POSITION              0x00000008
#define _DAC1DATL_DACDATL8_MASK                  0x00000100
#define _DAC1DATL_DACDATL8_LENGTH                0x00000001

#define _DAC1DATL_DACDATL9_POSITION              0x00000009
#define _DAC1DATL_DACDATL9_MASK                  0x00000200
#define _DAC1DATL_DACDATL9_LENGTH                0x00000001

#define _DAC1DATL_DACDATL10_POSITION             0x0000000A
#define _DAC1DATL_DACDATL10_MASK                 0x00000400
#define _DAC1DATL_DACDATL10_LENGTH               0x00000001

#define _DAC1DATL_DACDATL11_POSITION             0x0000000B
#define _DAC1DATL_DACDATL11_MASK                 0x00000800
#define _DAC1DATL_DACDATL11_LENGTH               0x00000001

#define _DAC1DATL_DACDATL12_POSITION             0x0000000C
#define _DAC1DATL_DACDATL12_MASK                 0x00001000
#define _DAC1DATL_DACDATL12_LENGTH               0x00000001

#define _DAC1DATL_DACDATL13_POSITION             0x0000000D
#define _DAC1DATL_DACDATL13_MASK                 0x00002000
#define _DAC1DATL_DACDATL13_LENGTH               0x00000001

#define _DAC1DATL_DACDATL14_POSITION             0x0000000E
#define _DAC1DATL_DACDATL14_MASK                 0x00004000
#define _DAC1DATL_DACDATL14_LENGTH               0x00000001

#define _DAC1DATL_DACDATL15_POSITION             0x0000000F
#define _DAC1DATL_DACDATL15_MASK                 0x00008000
#define _DAC1DATL_DACDATL15_LENGTH               0x00000001

#define _DAC1DATH_DACDATH_POSITION               0x00000000
#define _DAC1DATH_DACDATH_MASK                   0x0000FFFF
#define _DAC1DATH_DACDATH_LENGTH                 0x00000010

#define _DAC1DATH_DACDATH0_POSITION              0x00000000
#define _DAC1DATH_DACDATH0_MASK                  0x00000001
#define _DAC1DATH_DACDATH0_LENGTH                0x00000001

#define _DAC1DATH_DACDATH1_POSITION              0x00000001
#define _DAC1DATH_DACDATH1_MASK                  0x00000002
#define _DAC1DATH_DACDATH1_LENGTH                0x00000001

#define _DAC1DATH_DACDATH2_POSITION              0x00000002
#define _DAC1DATH_DACDATH2_MASK                  0x00000004
#define _DAC1DATH_DACDATH2_LENGTH                0x00000001

#define _DAC1DATH_DACDATH3_POSITION              0x00000003
#define _DAC1DATH_DACDATH3_MASK                  0x00000008
#define _DAC1DATH_DACDATH3_LENGTH                0x00000001

#define _DAC1DATH_DACDATH4_POSITION              0x00000004
#define _DAC1DATH_DACDATH4_MASK                  0x00000010
#define _DAC1DATH_DACDATH4_LENGTH                0x00000001

#define _DAC1DATH_DACDATH5_POSITION              0x00000005
#define _DAC1DATH_DACDATH5_MASK                  0x00000020
#define _DAC1DATH_DACDATH5_LENGTH                0x00000001

#define _DAC1DATH_DACDATH6_POSITION              0x00000006
#define _DAC1DATH_DACDATH6_MASK                  0x00000040
#define _DAC1DATH_DACDATH6_LENGTH                0x00000001

#define _DAC1DATH_DACDATH7_POSITION              0x00000007
#define _DAC1DATH_DACDATH7_MASK                  0x00000080
#define _DAC1DATH_DACDATH7_LENGTH                0x00000001

#define _DAC1DATH_DACDATH8_POSITION              0x00000008
#define _DAC1DATH_DACDATH8_MASK                  0x00000100
#define _DAC1DATH_DACDATH8_LENGTH                0x00000001

#define _DAC1DATH_DACDATH9_POSITION              0x00000009
#define _DAC1DATH_DACDATH9_MASK                  0x00000200
#define _DAC1DATH_DACDATH9_LENGTH                0x00000001

#define _DAC1DATH_DACDATH10_POSITION             0x0000000A
#define _DAC1DATH_DACDATH10_MASK                 0x00000400
#define _DAC1DATH_DACDATH10_LENGTH               0x00000001

#define _DAC1DATH_DACDATH11_POSITION             0x0000000B
#define _DAC1DATH_DACDATH11_MASK                 0x00000800
#define _DAC1DATH_DACDATH11_LENGTH               0x00000001

#define _DAC1DATH_DACDATH12_POSITION             0x0000000C
#define _DAC1DATH_DACDATH12_MASK                 0x00001000
#define _DAC1DATH_DACDATH12_LENGTH               0x00000001

#define _DAC1DATH_DACDATH13_POSITION             0x0000000D
#define _DAC1DATH_DACDATH13_MASK                 0x00002000
#define _DAC1DATH_DACDATH13_LENGTH               0x00000001

#define _DAC1DATH_DACDATH14_POSITION             0x0000000E
#define _DAC1DATH_DACDATH14_MASK                 0x00004000
#define _DAC1DATH_DACDATH14_LENGTH               0x00000001

#define _DAC1DATH_DACDATH15_POSITION             0x0000000F
#define _DAC1DATH_DACDATH15_MASK                 0x00008000
#define _DAC1DATH_DACDATH15_LENGTH               0x00000001

#define _SLP1CONL_SLPSTRT_POSITION               0x00000000
#define _SLP1CONL_SLPSTRT_MASK                   0x0000000F
#define _SLP1CONL_SLPSTRT_LENGTH                 0x00000004

#define _SLP1CONL_SLPSTOPB_POSITION              0x00000004
#define _SLP1CONL_SLPSTOPB_MASK                  0x000000F0
#define _SLP1CONL_SLPSTOPB_LENGTH                0x00000004

#define _SLP1CONL_SLPSTOPA_POSITION              0x00000008
#define _SLP1CONL_SLPSTOPA_MASK                  0x00000F00
#define _SLP1CONL_SLPSTOPA_LENGTH                0x00000004

#define _SLP1CONL_HCFSEL_POSITION                0x0000000C
#define _SLP1CONL_HCFSEL_MASK                    0x0000F000
#define _SLP1CONL_HCFSEL_LENGTH                  0x00000004

#define _SLP1CONL_SLPSTRT0_POSITION              0x00000000
#define _SLP1CONL_SLPSTRT0_MASK                  0x00000001
#define _SLP1CONL_SLPSTRT0_LENGTH                0x00000001

#define _SLP1CONL_SLPSTRT1_POSITION              0x00000001
#define _SLP1CONL_SLPSTRT1_MASK                  0x00000002
#define _SLP1CONL_SLPSTRT1_LENGTH                0x00000001

#define _SLP1CONL_SLPSTRT2_POSITION              0x00000002
#define _SLP1CONL_SLPSTRT2_MASK                  0x00000004
#define _SLP1CONL_SLPSTRT2_LENGTH                0x00000001

#define _SLP1CONL_SLPSTRT3_POSITION              0x00000003
#define _SLP1CONL_SLPSTRT3_MASK                  0x00000008
#define _SLP1CONL_SLPSTRT3_LENGTH                0x00000001

#define _SLP1CONL_SLPSTOPB0_POSITION             0x00000004
#define _SLP1CONL_SLPSTOPB0_MASK                 0x00000010
#define _SLP1CONL_SLPSTOPB0_LENGTH               0x00000001

