wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _DAC3DATH_DACDATH11_POSITION             0x0000000B
#define _DAC3DATH_DACDATH11_MASK                 0x00000800
#define _DAC3DATH_DACDATH11_LENGTH               0x00000001

#define _DAC3DATH_DACDATH12_POSITION             0x0000000C
#define _DAC3DATH_DACDATH12_MASK                 0x00001000
#define _DAC3DATH_DACDATH12_LENGTH               0x00000001

#define _DAC3DATH_DACDATH13_POSITION             0x0000000D
#define _DAC3DATH_DACDATH13_MASK                 0x00002000
#define _DAC3DATH_DACDATH13_LENGTH               0x00000001

#define _DAC3DATH_DACDATH14_POSITION             0x0000000E
#define _DAC3DATH_DACDATH14_MASK                 0x00004000
#define _DAC3DATH_DACDATH14_LENGTH               0x00000001

#define _DAC3DATH_DACDATH15_POSITION             0x0000000F
#define _DAC3DATH_DACDATH15_MASK                 0x00008000
#define _DAC3DATH_DACDATH15_LENGTH               0x00000001

#define _SLP3CONL_SLPSTRT_POSITION               0x00000000
#define _SLP3CONL_SLPSTRT_MASK                   0x0000000F
#define _SLP3CONL_SLPSTRT_LENGTH                 0x00000004

#define _SLP3CONL_SLPSTOPB_POSITION              0x00000004
#define _SLP3CONL_SLPSTOPB_MASK                  0x000000F0
#define _SLP3CONL_SLPSTOPB_LENGTH                0x00000004

#define _SLP3CONL_SLPSTOPA_POSITION              0x00000008
#define _SLP3CONL_SLPSTOPA_MASK                  0x00000F00
#define _SLP3CONL_SLPSTOPA_LENGTH                0x00000004

#define _SLP3CONL_HCFSEL_POSITION                0x0000000C
#define _SLP3CONL_HCFSEL_MASK                    0x0000F000
#define _SLP3CONL_HCFSEL_LENGTH                  0x00000004

#define _SLP3CONL_SLPSTRT0_POSITION              0x00000000
#define _SLP3CONL_SLPSTRT0_MASK                  0x00000001
#define _SLP3CONL_SLPSTRT0_LENGTH                0x00000001

#define _SLP3CONL_SLPSTRT1_POSITION              0x00000001
#define _SLP3CONL_SLPSTRT1_MASK                  0x00000002
#define _SLP3CONL_SLPSTRT1_LENGTH                0x00000001

#define _SLP3CONL_SLPSTRT2_POSITION              0x00000002
#define _SLP3CONL_SLPSTRT2_MASK                  0x00000004
#define _SLP3CONL_SLPSTRT2_LENGTH                0x00000001

#define _SLP3CONL_SLPSTRT3_POSITION              0x00000003
#define _SLP3CONL_SLPSTRT3_MASK                  0x00000008
#define _SLP3CONL_SLPSTRT3_LENGTH                0x00000001

#define _SLP3CONL_SLPSTOPB0_POSITION             0x00000004
#define _SLP3CONL_SLPSTOPB0_MASK                 0x00000010
#define _SLP3CONL_SLPSTOPB0_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPB1_POSITION             0x00000005
#define _SLP3CONL_SLPSTOPB1_MASK                 0x00000020
#define _SLP3CONL_SLPSTOPB1_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPB2_POSITION             0x00000006
#define _SLP3CONL_SLPSTOPB2_MASK                 0x00000040
#define _SLP3CONL_SLPSTOPB2_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPB3_POSITION             0x00000007
#define _SLP3CONL_SLPSTOPB3_MASK                 0x00000080
#define _SLP3CONL_SLPSTOPB3_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA0_POSITION             0x00000008
#define _SLP3CONL_SLPSTOPA0_MASK                 0x00000100
#define _SLP3CONL_SLPSTOPA0_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA1_POSITION             0x00000009
#define _SLP3CONL_SLPSTOPA1_MASK                 0x00000200
#define _SLP3CONL_SLPSTOPA1_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA2_POSITION             0x0000000A
#define _SLP3CONL_SLPSTOPA2_MASK                 0x00000400
#define _SLP3CONL_SLPSTOPA2_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA3_POSITION             0x0000000B
#define _SLP3CONL_SLPSTOPA3_MASK                 0x00000800
#define _SLP3CONL_SLPSTOPA3_LENGTH               0x00000001

#define _SLP3CONL_HCFSEL0_POSITION               0x0000000C
#define _SLP3CONL_HCFSEL0_MASK                   0x00001000
#define _SLP3CONL_HCFSEL0_LENGTH                 0x00000001

#define _SLP3CONL_HCFSEL1_POSITION               0x0000000D
#define _SLP3CONL_HCFSEL1_MASK                   0x00002000
#define _SLP3CONL_HCFSEL1_LENGTH                 0x00000001

#define _SLP3CONL_HCFSEL2_POSITION               0x0000000E
#define _SLP3CONL_HCFSEL2_MASK                   0x00004000
#define _SLP3CONL_HCFSEL2_LENGTH                 0x00000001

#define _SLP3CONL_HCFSEL3_POSITION               0x0000000F
#define _SLP3CONL_HCFSEL3_MASK                   0x00008000
#define _SLP3CONL_HCFSEL3_LENGTH                 0x00000001

#define _SLP3CONH_PSE_POSITION                   0x00000009
#define _SLP3CONH_PSE_MASK                       0x00000200
#define _SLP3CONH_PSE_LENGTH                     0x00000001

#define _SLP3CONH_TWME_POSITION                  0x0000000A
#define _SLP3CONH_TWME_MASK                      0x00000400
#define _SLP3CONH_TWME_LENGTH                    0x00000001

#define _SLP3CONH_HME_POSITION                   0x0000000B
#define _SLP3CONH_HME_MASK                       0x00000800
#define _SLP3CONH_HME_LENGTH                     0x00000001

#define _SLP3CONH_SLOPEN_POSITION                0x0000000F
#define _SLP3CONH_SLOPEN_MASK                    0x00008000
#define _SLP3CONH_SLOPEN_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT_POSITION                 0x00000000
#define _SLP3DAT_SLPDAT_MASK                     0x0000FFFF
#define _SLP3DAT_SLPDAT_LENGTH                   0x00000010

#define _SLP3DAT_SLPDAT0_POSITION                0x00000000
#define _SLP3DAT_SLPDAT0_MASK                    0x00000001
#define _SLP3DAT_SLPDAT0_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT1_POSITION                0x00000001
#define _SLP3DAT_SLPDAT1_MASK                    0x00000002
#define _SLP3DAT_SLPDAT1_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT2_POSITION                0x00000002
#define _SLP3DAT_SLPDAT2_MASK                    0x00000004
#define _SLP3DAT_SLPDAT2_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT3_POSITION                0x00000003
#define _SLP3DAT_SLPDAT3_MASK                    0x00000008
#define _SLP3DAT_SLPDAT3_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT4_POSITION                0x00000004
#define _SLP3DAT_SLPDAT4_MASK                    0x00000010
#define _SLP3DAT_SLPDAT4_LENGTH                  0x00000001

