wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _SLP3DAT_SLPDAT5_POSITION                0x00000005
#define _SLP3DAT_SLPDAT5_MASK                    0x00000020
#define _SLP3DAT_SLPDAT5_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT6_POSITION                0x00000006
#define _SLP3DAT_SLPDAT6_MASK                    0x00000040
#define _SLP3DAT_SLPDAT6_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT7_POSITION                0x00000007
#define _SLP3DAT_SLPDAT7_MASK                    0x00000080
#define _SLP3DAT_SLPDAT7_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT8_POSITION                0x00000008
#define _SLP3DAT_SLPDAT8_MASK                    0x00000100
#define _SLP3DAT_SLPDAT8_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT9_POSITION                0x00000009
#define _SLP3DAT_SLPDAT9_MASK                    0x00000200
#define _SLP3DAT_SLPDAT9_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT10_POSITION               0x0000000A
#define _SLP3DAT_SLPDAT10_MASK                   0x00000400
#define _SLP3DAT_SLPDAT10_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT11_POSITION               0x0000000B
#define _SLP3DAT_SLPDAT11_MASK                   0x00000800
#define _SLP3DAT_SLPDAT11_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT12_POSITION               0x0000000C
#define _SLP3DAT_SLPDAT12_MASK                   0x00001000
#define _SLP3DAT_SLPDAT12_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT13_POSITION               0x0000000D
#define _SLP3DAT_SLPDAT13_MASK                   0x00002000
#define _SLP3DAT_SLPDAT13_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT14_POSITION               0x0000000E
#define _SLP3DAT_SLPDAT14_MASK                   0x00004000
#define _SLP3DAT_SLPDAT14_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT15_POSITION               0x0000000F
#define _SLP3DAT_SLPDAT15_MASK                   0x00008000
#define _SLP3DAT_SLPDAT15_LENGTH                 0x00000001

#define _VREGCON_VREG1OV_POSITION                0x00000000
#define _VREGCON_VREG1OV_MASK                    0x00000003
#define _VREGCON_VREG1OV_LENGTH                  0x00000002

#define _VREGCON_VREG2OV_POSITION                0x00000002
#define _VREGCON_VREG2OV_MASK                    0x0000000C
#define _VREGCON_VREG2OV_LENGTH                  0x00000002

#define _VREGCON_VREG3OV_POSITION                0x00000004
#define _VREGCON_VREG3OV_MASK                    0x00000030
#define _VREGCON_VREG3OV_LENGTH                  0x00000002

#define _VREGCON_LPWREN_POSITION                 0x0000000F
#define _VREGCON_LPWREN_MASK                     0x00008000
#define _VREGCON_LPWREN_LENGTH                   0x00000001

#define _RPCON_IOLOCK_POSITION                   0x0000000B
#define _RPCON_IOLOCK_MASK                       0x00000800
#define _RPCON_IOLOCK_LENGTH                     0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x0000FF00
#define _RPINR0_INT1R_LENGTH                     0x00000008

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x000000FF
#define _RPINR1_INT2R_LENGTH                     0x00000008

#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x0000FF00
#define _RPINR1_INT3R_LENGTH                     0x00000008

#define _RPINR2_T1CKR_POSITION                   0x00000008
#define _RPINR2_T1CKR_MASK                       0x0000FF00
#define _RPINR2_T1CKR_LENGTH                     0x00000008

#define _RPINR3_TCKI1R_POSITION                  0x00000000
#define _RPINR3_TCKI1R_MASK                      0x000000FF
#define _RPINR3_TCKI1R_LENGTH                    0x00000008

#define _RPINR3_ICM1R_POSITION                   0x00000008
#define _RPINR3_ICM1R_MASK                       0x0000FF00
#define _RPINR3_ICM1R_LENGTH                     0x00000008

#define _RPINR4_TCKI2R_POSITION                  0x00000000
#define _RPINR4_TCKI2R_MASK                      0x000000FF
#define _RPINR4_TCKI2R_LENGTH                    0x00000008

#define _RPINR4_ICM2R_POSITION                   0x00000008
#define _RPINR4_ICM2R_MASK                       0x0000FF00
#define _RPINR4_ICM2R_LENGTH                     0x00000008

#define _RPINR5_TCKI3R_POSITION                  0x00000000
#define _RPINR5_TCKI3R_MASK                      0x000000FF
#define _RPINR5_TCKI3R_LENGTH                    0x00000008

#define _RPINR5_ICM3R_POSITION                   0x00000008
#define _RPINR5_ICM3R_MASK                       0x0000FF00
#define _RPINR5_ICM3R_LENGTH                     0x00000008

#define _RPINR6_TCKI4R_POSITION                  0x00000000
#define _RPINR6_TCKI4R_MASK                      0x000000FF
#define _RPINR6_TCKI4R_LENGTH                    0x00000008

#define _RPINR6_ICM4R_POSITION                   0x00000008
#define _RPINR6_ICM4R_MASK                       0x0000FF00
#define _RPINR6_ICM4R_LENGTH                     0x00000008

#define _RPINR7_TCKI5R_POSITION                  0x00000000
#define _RPINR7_TCKI5R_MASK                      0x000000FF
#define _RPINR7_TCKI5R_LENGTH                    0x00000008

#define _RPINR7_ICM5R_POSITION                   0x00000008
#define _RPINR7_ICM5R_MASK                       0x0000FF00
#define _RPINR7_ICM5R_LENGTH                     0x00000008

#define _RPINR8_TCKI6R_POSITION                  0x00000000
#define _RPINR8_TCKI6R_MASK                      0x000000FF
#define _RPINR8_TCKI6R_LENGTH                    0x00000008

#define _RPINR8_ICM6R_POSITION                   0x00000008
#define _RPINR8_ICM6R_MASK                       0x0000FF00
#define _RPINR8_ICM6R_LENGTH                     0x00000008

#define _RPINR9_TCKI7R_POSITION                  0x00000000
#define _RPINR9_TCKI7R_MASK                      0x000000FF
#define _RPINR9_TCKI7R_LENGTH                    0x00000008

#define _RPINR9_ICM7R_POSITION                   0x00000008
#define _RPINR9_ICM7R_MASK                       0x0000FF00
#define _RPINR9_ICM7R_LENGTH                     0x00000008

