wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _CNEN0B_CNEN0B7_POSITION                 0x00000007
#define _CNEN0B_CNEN0B7_MASK                     0x00000080
#define _CNEN0B_CNEN0B7_LENGTH                   0x00000001

#define _CNEN0B_CNEN0B8_POSITION                 0x00000008
#define _CNEN0B_CNEN0B8_MASK                     0x00000100
#define _CNEN0B_CNEN0B8_LENGTH                   0x00000001

#define _CNEN0B_CNEN0B9_POSITION                 0x00000009
#define _CNEN0B_CNEN0B9_MASK                     0x00000200
#define _CNEN0B_CNEN0B9_LENGTH                   0x00000001

#define _CNEN0B_CNEN0B10_POSITION                0x0000000A
#define _CNEN0B_CNEN0B10_MASK                    0x00000400
#define _CNEN0B_CNEN0B10_LENGTH                  0x00000001

#define _CNEN0B_CNEN0B11_POSITION                0x0000000B
#define _CNEN0B_CNEN0B11_MASK                    0x00000800
#define _CNEN0B_CNEN0B11_LENGTH                  0x00000001

#define _CNEN0B_CNEN0B12_POSITION                0x0000000C
#define _CNEN0B_CNEN0B12_MASK                    0x00001000
#define _CNEN0B_CNEN0B12_LENGTH                  0x00000001

#define _CNEN0B_CNEN0B13_POSITION                0x0000000D
#define _CNEN0B_CNEN0B13_MASK                    0x00002000
#define _CNEN0B_CNEN0B13_LENGTH                  0x00000001

#define _CNEN0B_CNEN0B14_POSITION                0x0000000E
#define _CNEN0B_CNEN0B14_MASK                    0x00004000
#define _CNEN0B_CNEN0B14_LENGTH                  0x00000001

#define _CNEN0B_CNEN0B15_POSITION                0x0000000F
#define _CNEN0B_CNEN0B15_MASK                    0x00008000
#define _CNEN0B_CNEN0B15_LENGTH                  0x00000001

#define _CNSTATB_CNSTATB0_POSITION               0x00000000
#define _CNSTATB_CNSTATB0_MASK                   0x00000001
#define _CNSTATB_CNSTATB0_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB1_POSITION               0x00000001
#define _CNSTATB_CNSTATB1_MASK                   0x00000002
#define _CNSTATB_CNSTATB1_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB2_POSITION               0x00000002
#define _CNSTATB_CNSTATB2_MASK                   0x00000004
#define _CNSTATB_CNSTATB2_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB3_POSITION               0x00000003
#define _CNSTATB_CNSTATB3_MASK                   0x00000008
#define _CNSTATB_CNSTATB3_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB4_POSITION               0x00000004
#define _CNSTATB_CNSTATB4_MASK                   0x00000010
#define _CNSTATB_CNSTATB4_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB5_POSITION               0x00000005
#define _CNSTATB_CNSTATB5_MASK                   0x00000020
#define _CNSTATB_CNSTATB5_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB6_POSITION               0x00000006
#define _CNSTATB_CNSTATB6_MASK                   0x00000040
#define _CNSTATB_CNSTATB6_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB7_POSITION               0x00000007
#define _CNSTATB_CNSTATB7_MASK                   0x00000080
#define _CNSTATB_CNSTATB7_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB8_POSITION               0x00000008
#define _CNSTATB_CNSTATB8_MASK                   0x00000100
#define _CNSTATB_CNSTATB8_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB9_POSITION               0x00000009
#define _CNSTATB_CNSTATB9_MASK                   0x00000200
#define _CNSTATB_CNSTATB9_LENGTH                 0x00000001

#define _CNSTATB_CNSTATB10_POSITION              0x0000000A
#define _CNSTATB_CNSTATB10_MASK                  0x00000400
#define _CNSTATB_CNSTATB10_LENGTH                0x00000001

#define _CNSTATB_CNSTATB11_POSITION              0x0000000B
#define _CNSTATB_CNSTATB11_MASK                  0x00000800
#define _CNSTATB_CNSTATB11_LENGTH                0x00000001

#define _CNSTATB_CNSTATB12_POSITION              0x0000000C
#define _CNSTATB_CNSTATB12_MASK                  0x00001000
#define _CNSTATB_CNSTATB12_LENGTH                0x00000001

#define _CNSTATB_CNSTATB13_POSITION              0x0000000D
#define _CNSTATB_CNSTATB13_MASK                  0x00002000
#define _CNSTATB_CNSTATB13_LENGTH                0x00000001

#define _CNSTATB_CNSTATB14_POSITION              0x0000000E
#define _CNSTATB_CNSTATB14_MASK                  0x00004000
#define _CNSTATB_CNSTATB14_LENGTH                0x00000001

#define _CNSTATB_CNSTATB15_POSITION              0x0000000F
#define _CNSTATB_CNSTATB15_MASK                  0x00008000
#define _CNSTATB_CNSTATB15_LENGTH                0x00000001

#define _CNEN1B_CNEN1B0_POSITION                 0x00000000
#define _CNEN1B_CNEN1B0_MASK                     0x00000001
#define _CNEN1B_CNEN1B0_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B1_POSITION                 0x00000001
#define _CNEN1B_CNEN1B1_MASK                     0x00000002
#define _CNEN1B_CNEN1B1_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B2_POSITION                 0x00000002
#define _CNEN1B_CNEN1B2_MASK                     0x00000004
#define _CNEN1B_CNEN1B2_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B3_POSITION                 0x00000003
#define _CNEN1B_CNEN1B3_MASK                     0x00000008
#define _CNEN1B_CNEN1B3_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B4_POSITION                 0x00000004
#define _CNEN1B_CNEN1B4_MASK                     0x00000010
#define _CNEN1B_CNEN1B4_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B5_POSITION                 0x00000005
#define _CNEN1B_CNEN1B5_MASK                     0x00000020
#define _CNEN1B_CNEN1B5_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B6_POSITION                 0x00000006
#define _CNEN1B_CNEN1B6_MASK                     0x00000040
#define _CNEN1B_CNEN1B6_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B7_POSITION                 0x00000007
#define _CNEN1B_CNEN1B7_MASK                     0x00000080
#define _CNEN1B_CNEN1B7_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B8_POSITION                 0x00000008
#define _CNEN1B_CNEN1B8_MASK                     0x00000100
#define _CNEN1B_CNEN1B8_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B9_POSITION                 0x00000009
#define _CNEN1B_CNEN1B9_MASK                     0x00000200
#define _CNEN1B_CNEN1B9_LENGTH                   0x00000001

#define _CNEN1B_CNEN1B10_POSITION                0x0000000A
#define _CNEN1B_CNEN1B10_MASK                    0x00000400
#define _CNEN1B_CNEN1B10_LENGTH                  0x00000001

#define _CNEN1B_CNEN1B11_POSITION                0x0000000B
#define _CNEN1B_CNEN1B11_MASK                    0x00000800
#define _CNEN1B_CNEN1B11_LENGTH                  0x00000001

#define _CNEN1B_CNEN1B12_POSITION                0x0000000C
#define _CNEN1B_CNEN1B12_MASK                    0x00001000
#define _CNEN1B_CNEN1B12_LENGTH                  0x00000001

#define _CNEN1B_CNEN1B13_POSITION                0x0000000D
#define _CNEN1B_CNEN1B13_MASK                    0x00002000
#define _CNEN1B_CNEN1B13_LENGTH                  0x00000001

