wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _CNEN1B_CNEN1B14_POSITION                0x0000000E
#define _CNEN1B_CNEN1B14_MASK                    0x00004000
#define _CNEN1B_CNEN1B14_LENGTH                  0x00000001

#define _CNEN1B_CNEN1B15_POSITION                0x0000000F
#define _CNEN1B_CNEN1B15_MASK                    0x00008000
#define _CNEN1B_CNEN1B15_LENGTH                  0x00000001

#define _CNFB_CNFB0_POSITION                     0x00000000
#define _CNFB_CNFB0_MASK                         0x00000001
#define _CNFB_CNFB0_LENGTH                       0x00000001

#define _CNFB_CNFB1_POSITION                     0x00000001
#define _CNFB_CNFB1_MASK                         0x00000002
#define _CNFB_CNFB1_LENGTH                       0x00000001

#define _CNFB_CNFB2_POSITION                     0x00000002
#define _CNFB_CNFB2_MASK                         0x00000004
#define _CNFB_CNFB2_LENGTH                       0x00000001

#define _CNFB_CNFB3_POSITION                     0x00000003
#define _CNFB_CNFB3_MASK                         0x00000008
#define _CNFB_CNFB3_LENGTH                       0x00000001

#define _CNFB_CNFB4_POSITION                     0x00000004
#define _CNFB_CNFB4_MASK                         0x00000010
#define _CNFB_CNFB4_LENGTH                       0x00000001

#define _CNFB_CNFB5_POSITION                     0x00000005
#define _CNFB_CNFB5_MASK                         0x00000020
#define _CNFB_CNFB5_LENGTH                       0x00000001

#define _CNFB_CNFB6_POSITION                     0x00000006
#define _CNFB_CNFB6_MASK                         0x00000040
#define _CNFB_CNFB6_LENGTH                       0x00000001

#define _CNFB_CNFB7_POSITION                     0x00000007
#define _CNFB_CNFB7_MASK                         0x00000080
#define _CNFB_CNFB7_LENGTH                       0x00000001

#define _CNFB_CNFB8_POSITION                     0x00000008
#define _CNFB_CNFB8_MASK                         0x00000100
#define _CNFB_CNFB8_LENGTH                       0x00000001

#define _CNFB_CNFB9_POSITION                     0x00000009
#define _CNFB_CNFB9_MASK                         0x00000200
#define _CNFB_CNFB9_LENGTH                       0x00000001

#define _CNFB_CNFB10_POSITION                    0x0000000A
#define _CNFB_CNFB10_MASK                        0x00000400
#define _CNFB_CNFB10_LENGTH                      0x00000001

#define _CNFB_CNFB11_POSITION                    0x0000000B
#define _CNFB_CNFB11_MASK                        0x00000800
#define _CNFB_CNFB11_LENGTH                      0x00000001

#define _CNFB_CNFB12_POSITION                    0x0000000C
#define _CNFB_CNFB12_MASK                        0x00001000
#define _CNFB_CNFB12_LENGTH                      0x00000001

#define _CNFB_CNFB13_POSITION                    0x0000000D
#define _CNFB_CNFB13_MASK                        0x00002000
#define _CNFB_CNFB13_LENGTH                      0x00000001

#define _CNFB_CNFB14_POSITION                    0x0000000E
#define _CNFB_CNFB14_MASK                        0x00004000
#define _CNFB_CNFB14_LENGTH                      0x00000001

#define _CNFB_CNFB15_POSITION                    0x0000000F
#define _CNFB_CNFB15_MASK                        0x00008000
#define _CNFB_CNFB15_LENGTH                      0x00000001

#define _ANSELC_ANSELC0_POSITION                 0x00000000
#define _ANSELC_ANSELC0_MASK                     0x00000001
#define _ANSELC_ANSELC0_LENGTH                   0x00000001

#define _ANSELC_ANSELC1_POSITION                 0x00000001
#define _ANSELC_ANSELC1_MASK                     0x00000002
#define _ANSELC_ANSELC1_LENGTH                   0x00000001

#define _ANSELC_ANSELC2_POSITION                 0x00000002
#define _ANSELC_ANSELC2_MASK                     0x00000004
#define _ANSELC_ANSELC2_LENGTH                   0x00000001

#define _ANSELC_ANSELC3_POSITION                 0x00000003
#define _ANSELC_ANSELC3_MASK                     0x00000008
#define _ANSELC_ANSELC3_LENGTH                   0x00000001

#define _ANSELC_ANSELC6_POSITION                 0x00000006
#define _ANSELC_ANSELC6_MASK                     0x00000040
#define _ANSELC_ANSELC6_LENGTH                   0x00000001

#define _ANSELC_ANSELC7_POSITION                 0x00000007
#define _ANSELC_ANSELC7_MASK                     0x00000080
#define _ANSELC_ANSELC7_LENGTH                   0x00000001

#define _TRISC_TRISC0_POSITION                   0x00000000
#define _TRISC_TRISC0_MASK                       0x00000001
#define _TRISC_TRISC0_LENGTH                     0x00000001

#define _TRISC_TRISC1_POSITION                   0x00000001
#define _TRISC_TRISC1_MASK                       0x00000002
#define _TRISC_TRISC1_LENGTH                     0x00000001

#define _TRISC_TRISC2_POSITION                   0x00000002
#define _TRISC_TRISC2_MASK                       0x00000004
#define _TRISC_TRISC2_LENGTH                     0x00000001

#define _TRISC_TRISC3_POSITION                   0x00000003
#define _TRISC_TRISC3_MASK                       0x00000008
#define _TRISC_TRISC3_LENGTH                     0x00000001

#define _TRISC_TRISC4_POSITION                   0x00000004
#define _TRISC_TRISC4_MASK                       0x00000010
#define _TRISC_TRISC4_LENGTH                     0x00000001

#define _TRISC_TRISC5_POSITION                   0x00000005
#define _TRISC_TRISC5_MASK                       0x00000020
#define _TRISC_TRISC5_LENGTH                     0x00000001

#define _TRISC_TRISC6_POSITION                   0x00000006
#define _TRISC_TRISC6_MASK                       0x00000040
#define _TRISC_TRISC6_LENGTH                     0x00000001

#define _TRISC_TRISC7_POSITION                   0x00000007
#define _TRISC_TRISC7_MASK                       0x00000080
#define _TRISC_TRISC7_LENGTH                     0x00000001

#define _TRISC_TRISC8_POSITION                   0x00000008
#define _TRISC_TRISC8_MASK                       0x00000100
#define _TRISC_TRISC8_LENGTH                     0x00000001

#define _TRISC_TRISC9_POSITION                   0x00000009
#define _TRISC_TRISC9_MASK                       0x00000200
#define _TRISC_TRISC9_LENGTH                     0x00000001

#define _TRISC_TRISC10_POSITION                  0x0000000A
#define _TRISC_TRISC10_MASK                      0x00000400
#define _TRISC_TRISC10_LENGTH                    0x00000001

#define _TRISC_TRISC11_POSITION                  0x0000000B
#define _TRISC_TRISC11_MASK                      0x00000800
#define _TRISC_TRISC11_LENGTH                    0x00000001

