wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _CNEN1D_CNEN1D3_POSITION                 0x00000003
#define _CNEN1D_CNEN1D3_MASK                     0x00000008
#define _CNEN1D_CNEN1D3_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D4_POSITION                 0x00000004
#define _CNEN1D_CNEN1D4_MASK                     0x00000010
#define _CNEN1D_CNEN1D4_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D5_POSITION                 0x00000005
#define _CNEN1D_CNEN1D5_MASK                     0x00000020
#define _CNEN1D_CNEN1D5_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D6_POSITION                 0x00000006
#define _CNEN1D_CNEN1D6_MASK                     0x00000040
#define _CNEN1D_CNEN1D6_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D7_POSITION                 0x00000007
#define _CNEN1D_CNEN1D7_MASK                     0x00000080
#define _CNEN1D_CNEN1D7_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D8_POSITION                 0x00000008
#define _CNEN1D_CNEN1D8_MASK                     0x00000100
#define _CNEN1D_CNEN1D8_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D9_POSITION                 0x00000009
#define _CNEN1D_CNEN1D9_MASK                     0x00000200
#define _CNEN1D_CNEN1D9_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D10_POSITION                0x0000000A
#define _CNEN1D_CNEN1D10_MASK                    0x00000400
#define _CNEN1D_CNEN1D10_LENGTH                  0x00000001

#define _CNEN1D_CNEN1D11_POSITION                0x0000000B
#define _CNEN1D_CNEN1D11_MASK                    0x00000800
#define _CNEN1D_CNEN1D11_LENGTH                  0x00000001

#define _CNEN1D_CNEN1D12_POSITION                0x0000000C
#define _CNEN1D_CNEN1D12_MASK                    0x00001000
#define _CNEN1D_CNEN1D12_LENGTH                  0x00000001

#define _CNEN1D_CNEN1D13_POSITION                0x0000000D
#define _CNEN1D_CNEN1D13_MASK                    0x00002000
#define _CNEN1D_CNEN1D13_LENGTH                  0x00000001

#define _CNEN1D_CNEN1D14_POSITION                0x0000000E
#define _CNEN1D_CNEN1D14_MASK                    0x00004000
#define _CNEN1D_CNEN1D14_LENGTH                  0x00000001

#define _CNEN1D_CNEN1D15_POSITION                0x0000000F
#define _CNEN1D_CNEN1D15_MASK                    0x00008000
#define _CNEN1D_CNEN1D15_LENGTH                  0x00000001

#define _CNFD_CNFD0_POSITION                     0x00000000
#define _CNFD_CNFD0_MASK                         0x00000001
#define _CNFD_CNFD0_LENGTH                       0x00000001

#define _CNFD_CNFD1_POSITION                     0x00000001
#define _CNFD_CNFD1_MASK                         0x00000002
#define _CNFD_CNFD1_LENGTH                       0x00000001

#define _CNFD_CNFD2_POSITION                     0x00000002
#define _CNFD_CNFD2_MASK                         0x00000004
#define _CNFD_CNFD2_LENGTH                       0x00000001

#define _CNFD_CNFD3_POSITION                     0x00000003
#define _CNFD_CNFD3_MASK                         0x00000008
#define _CNFD_CNFD3_LENGTH                       0x00000001

#define _CNFD_CNFD4_POSITION                     0x00000004
#define _CNFD_CNFD4_MASK                         0x00000010
#define _CNFD_CNFD4_LENGTH                       0x00000001

#define _CNFD_CNFD5_POSITION                     0x00000005
#define _CNFD_CNFD5_MASK                         0x00000020
#define _CNFD_CNFD5_LENGTH                       0x00000001

#define _CNFD_CNFD6_POSITION                     0x00000006
#define _CNFD_CNFD6_MASK                         0x00000040
#define _CNFD_CNFD6_LENGTH                       0x00000001

#define _CNFD_CNFD7_POSITION                     0x00000007
#define _CNFD_CNFD7_MASK                         0x00000080
#define _CNFD_CNFD7_LENGTH                       0x00000001

#define _CNFD_CNFD8_POSITION                     0x00000008
#define _CNFD_CNFD8_MASK                         0x00000100
#define _CNFD_CNFD8_LENGTH                       0x00000001

#define _CNFD_CNFD9_POSITION                     0x00000009
#define _CNFD_CNFD9_MASK                         0x00000200
#define _CNFD_CNFD9_LENGTH                       0x00000001

#define _CNFD_CNFD10_POSITION                    0x0000000A
#define _CNFD_CNFD10_MASK                        0x00000400
#define _CNFD_CNFD10_LENGTH                      0x00000001

#define _CNFD_CNFD11_POSITION                    0x0000000B
#define _CNFD_CNFD11_MASK                        0x00000800
#define _CNFD_CNFD11_LENGTH                      0x00000001

#define _CNFD_CNFD12_POSITION                    0x0000000C
#define _CNFD_CNFD12_MASK                        0x00001000
#define _CNFD_CNFD12_LENGTH                      0x00000001

#define _CNFD_CNFD13_POSITION                    0x0000000D
#define _CNFD_CNFD13_MASK                        0x00002000
#define _CNFD_CNFD13_LENGTH                      0x00000001

#define _CNFD_CNFD14_POSITION                    0x0000000E
#define _CNFD_CNFD14_MASK                        0x00004000
#define _CNFD_CNFD14_LENGTH                      0x00000001

#define _CNFD_CNFD15_POSITION                    0x0000000F
#define _CNFD_CNFD15_MASK                        0x00008000
#define _CNFD_CNFD15_LENGTH                      0x00000001

#define _MBISTCON_MBISTEN_POSITION               0x00000000
#define _MBISTCON_MBISTEN_MASK                   0x00000001
#define _MBISTCON_MBISTEN_LENGTH                 0x00000001

#define _MBISTCON_MBISTSTAT_POSITION             0x00000004
#define _MBISTCON_MBISTSTAT_MASK                 0x00000010
#define _MBISTCON_MBISTSTAT_LENGTH               0x00000001

#define _MBISTCON_MBISTDONE_POSITION             0x00000007
#define _MBISTCON_MBISTDONE_MASK                 0x00000080
#define _MBISTCON_MBISTDONE_LENGTH               0x00000001

#define _MBISTCON_FLTINJ_POSITION                0x00000008
#define _MBISTCON_FLTINJ_MASK                    0x00000100
#define _MBISTCON_FLTINJ_LENGTH                  0x00000001

#define _U3MODE_MOD_POSITION                     0x00000000
#define _U3MODE_MOD_MASK                         0x0000000F
#define _U3MODE_MOD_LENGTH                       0x00000004

