wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _U3MODE_URXEN_POSITION                   0x00000004
#define _U3MODE_URXEN_MASK                       0x00000010
#define _U3MODE_URXEN_LENGTH                     0x00000001

#define _U3MODE_UTXEN_POSITION                   0x00000005
#define _U3MODE_UTXEN_MASK                       0x00000020
#define _U3MODE_UTXEN_LENGTH                     0x00000001

#define _U3MODE_ABAUD_POSITION                   0x00000006
#define _U3MODE_ABAUD_MASK                       0x00000040
#define _U3MODE_ABAUD_LENGTH                     0x00000001

#define _U3MODE_BRGH_POSITION                    0x00000007
#define _U3MODE_BRGH_MASK                        0x00000080
#define _U3MODE_BRGH_LENGTH                      0x00000001

#define _U3MODE_UTXBRK_POSITION                  0x00000008
#define _U3MODE_UTXBRK_MASK                      0x00000100
#define _U3MODE_UTXBRK_LENGTH                    0x00000001

#define _U3MODE_BRKOVR_POSITION                  0x00000009
#define _U3MODE_BRKOVR_MASK                      0x00000200
#define _U3MODE_BRKOVR_LENGTH                    0x00000001

#define _U3MODE_RXBIMD_POSITION                  0x0000000B
#define _U3MODE_RXBIMD_MASK                      0x00000800
#define _U3MODE_RXBIMD_LENGTH                    0x00000001

#define _U3MODE_WAKE_POSITION                    0x0000000C
#define _U3MODE_WAKE_MASK                        0x00001000
#define _U3MODE_WAKE_LENGTH                      0x00000001

#define _U3MODE_USIDL_POSITION                   0x0000000D
#define _U3MODE_USIDL_MASK                       0x00002000
#define _U3MODE_USIDL_LENGTH                     0x00000001

#define _U3MODE_UARTEN_POSITION                  0x0000000F
#define _U3MODE_UARTEN_MASK                      0x00008000
#define _U3MODE_UARTEN_LENGTH                    0x00000001

#define _U3MODE_MOD0_POSITION                    0x00000000
#define _U3MODE_MOD0_MASK                        0x00000001
#define _U3MODE_MOD0_LENGTH                      0x00000001

#define _U3MODE_MOD1_POSITION                    0x00000001
#define _U3MODE_MOD1_MASK                        0x00000002
#define _U3MODE_MOD1_LENGTH                      0x00000001

#define _U3MODE_MOD2_POSITION                    0x00000002
#define _U3MODE_MOD2_MASK                        0x00000004
#define _U3MODE_MOD2_LENGTH                      0x00000001

#define _U3MODE_MOD3_POSITION                    0x00000003
#define _U3MODE_MOD3_MASK                        0x00000008
#define _U3MODE_MOD3_LENGTH                      0x00000001

#define _U3MODEH_FLO_POSITION                    0x00000000
#define _U3MODEH_FLO_MASK                        0x00000003
#define _U3MODEH_FLO_LENGTH                      0x00000002

#define _U3MODEH_UTXINV_POSITION                 0x00000002
#define _U3MODEH_UTXINV_MASK                     0x00000004
#define _U3MODEH_UTXINV_LENGTH                   0x00000001

#define _U3MODEH_C0EN_POSITION                   0x00000003
#define _U3MODEH_C0EN_MASK                       0x00000008
#define _U3MODEH_C0EN_LENGTH                     0x00000001

#define _U3MODEH_STSEL_POSITION                  0x00000004
#define _U3MODEH_STSEL_MASK                      0x00000030
#define _U3MODEH_STSEL_LENGTH                    0x00000002

#define _U3MODEH_URXINV_POSITION                 0x00000006
#define _U3MODEH_URXINV_MASK                     0x00000040
#define _U3MODEH_URXINV_LENGTH                   0x00000001

#define _U3MODEH_RUNOVF_POSITION                 0x00000007
#define _U3MODEH_RUNOVF_MASK                     0x00000080
#define _U3MODEH_RUNOVF_LENGTH                   0x00000001

#define _U3MODEH_HALFDPLX_POSITION               0x00000008
#define _U3MODEH_HALFDPLX_MASK                   0x00000100
#define _U3MODEH_HALFDPLX_LENGTH                 0x00000001

#define _U3MODEH_BCLKSEL_POSITION                0x00000009
#define _U3MODEH_BCLKSEL_MASK                    0x00000600
#define _U3MODEH_BCLKSEL_LENGTH                  0x00000002

#define _U3MODEH_BCLKMOD_POSITION                0x0000000B
#define _U3MODEH_BCLKMOD_MASK                    0x00000800
#define _U3MODEH_BCLKMOD_LENGTH                  0x00000001

#define _U3MODEH_ACTIVE_POSITION                 0x0000000E
#define _U3MODEH_ACTIVE_MASK                     0x00004000
#define _U3MODEH_ACTIVE_LENGTH                   0x00000001

#define _U3MODEH_SLPEN_POSITION                  0x0000000F
#define _U3MODEH_SLPEN_MASK                      0x00008000
#define _U3MODEH_SLPEN_LENGTH                    0x00000001

#define _U3MODEH_FLO0_POSITION                   0x00000000
#define _U3MODEH_FLO0_MASK                       0x00000001
#define _U3MODEH_FLO0_LENGTH                     0x00000001

#define _U3MODEH_FLO1_POSITION                   0x00000001
#define _U3MODEH_FLO1_MASK                       0x00000002
#define _U3MODEH_FLO1_LENGTH                     0x00000001

#define _U3MODEH_STSEL0_POSITION                 0x00000004
#define _U3MODEH_STSEL0_MASK                     0x00000010
#define _U3MODEH_STSEL0_LENGTH                   0x00000001

#define _U3MODEH_STSEL1_POSITION                 0x00000005
#define _U3MODEH_STSEL1_MASK                     0x00000020
#define _U3MODEH_STSEL1_LENGTH                   0x00000001

#define _U3MODEH_BCLKSEL0_POSITION               0x00000009
#define _U3MODEH_BCLKSEL0_MASK                   0x00000200
#define _U3MODEH_BCLKSEL0_LENGTH                 0x00000001

#define _U3MODEH_BCLKSEL1_POSITION               0x0000000A
#define _U3MODEH_BCLKSEL1_MASK                   0x00000400
#define _U3MODEH_BCLKSEL1_LENGTH                 0x00000001

#define _U3STA_TXCIF_POSITION                    0x00000000
#define _U3STA_TXCIF_MASK                        0x00000001
#define _U3STA_TXCIF_LENGTH                      0x00000001

#define _U3STA_OERR_POSITION                     0x00000001
#define _U3STA_OERR_MASK                         0x00000002
#define _U3STA_OERR_LENGTH                       0x00000001

#define _U3STA_RXBKIF_POSITION                   0x00000002
#define _U3STA_RXBKIF_MASK                       0x00000004
#define _U3STA_RXBKIF_LENGTH                     0x00000001

#define _U3STA_FERR_POSITION                     0x00000003
#define _U3STA_FERR_MASK                         0x00000008
#define _U3STA_FERR_LENGTH                       0x00000001

#define _U3STA_CERIF_POSITION                    0x00000004
#define _U3STA_CERIF_MASK                        0x00000010
#define _U3STA_CERIF_LENGTH                      0x00000001

#define _U3STA_ABDOVF_POSITION                   0x00000005
#define _U3STA_ABDOVF_MASK                       0x00000020
#define _U3STA_ABDOVF_LENGTH                     0x00000001

#define _U3STA_PERR_POSITION                     0x00000006
#define _U3STA_PERR_MASK                         0x00000040
#define _U3STA_PERR_LENGTH                       0x00000001

#define _U3STA_TRMT_POSITION                     0x00000007
#define _U3STA_TRMT_MASK                         0x00000080
#define _U3STA_TRMT_LENGTH                       0x00000001

