wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _U3P3H_P318_POSITION                     0x00000002
#define _U3P3H_P318_MASK                         0x00000004
#define _U3P3H_P318_LENGTH                       0x00000001

#define _U3P3H_P319_POSITION                     0x00000003
#define _U3P3H_P319_MASK                         0x00000008
#define _U3P3H_P319_LENGTH                       0x00000001

#define _U3P3H_P320_POSITION                     0x00000004
#define _U3P3H_P320_MASK                         0x00000010
#define _U3P3H_P320_LENGTH                       0x00000001

#define _U3P3H_P321_POSITION                     0x00000005
#define _U3P3H_P321_MASK                         0x00000020
#define _U3P3H_P321_LENGTH                       0x00000001

#define _U3P3H_P322_POSITION                     0x00000006
#define _U3P3H_P322_MASK                         0x00000040
#define _U3P3H_P322_LENGTH                       0x00000001

#define _U3P3H_P323_POSITION                     0x00000007
#define _U3P3H_P323_MASK                         0x00000080
#define _U3P3H_P323_LENGTH                       0x00000001

#define _U3TXCHK_TXCHK_POSITION                  0x00000000
#define _U3TXCHK_TXCHK_MASK                      0x000000FF
#define _U3TXCHK_TXCHK_LENGTH                    0x00000008

#define _U3TXCHK_TXCHK0_POSITION                 0x00000000
#define _U3TXCHK_TXCHK0_MASK                     0x00000001
#define _U3TXCHK_TXCHK0_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK1_POSITION                 0x00000001
#define _U3TXCHK_TXCHK1_MASK                     0x00000002
#define _U3TXCHK_TXCHK1_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK2_POSITION                 0x00000002
#define _U3TXCHK_TXCHK2_MASK                     0x00000004
#define _U3TXCHK_TXCHK2_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK3_POSITION                 0x00000003
#define _U3TXCHK_TXCHK3_MASK                     0x00000008
#define _U3TXCHK_TXCHK3_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK4_POSITION                 0x00000004
#define _U3TXCHK_TXCHK4_MASK                     0x00000010
#define _U3TXCHK_TXCHK4_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK5_POSITION                 0x00000005
#define _U3TXCHK_TXCHK5_MASK                     0x00000020
#define _U3TXCHK_TXCHK5_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK6_POSITION                 0x00000006
#define _U3TXCHK_TXCHK6_MASK                     0x00000040
#define _U3TXCHK_TXCHK6_LENGTH                   0x00000001

#define _U3TXCHK_TXCHK7_POSITION                 0x00000007
#define _U3TXCHK_TXCHK7_MASK                     0x00000080
#define _U3TXCHK_TXCHK7_LENGTH                   0x00000001

#define _U3RXCHK_RXCHK_POSITION                  0x00000000
#define _U3RXCHK_RXCHK_MASK                      0x000000FF
#define _U3RXCHK_RXCHK_LENGTH                    0x00000008

#define _U3SCCON_PTRCL_POSITION                  0x00000001
#define _U3SCCON_PTRCL_MASK                      0x00000002
#define _U3SCCON_PTRCL_LENGTH                    0x00000001

#define _U3SCCON_T0PD_POSITION                   0x00000002
#define _U3SCCON_T0PD_MASK                       0x00000004
#define _U3SCCON_T0PD_LENGTH                     0x00000001

#define _U3SCCON_CONV_POSITION                   0x00000003
#define _U3SCCON_CONV_MASK                       0x00000008
#define _U3SCCON_CONV_LENGTH                     0x00000001

#define _U3SCCON_TXRPT_POSITION                  0x00000004
#define _U3SCCON_TXRPT_MASK                      0x00000030
#define _U3SCCON_TXRPT_LENGTH                    0x00000002

#define _U3SCCON_TXRPT0_POSITION                 0x00000004
#define _U3SCCON_TXRPT0_MASK                     0x00000010
#define _U3SCCON_TXRPT0_LENGTH                   0x00000001

#define _U3SCCON_TXRPT1_POSITION                 0x00000005
#define _U3SCCON_TXRPT1_MASK                     0x00000020
#define _U3SCCON_TXRPT1_LENGTH                   0x00000001

#define _U3SCINT_GTCIE_POSITION                  0x00000000
#define _U3SCINT_GTCIE_MASK                      0x00000001
#define _U3SCINT_GTCIE_LENGTH                    0x00000001

#define _U3SCINT_WTCIE_POSITION                  0x00000001
#define _U3SCINT_WTCIE_MASK                      0x00000002
#define _U3SCINT_WTCIE_LENGTH                    0x00000001

#define _U3SCINT_BTCIE_POSITION                  0x00000002
#define _U3SCINT_BTCIE_MASK                      0x00000004
#define _U3SCINT_BTCIE_LENGTH                    0x00000001

#define _U3SCINT_TXRPTIE_POSITION                0x00000004
#define _U3SCINT_TXRPTIE_MASK                    0x00000010
#define _U3SCINT_TXRPTIE_LENGTH                  0x00000001

#define _U3SCINT_RXRPTIE_POSITION                0x00000005
#define _U3SCINT_RXRPTIE_MASK                    0x00000020
#define _U3SCINT_RXRPTIE_LENGTH                  0x00000001

#define _U3SCINT_GTCIF_POSITION                  0x00000008
#define _U3SCINT_GTCIF_MASK                      0x00000100
#define _U3SCINT_GTCIF_LENGTH                    0x00000001

#define _U3SCINT_WTCIF_POSITION                  0x00000009
#define _U3SCINT_WTCIF_MASK                      0x00000200
#define _U3SCINT_WTCIF_LENGTH                    0x00000001

#define _U3SCINT_BTCIF_POSITION                  0x0000000A
#define _U3SCINT_BTCIF_MASK                      0x00000400
#define _U3SCINT_BTCIF_LENGTH                    0x00000001

#define _U3SCINT_TXRPTIF_POSITION                0x0000000C
#define _U3SCINT_TXRPTIF_MASK                    0x00001000
#define _U3SCINT_TXRPTIF_LENGTH                  0x00000001

#define _U3SCINT_RXRPTIF_POSITION                0x0000000D
#define _U3SCINT_RXRPTIF_MASK                    0x00002000
#define _U3SCINT_RXRPTIF_LENGTH                  0x00000001

#define _U3INT_ABDIE_POSITION                    0x00000002
#define _U3INT_ABDIE_MASK                        0x00000004
#define _U3INT_ABDIE_LENGTH                      0x00000001

#define _U3INT_ABDIF_POSITION                    0x00000006
#define _U3INT_ABDIF_MASK                        0x00000040
#define _U3INT_ABDIF_LENGTH                      0x00000001

