wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _CLKDIV_FRCDIV1_POSITION                 0x00000009
#define _CLKDIV_FRCDIV1_MASK                     0x00000200
#define _CLKDIV_FRCDIV1_LENGTH                   0x00000001

#define _CLKDIV_FRCDIV2_POSITION                 0x0000000A
#define _CLKDIV_FRCDIV2_MASK                     0x00000400
#define _CLKDIV_FRCDIV2_LENGTH                   0x00000001

#define _CLKDIV_DOZE0_POSITION                   0x0000000C
#define _CLKDIV_DOZE0_MASK                       0x00001000
#define _CLKDIV_DOZE0_LENGTH                     0x00000001

#define _CLKDIV_DOZE1_POSITION                   0x0000000D
#define _CLKDIV_DOZE1_MASK                       0x00002000
#define _CLKDIV_DOZE1_LENGTH                     0x00000001

#define _CLKDIV_DOZE2_POSITION                   0x0000000E
#define _CLKDIV_DOZE2_MASK                       0x00004000
#define _CLKDIV_DOZE2_LENGTH                     0x00000001

#define _PLLFBD_PLLFBDIV_POSITION                0x00000000
#define _PLLFBD_PLLFBDIV_MASK                    0x00000FFF
#define _PLLFBD_PLLFBDIV_LENGTH                  0x0000000C

#define _PLLFBD_PLLFBDIV0_POSITION               0x00000000
#define _PLLFBD_PLLFBDIV0_MASK                   0x00000001
#define _PLLFBD_PLLFBDIV0_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV1_POSITION               0x00000001
#define _PLLFBD_PLLFBDIV1_MASK                   0x00000002
#define _PLLFBD_PLLFBDIV1_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV2_POSITION               0x00000002
#define _PLLFBD_PLLFBDIV2_MASK                   0x00000004
#define _PLLFBD_PLLFBDIV2_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV3_POSITION               0x00000003
#define _PLLFBD_PLLFBDIV3_MASK                   0x00000008
#define _PLLFBD_PLLFBDIV3_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV4_POSITION               0x00000004
#define _PLLFBD_PLLFBDIV4_MASK                   0x00000010
#define _PLLFBD_PLLFBDIV4_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV5_POSITION               0x00000005
#define _PLLFBD_PLLFBDIV5_MASK                   0x00000020
#define _PLLFBD_PLLFBDIV5_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV6_POSITION               0x00000006
#define _PLLFBD_PLLFBDIV6_MASK                   0x00000040
#define _PLLFBD_PLLFBDIV6_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV7_POSITION               0x00000007
#define _PLLFBD_PLLFBDIV7_MASK                   0x00000080
#define _PLLFBD_PLLFBDIV7_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV8_POSITION               0x00000008
#define _PLLFBD_PLLFBDIV8_MASK                   0x00000100
#define _PLLFBD_PLLFBDIV8_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV9_POSITION               0x00000009
#define _PLLFBD_PLLFBDIV9_MASK                   0x00000200
#define _PLLFBD_PLLFBDIV9_LENGTH                 0x00000001

#define _PLLFBD_PLLFBDIV10_POSITION              0x0000000A
#define _PLLFBD_PLLFBDIV10_MASK                  0x00000400
#define _PLLFBD_PLLFBDIV10_LENGTH                0x00000001

#define _PLLFBD_PLLFBDIV11_POSITION              0x0000000B
#define _PLLFBD_PLLFBDIV11_MASK                  0x00000800
#define _PLLFBD_PLLFBDIV11_LENGTH                0x00000001

#define _PLLDIV_POST2DIV_POSITION                0x00000000
#define _PLLDIV_POST2DIV_MASK                    0x00000007
#define _PLLDIV_POST2DIV_LENGTH                  0x00000003

#define _PLLDIV_POST1DIV_POSITION                0x00000004
#define _PLLDIV_POST1DIV_MASK                    0x00000070
#define _PLLDIV_POST1DIV_LENGTH                  0x00000003

#define _PLLDIV_VCODIV_POSITION                  0x00000008
#define _PLLDIV_VCODIV_MASK                      0x00000300
#define _PLLDIV_VCODIV_LENGTH                    0x00000002

#define _PLLDIV_POST2DIV0_POSITION               0x00000000
#define _PLLDIV_POST2DIV0_MASK                   0x00000001
#define _PLLDIV_POST2DIV0_LENGTH                 0x00000001

#define _PLLDIV_POST2DIV1_POSITION               0x00000001
#define _PLLDIV_POST2DIV1_MASK                   0x00000002
#define _PLLDIV_POST2DIV1_LENGTH                 0x00000001

#define _PLLDIV_POST2DIV2_POSITION               0x00000002
#define _PLLDIV_POST2DIV2_MASK                   0x00000004
#define _PLLDIV_POST2DIV2_LENGTH                 0x00000001

#define _PLLDIV_POST1DIV0_POSITION               0x00000004
#define _PLLDIV_POST1DIV0_MASK                   0x00000010
#define _PLLDIV_POST1DIV0_LENGTH                 0x00000001

#define _PLLDIV_POST1DIV1_POSITION               0x00000005
#define _PLLDIV_POST1DIV1_MASK                   0x00000020
#define _PLLDIV_POST1DIV1_LENGTH                 0x00000001

#define _PLLDIV_POST1DIV2_POSITION               0x00000006
#define _PLLDIV_POST1DIV2_MASK                   0x00000040
#define _PLLDIV_POST1DIV2_LENGTH                 0x00000001

#define _PLLDIV_VCODIV0_POSITION                 0x00000008
#define _PLLDIV_VCODIV0_MASK                     0x00000100
#define _PLLDIV_VCODIV0_LENGTH                   0x00000001

#define _PLLDIV_VCODIV1_POSITION                 0x00000009
#define _PLLDIV_VCODIV1_MASK                     0x00000200
#define _PLLDIV_VCODIV1_LENGTH                   0x00000001

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _OSCTUN_TUN0_POSITION                    0x00000000
#define _OSCTUN_TUN0_MASK                        0x00000001
#define _OSCTUN_TUN0_LENGTH                      0x00000001

#define _OSCTUN_TUN1_POSITION                    0x00000001
#define _OSCTUN_TUN1_MASK                        0x00000002
#define _OSCTUN_TUN1_LENGTH                      0x00000001

#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TUN4_POSITION                    0x00000004
#define _OSCTUN_TUN4_MASK                        0x00000010
#define _OSCTUN_TUN4_LENGTH                      0x00000001

