wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _OSCTUN_TUN5_POSITION                    0x00000005
#define _OSCTUN_TUN5_MASK                        0x00000020
#define _OSCTUN_TUN5_LENGTH                      0x00000001

#define _ACLKCON1_APLLPRE_POSITION               0x00000000
#define _ACLKCON1_APLLPRE_MASK                   0x0000003F
#define _ACLKCON1_APLLPRE_LENGTH                 0x00000006

#define _ACLKCON1_FRCSEL_POSITION                0x00000008
#define _ACLKCON1_FRCSEL_MASK                    0x00000100
#define _ACLKCON1_FRCSEL_LENGTH                  0x00000001

#define _ACLKCON1_ASRCSEL_POSITION               0x00000009
#define _ACLKCON1_ASRCSEL_MASK                   0x00000200
#define _ACLKCON1_ASRCSEL_LENGTH                 0x00000001

#define _ACLKCON1_APLLCK_POSITION                0x0000000E
#define _ACLKCON1_APLLCK_MASK                    0x00004000
#define _ACLKCON1_APLLCK_LENGTH                  0x00000001

#define _ACLKCON1_APLLEN_POSITION                0x0000000F
#define _ACLKCON1_APLLEN_MASK                    0x00008000
#define _ACLKCON1_APLLEN_LENGTH                  0x00000001

#define _ACLKCON1_APLLPRE0_POSITION              0x00000000
#define _ACLKCON1_APLLPRE0_MASK                  0x00000001
#define _ACLKCON1_APLLPRE0_LENGTH                0x00000001

#define _ACLKCON1_APLLPRE1_POSITION              0x00000001
#define _ACLKCON1_APLLPRE1_MASK                  0x00000002
#define _ACLKCON1_APLLPRE1_LENGTH                0x00000001

#define _ACLKCON1_APLLPRE2_POSITION              0x00000002
#define _ACLKCON1_APLLPRE2_MASK                  0x00000004
#define _ACLKCON1_APLLPRE2_LENGTH                0x00000001

#define _ACLKCON1_APLLPRE3_POSITION              0x00000003
#define _ACLKCON1_APLLPRE3_MASK                  0x00000008
#define _ACLKCON1_APLLPRE3_LENGTH                0x00000001

#define _ACLKCON1_APLLPRE4_POSITION              0x00000004
#define _ACLKCON1_APLLPRE4_MASK                  0x00000010
#define _ACLKCON1_APLLPRE4_LENGTH                0x00000001

#define _ACLKCON1_APLLPRE5_POSITION              0x00000005
#define _ACLKCON1_APLLPRE5_MASK                  0x00000020
#define _ACLKCON1_APLLPRE5_LENGTH                0x00000001

#define _APLLFBD1_APLLFBDIV_POSITION             0x00000000
#define _APLLFBD1_APLLFBDIV_MASK                 0x00000FFF
#define _APLLFBD1_APLLFBDIV_LENGTH               0x0000000C

#define _APLLFBD1_APLLFBDIV0_POSITION            0x00000000
#define _APLLFBD1_APLLFBDIV0_MASK                0x00000001
#define _APLLFBD1_APLLFBDIV0_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV1_POSITION            0x00000001
#define _APLLFBD1_APLLFBDIV1_MASK                0x00000002
#define _APLLFBD1_APLLFBDIV1_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV2_POSITION            0x00000002
#define _APLLFBD1_APLLFBDIV2_MASK                0x00000004
#define _APLLFBD1_APLLFBDIV2_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV3_POSITION            0x00000003
#define _APLLFBD1_APLLFBDIV3_MASK                0x00000008
#define _APLLFBD1_APLLFBDIV3_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV4_POSITION            0x00000004
#define _APLLFBD1_APLLFBDIV4_MASK                0x00000010
#define _APLLFBD1_APLLFBDIV4_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV5_POSITION            0x00000005
#define _APLLFBD1_APLLFBDIV5_MASK                0x00000020
#define _APLLFBD1_APLLFBDIV5_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV6_POSITION            0x00000006
#define _APLLFBD1_APLLFBDIV6_MASK                0x00000040
#define _APLLFBD1_APLLFBDIV6_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV7_POSITION            0x00000007
#define _APLLFBD1_APLLFBDIV7_MASK                0x00000080
#define _APLLFBD1_APLLFBDIV7_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV8_POSITION            0x00000008
#define _APLLFBD1_APLLFBDIV8_MASK                0x00000100
#define _APLLFBD1_APLLFBDIV8_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV9_POSITION            0x00000009
#define _APLLFBD1_APLLFBDIV9_MASK                0x00000200
#define _APLLFBD1_APLLFBDIV9_LENGTH              0x00000001

#define _APLLFBD1_APLLFBDIV10_POSITION           0x0000000A
#define _APLLFBD1_APLLFBDIV10_MASK               0x00000400
#define _APLLFBD1_APLLFBDIV10_LENGTH             0x00000001

#define _APLLFBD1_APLLFBDIV11_POSITION           0x0000000B
#define _APLLFBD1_APLLFBDIV11_MASK               0x00000800
#define _APLLFBD1_APLLFBDIV11_LENGTH             0x00000001

#define _APLLDIV1_APOST2DIV_POSITION             0x00000000
#define _APLLDIV1_APOST2DIV_MASK                 0x00000007
#define _APLLDIV1_APOST2DIV_LENGTH               0x00000003

#define _APLLDIV1_APOST1DIV_POSITION             0x00000004
#define _APLLDIV1_APOST1DIV_MASK                 0x00000070
#define _APLLDIV1_APOST1DIV_LENGTH               0x00000003

#define _APLLDIV1_AVCODIV_POSITION               0x00000008
#define _APLLDIV1_AVCODIV_MASK                   0x00000300
#define _APLLDIV1_AVCODIV_LENGTH                 0x00000002

#define _APLLDIV1_APOST2DIV0_POSITION            0x00000000
#define _APLLDIV1_APOST2DIV0_MASK                0x00000001
#define _APLLDIV1_APOST2DIV0_LENGTH              0x00000001

#define _APLLDIV1_APOST2DIV1_POSITION            0x00000001
#define _APLLDIV1_APOST2DIV1_MASK                0x00000002
#define _APLLDIV1_APOST2DIV1_LENGTH              0x00000001

#define _APLLDIV1_APOST2DIV2_POSITION            0x00000002
#define _APLLDIV1_APOST2DIV2_MASK                0x00000004
#define _APLLDIV1_APOST2DIV2_LENGTH              0x00000001

#define _APLLDIV1_APOST1DIV0_POSITION            0x00000004
#define _APLLDIV1_APOST1DIV0_MASK                0x00000010
#define _APLLDIV1_APOST1DIV0_LENGTH              0x00000001

#define _APLLDIV1_APOST1DIV1_POSITION            0x00000005
#define _APLLDIV1_APOST1DIV1_MASK                0x00000020
#define _APLLDIV1_APOST1DIV1_LENGTH              0x00000001

#define _APLLDIV1_APOST1DIV2_POSITION            0x00000006
#define _APLLDIV1_APOST1DIV2_MASK                0x00000040
#define _APLLDIV1_APOST1DIV2_LENGTH              0x00000001

#define _APLLDIV1_AVCODIV0_POSITION              0x00000008
#define _APLLDIV1_AVCODIV0_MASK                  0x00000100
#define _APLLDIV1_AVCODIV0_LENGTH                0x00000001

#define _APLLDIV1_AVCODIV1_POSITION              0x00000009
#define _APLLDIV1_AVCODIV1_MASK                  0x00000200
#define _APLLDIV1_AVCODIV1_LENGTH                0x00000001

