wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _PMD2_CCP4MD_POSITION                    0x00000003
#define _PMD2_CCP4MD_MASK                        0x00000008
#define _PMD2_CCP4MD_LENGTH                      0x00000001

#define _PMD2_CCP5MD_POSITION                    0x00000004
#define _PMD2_CCP5MD_MASK                        0x00000010
#define _PMD2_CCP5MD_LENGTH                      0x00000001

#define _PMD2_CCP6MD_POSITION                    0x00000005
#define _PMD2_CCP6MD_MASK                        0x00000020
#define _PMD2_CCP6MD_LENGTH                      0x00000001

#define _PMD2_CCP7MD_POSITION                    0x00000006
#define _PMD2_CCP7MD_MASK                        0x00000040
#define _PMD2_CCP7MD_LENGTH                      0x00000001

#define _PMD2_CCP8MD_POSITION                    0x00000007
#define _PMD2_CCP8MD_MASK                        0x00000080
#define _PMD2_CCP8MD_LENGTH                      0x00000001

#define _PMD2_CCP9MD_POSITION                    0x00000008
#define _PMD2_CCP9MD_MASK                        0x00000100
#define _PMD2_CCP9MD_LENGTH                      0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_I2C3MD_POSITION                    0x00000002
#define _PMD3_I2C3MD_MASK                        0x00000004
#define _PMD3_I2C3MD_LENGTH                      0x00000001

#define _PMD3_U3MD_POSITION                      0x00000003
#define _PMD3_U3MD_MASK                          0x00000008
#define _PMD3_U3MD_LENGTH                        0x00000001

#define _PMD3_QEI2MD_POSITION                    0x00000005
#define _PMD3_QEI2MD_MASK                        0x00000020
#define _PMD3_QEI2MD_LENGTH                      0x00000001

#define _PMD3_CRCMD_POSITION                     0x00000007
#define _PMD3_CRCMD_MASK                         0x00000080
#define _PMD3_CRCMD_LENGTH                       0x00000001

#define _PMD3_PMPMD_POSITION                     0x00000008
#define _PMD3_PMPMD_MASK                         0x00000100
#define _PMD3_PMPMD_LENGTH                       0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD6_DMA0MD_POSITION                    0x00000008
#define _PMD6_DMA0MD_MASK                        0x00000100
#define _PMD6_DMA0MD_LENGTH                      0x00000001

#define _PMD6_DMA1MD_POSITION                    0x00000009
#define _PMD6_DMA1MD_MASK                        0x00000200
#define _PMD6_DMA1MD_LENGTH                      0x00000001

#define _PMD6_DMA2MD_POSITION                    0x0000000A
#define _PMD6_DMA2MD_MASK                        0x00000400
#define _PMD6_DMA2MD_LENGTH                      0x00000001

#define _PMD6_DMA3MD_POSITION                    0x0000000B
#define _PMD6_DMA3MD_MASK                        0x00000800
#define _PMD6_DMA3MD_LENGTH                      0x00000001

#define _PMD7_PTGMD_POSITION                     0x00000003
#define _PMD7_PTGMD_MASK                         0x00000008
#define _PMD7_PTGMD_LENGTH                       0x00000001

#define _PMD7_CMP1MD_POSITION                    0x00000008
#define _PMD7_CMP1MD_MASK                        0x00000100
#define _PMD7_CMP1MD_LENGTH                      0x00000001

#define _PMD7_CMP2MD_POSITION                    0x00000009
#define _PMD7_CMP2MD_MASK                        0x00000200
#define _PMD7_CMP2MD_LENGTH                      0x00000001

#define _PMD7_CMP3MD_POSITION                    0x0000000A
#define _PMD7_CMP3MD_MASK                        0x00000400
#define _PMD7_CMP3MD_LENGTH                      0x00000001

#define _PMD8_BIASMD_POSITION                    0x00000001
#define _PMD8_BIASMD_MASK                        0x00000002
#define _PMD8_BIASMD_LENGTH                      0x00000001

#define _PMD8_CLC1MD_POSITION                    0x00000002
#define _PMD8_CLC1MD_MASK                        0x00000004
#define _PMD8_CLC1MD_LENGTH                      0x00000001

#define _PMD8_CLC2MD_POSITION                    0x00000003
#define _PMD8_CLC2MD_MASK                        0x00000008
#define _PMD8_CLC2MD_LENGTH                      0x00000001

#define _PMD8_CLC3MD_POSITION                    0x00000004
#define _PMD8_CLC3MD_MASK                        0x00000010
#define _PMD8_CLC3MD_LENGTH                      0x00000001

#define _PMD8_CLC4MD_POSITION                    0x00000005
#define _PMD8_CLC4MD_MASK                        0x00000020
#define _PMD8_CLC4MD_LENGTH                      0x00000001

#define _PMD8_DMTMD_POSITION                     0x00000008
#define _PMD8_DMTMD_MASK                         0x00000100
#define _PMD8_DMTMD_LENGTH                       0x00000001

#define _PMD8_SENT1MD_POSITION                   0x0000000B
#define _PMD8_SENT1MD_MASK                       0x00000800
#define _PMD8_SENT1MD_LENGTH                     0x00000001

#define _PMD8_SENT2MD_POSITION                   0x0000000C
#define _PMD8_SENT2MD_MASK                       0x00001000
#define _PMD8_SENT2MD_LENGTH                     0x00000001

#define _PMD8_OPAMPMD_POSITION                   0x0000000D
#define _PMD8_OPAMPMD_MASK                       0x00002000
#define _PMD8_OPAMPMD_LENGTH                     0x00000001

#define _WDTCONL_WDTWINEN_POSITION               0x00000000
#define _WDTCONL_WDTWINEN_MASK                   0x00000001
#define _WDTCONL_WDTWINEN_LENGTH                 0x00000001

#define _WDTCONL_SLPDIV_POSITION                 0x00000001
#define _WDTCONL_SLPDIV_MASK                     0x0000003E
#define _WDTCONL_SLPDIV_LENGTH                   0x00000005

#define _WDTCONL_CLKSEL_POSITION                 0x00000006
#define _WDTCONL_CLKSEL_MASK                     0x000000C0
#define _WDTCONL_CLKSEL_LENGTH                   0x00000002

#define _WDTCONL_RUNDIV_POSITION                 0x00000008
#define _WDTCONL_RUNDIV_MASK                     0x00001F00
#define _WDTCONL_RUNDIV_LENGTH                   0x00000005

