wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
#define _APPS_APOOV_POSITION                     0x00000003
#define _APPS_APOOV_MASK                         0x00000008
#define _APPS_APOOV_LENGTH                       0x00000001

#define _APPS_STRFUL_POSITION                    0x00000004
#define _APPS_STRFUL_MASK                        0x00000010
#define _APPS_STRFUL_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Fuses that are always present */

/* Register FBOOT (0x801800)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBOOT;
#define _FBOOT(x) __attribute__((address(0x801800),deprecated_definition("consider migrating to #pragma config"),section("__FBOOT.sec"),space(prog))) __prog__ uint16_t _FBOOT = (x);

/*
** Only one invocation of FBOOT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBOOT.
** Multiple options may be combined, as shown:
**
** _FBOOT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Device Boot Mode Configuration:
**     BTMODE_DUALPRIV      Device is in Dual Partition Privilege mode
**     BTMODE_DUALPROT      Device is in Dual Partition Protected mode
**     BTMODE_DUAL          Device is in Dual Partition mode
**     BTMODE_SINGLE        Device is in Single Boot (legacy) mode
**
*/

#define BTMODE_DUALPRIV      0x0000
#define BTMODE_DUALPROT      0x0001
#define BTMODE_DUAL          0x0002
#define BTMODE_SINGLE        0x0003

/* Fuses that are only present in single panel mode */

#ifndef __DUAL_PARTITION
/* Register FSEC (0x2bf00)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0x2bf00),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HIGH             High Security
**     BSS_STNDRD           Standard Security
**     BSS_DISABLED         No Protection (other than BWRP)
**
**   Boot Segment Control bit:
**     BSEN_ON              Boot Segment size determined by FBSLIM
**     BSEN_OFF             No Boot Segment
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HIGH             High Security
**     GSS_STNDRD           Standard Security
**     GSS_DISABLED         No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HIGH             High Security
**     CSS_ENHNCD           Enhanced Security
**     CSS_STNDRD           Standard Security
**     CSS_DISABLED         No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table bit:
**     AIVTDIS_ON           Enabled AIVT
**     AIVTDIS_OFF          Disabled AIVT
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

#define BSS_HIGH             0x8FE9
#define BSS_STNDRD           0x8FED
#define BSS_DISABLED         0x8FEF

#define BSEN_ON              0x8FE7
#define BSEN_OFF             0x8FEF

#define GWRP_ON              0x8FCF
#define GWRP_OFF             0x8FEF

#define GSS_HIGH             0x8F2F
#define GSS_STNDRD           0x8FAF
#define GSS_DISABLED         0x8FEF

#define CWRP_ON              0x8EEF
#define CWRP_OFF             0x8FEF

#define CSS_HIGH             0x81EF
#define CSS_ENHNCD           0x89EF
#define CSS_STNDRD           0x8DEF
#define CSS_DISABLED         0x8FEF

#define AIVTDIS_ON           0x0FEF
#define AIVTDIS_OFF          0x8FEF

/* Register FBSLIM (0x2bf10)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBSLIM;
#define _FBSLIM(x) __attribute__((address(0x2bf10),deprecated_definition("consider migrating to #pragma config"),section("__FBSLIM.sec"),space(prog))) __prog__ uint16_t _FBSLIM = (x);

/*
** Only one invocation of FBSLIM should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBSLIM.
** Multiple options may be combined, as shown:
**
** _FBSLIM( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Flash Page Address Limit bits:
**     BSLIM_BSLIM          Boot Segment Flash page address  limit
**
*/

#define BSLIM_BSLIM          0x0000

/* Register FSIGN (0x2bf14)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSIGN;
#define _FSIGN(x) __attribute__((address(0x2bf14),deprecated_definition("consider migrating to #pragma config"),section("__FSIGN.sec"),space(prog))) __prog__ uint16_t _FSIGN = (x);

/*
** Only one invocation of FSIGN should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSIGN.
** Multiple options may be combined, as shown:
**
** _FSIGN( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FOSCSEL (0x2bf18)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0x2bf18),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

