wdsll/OBC/WOBC第一阶段资料/3 程序源码/1 PFC DSP/TTPLPFC6600W_20230813.X/TTPLPFC6600W_20230813.X/TTPLPFC6600W.X/p33CK256MP506.h
extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0x15f1c),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Mode Select bits:
**     POSCMD_EC            EC (External Clock) Mode
**     POSCMD_XT            XT Crystal Oscillator Mode
**     POSCMD_HS            HS Crystal Oscillator Mode
**     POSCMD_NONE          Primary Oscillator disabled
**
**   OSC2 Pin Function bit:
**     OSCIOFNC_ON          OSC2 is general purpose digital I/O pin
**     OSCIOFNC_OFF         OSC2 is clock output
**
**   Clock Switching Mode bits:
**     FCKSM_CSECME         Both Clock switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock switching is enabled,Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock switching and Fail-safe Clock Monitor are disabled
**
**   PLL Lock Status Control:
**     PLLKEN_OFF           PLL lock signal is not used; the PLL clock output will not be disabled if lock is lost
**     PLLKEN_ON            PLL lock signal will be used to disable PLL clock output if lock is lost
**
**   XT Config:
**     XTCFG_G0             4-8 MHz crystals
**     XTCFG_G1             8-16 MHz crystals
**     XTCFG_G2             16-24 MHz crystals
**     XTCFG_G3             24-32 MHz crystals
**
**   XT Boost:
**     XTBST_DISABLE        Default kick-start
**     XTBST_ENABLE         Boost the kick-start
**
*/

#define POSCMD_EC            0x1DC4
#define POSCMD_XT            0x1DC5
#define POSCMD_HS            0x1DC6
#define POSCMD_NONE          0x1DC7

#define OSCIOFNC_ON          0x1DC3
#define OSCIOFNC_OFF         0x1DC7

#define FCKSM_CSECME         0x1D07
#define FCKSM_CSECMD         0x1D47
#define FCKSM_CSDCMD         0x1D87

#define PLLKEN_OFF           0x1CC7
#define PLLKEN_ON            0x1DC7

#define XTCFG_G0             0x11C7
#define XTCFG_G1             0x15C7
#define XTCFG_G2             0x19C7
#define XTCFG_G3             0x1DC7

#define XTBST_DISABLE        0x0DC7
#define XTBST_ENABLE         0x1DC7

/* Register FWDT (0x15f20)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0x15f20),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Run Mode Watchdog Timer Post Scaler select bits:
**     RWDTPS_PS1           1:1
**     RWDTPS_PS2           1:2
**     RWDTPS_PS4           1:4
**     RWDTPS_PS8           1:8
**     RWDTPS_PS16          1:16
**     RWDTPS_PS32          1:32
**     RWDTPS_PS64          1:64
**     RWDTPS_PS128         1:128
**     RWDTPS_PS256         1:256
**     RWDTPS_PS512         1:512
**     RWDTPS_PS1024        1:1024
**     RWDTPS_PS2048        1:2048
**     RWDTPS_PS4096        1:4096
**     RWDTPS_PS8192        1:8192
**     RWDTPS_PS16384       1:16384
**     RWDTPS_PS32768       1:32768
**     RWDTPS_PS65536       1:65536
**     RWDTPS_PS131072      1:131072
**     RWDTPS_PS262144      1:262144
**     RWDTPS_PS524288      1:524288
**     RWDTPS_PS1048576     1:1048576
**     RWDTPS_PS2097152     1:2097152
**     RWDTPS_PS4194304     1:4194304
**     RWDTPS_PS8388608     1:8388608
**     RWDTPS_PS16777216    1:16777216
**     RWDTPS_PS33554432    1:33554432
**     RWDTPS_PS67108864    1:67108864
**     RWDTPS_PS134217728   1:134217728
**     RWDTPS_PS268435456   1:268435456
**     RWDTPS_PS536870912   1:536870912
**     RWDTPS_PS1073741824  1:1073741824
**     RWDTPS_PS2147483648  1:2147483648
**
**   Watchdog Timer Clock Select bits:
**     RCLKSEL_FCY          Use peripheral clk when system clock is not INTOSC/LPRC and device is not in Sleep;otherwise, use INTOSC/LPRC
**     RCLKSEL_FRC          Use FRC when WINDIS = 0, system clock is not INTOSC/LPRC and device is not in Sleep;otherwise, use INTOSC/LPRC
**     RCLKSEL_LPRC         Always use LPRC
**
**   Watchdog Timer Window Enable bit:
**     WINDIS_OFF           Watchdog Timer operates in Window mode
**     WINDIS_ON            Watchdog Timer operates in Non-Window mode
**
**   Watchdog Timer Window Select bits:
**     WDTWIN_WIN75         WDT Windo is 75% of WDT period
**     WDTWIN_WIN50         WDT Window is 50% of WDT period
**     WDTWIN_WIN37         WDT Window is 37.5% of WDT period
**     WDTWIN_WIN25         WDT Window is 25% of WDT period
**
**   Sleep Mode Watchdog Timer Post Scaler select bits:
**     SWDTPS_PS1           1:1
**     SWDTPS_PS2           1:2
**     SWDTPS_PS4           1:4
**     SWDTPS_PS8           1:8
**     SWDTPS_PS16          1:16
**     SWDTPS_PS32          1:32
**     SWDTPS_PS64          1:64
**     SWDTPS_PS128         1:128
**     SWDTPS_PS256         1:256
**     SWDTPS_PS512         1:512
**     SWDTPS_PS1024        1:1024
**     SWDTPS_PS2048        1:2048
**     SWDTPS_PS4096        1:4096
**     SWDTPS_PS8192        1:8192
**     SWDTPS_PS16384       1:16384
**     SWDTPS_PS32768       1:32768
**     SWDTPS_PS65536       1:65536
**     SWDTPS_PS131072      1:131072
**     SWDTPS_PS262144      1:262144
**     SWDTPS_PS524288      1:524288
**     SWDTPS_PS1048576     1:1048576
**     SWDTPS_PS2097152     1:2097152
**     SWDTPS_PS4194304     1:4194304
**     SWDTPS_PS8388608     1:8388608
**     SWDTPS_PS16777216    1:16777216
**     SWDTPS_PS33554432    1:33554432
**     SWDTPS_PS67108864    1:67108864
**     SWDTPS_PS134217728   1:134217728
**     SWDTPS_PS268435456   1:268435456
**     SWDTPS_PS536870912   1:536870912
**     SWDTPS_PS1073741824  1:1073741824
**     SWDTPS_PS2147483648  1:2147483648
**
**   Watchdog Timer Enable bit:
**     FWDTEN_ON_SW         WDT controlled via SW, use WDTCON.ON bit
**     FWDTEN_ON            WDT enabled in hardware
**
*/

